{
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_sport_2789.xml": [
        "Inspired Wales top group as England falter",
        "Delly’s amazing road to NBA glory",
        "Gal lines up SBW bout - and McGuire too",
        "Joey joins the Pommy campaign",
        "Titans v Sea Eagles: Five things we learned"
    ],
    "http://feeds.bbci.co.uk/news/politics/rss.xml": [
        "UK seeks emergency powers to take over British Steel",
        "Laura Kuenssberg: Can UK afford to save British Steel – and can it afford not to?",
        "Grangemouth closure 'not comparable' to British Steel, MPs told",
        "Gove gets peerage in Sunak's resignation honours list",
        "MP sorry for not declaring donation when praising firm"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Business.xml": [
        "Bessent Takes Tricky Center Stage as Trade Wars Roil U.S. Economy",
        "Trade War Forces Tough Question for Retailers: Raise Prices or Eat the Cost?",
        "As Tariffs Hit, Americans Are Racing to Buy Car Seats, iPhones and Christmas Gifts",
        "How the Crypto Industry’s Political Spending Is Paying Off",
        "6 Ways to Calm Your Anxiety When Economic Stress Flares"
    ],
    "http://www.film-news.co.uk/rss/UK/news": [
        "Mahershala Ali wanted to see if he could act in 'something big' with Jurassic World Rebirth",
        "Aimee Lou Wood 'didn't understand' co-star Lisa's level of fame",
        "Taylor Swift's Eras Tour movie director to helm Bodyguard remake",
        "New documentary a 'window through which you can view the lives' of John Lennon and Yoko Ono",
        "Matthew McConaughey enjoyed performing musical numbers in The Rivals of Amziah King"
    ],
    "http://www.abc.net.au/news/feed/1534/rss.xml": [
        "Dutton pledges one-off 1,200 tax offset to half of taxpayers",
        "LNP senator vows to 'make Australia great again', dismisses Trump link",
        "Allegra Spender disusses collaborating with influencers on social media",
        "Tanya Plibersek discusses uncertainty of the markets from Trump tariffs",
        "How the WA Greens plan to use its crossbench power in the state's new parliament"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Politics.xml": [
        "Trump Adds Tariff Exemptions for Smartphones, Computers and Other Electronics",
        "Musk’s Latest Fraud Finding Isn’t What It Seems",
        "Trade War Forces Tough Question for Retailers: Raise Prices or Eat the Cost?",
        "Whitmer Shows How Democrats Are Playing With Fire in Cozying Up to Trump",
        "As Tariffs Hit, Americans Are Racing to Buy Car Seats, iPhones and Christmas Gifts"
    ],
    "http://feeds.bbci.co.uk/news/technology/rss.xml": [
        "Everyone's jumping on the AI doll trend - but what are the concerns?",
        "Microsoft rolls out AI screenshot tool dubbed 'privacy nightmare'",
        "OpenAI sues Elon Musk claiming 'bad-faith tactics'",
        "Will iPhones cost more because of Trump's tariffs on China?",
        "Leave school phone bans to head teachers, children's commissioner says"
    ],
    "http://www.livemint.com/rss/companies": [
        "Tech giants go big: Alphabet, Nvidia invest in OpenAI co-founder Sutskever's startup- Report",
        "‘Nutella bottles and ketchup,’ LinkedIn user claims to receive ‘fake’ Blinkit COD order; what happens next?",
        "BlackRock CEO Larry Fink warns of recession amid Donald Trump's tariffs: ‘I think we’re very close’",
        "Chevron Ordered to U-Turn Venezuela Oil Ahead of Sanctions",
        "Canadas South Bow cuts crude trading team, focuses on contracted pipeline volumes, sources say"
    ],
    "http://feeds.feedburner.com/daily-express-finance-news": [
        "Join our free WhatsApp Money community to get the latest tips and advice to your phone",
        "Lloyds and Halifax to close combined 21 branches in May - full list",
        "The state pensioners missing out on £11,973 DWP payments",
        "Britain on brink as Donald Trump destroys Rachel Reeves - and YOU will pay",
        "HMRC sending £104 into UK bank accounts before Easter"
    ],
    "http://feeds.arstechnica.com/arstechnica/gadgets": [
        "Turbulent global economy could drive up prices for Netflix and rivals",
        "Chrome’s new dynamic bottom bar gives websites a little more room to breathe",
        "Powerful programming: BBC-controlled electric meters are coming to an end",
        "OnePlus releases Watch 3 with inflated 500 price tag, won’t say why",
        "Google takes advantage of federal cost-cutting with steep Workspace discount"
    ],
    "http://www.manchestereveningnews.co.uk/rss.xml": [
        "Kevin De Bruyne offers update on his future after sending Man City reminder",
        "'Not happy' - What Pep Guardiola saw from his Man City players in Crystal Palace comeback",
        "How to see tonight's Pink Moon as the once-in-a-year lunar event takes place",
        "Body found in search for missing man after desperate appeal from family",
        "Dean Henderson Man United transfer buy-back clause explained as Ruben Amorim 'wants' new goalkeeper"
    ],
    "http://indianexpress.com/section/india/feed/": [
        "WhatsApp down for several users globally, massive outage reported",
        "On way to picnic, 2 Kashmir college students dead as bus meets with accident",
        "AIADMK-BJP alliance doomed to fail, says TN CM Stalin",
        "Statehood is BJP’s promise, no need for Omar Abdullah to seek it: J-K LoP",
        "National Herald case: ED moves to seize assets worth Rs 661 cr"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Technology.xml": [
        "How the Crypto Industry’s Political Spending Is Paying Off",
        "Trump Tariffs Add to Apple’s Long-Standing Innovation Woes",
        "How TikTok’s Parent, ByteDance, Became an A.I. Powerhouse",
        "Big Tech’s Tariff Chaos + A.I. 2027 + Llama Drama",
        "Neutrinos Are Shrinking, and That’s a Good Thing for Physics"
    ],
    "https://www.newscientist.com/feed/home": [
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind",
        "Rereading the best sci-fi writers of all time: Larry Niven",
        "What the new science of magic reveals about perception and free will",
        "US military launches initiative to find the best quantum computer"
    ],
    "http://www.thehindubusinessline.com/news/?service=rss": [
        "Beverages, packaged food, dairy products garner double-digit growth in March quarter : Bizom",
        "Trump exempts smartphones, computers, chips from reciprocal tariffs",
        "Nainar Nagenthran elected as Tamil Nadu BJP chief",
        "From retreat to reclamation: Britain eyes State control in steel-making, India forges ahead with private sector in tow",
        "Trump plans order to enable critical metals stockpiling"
    ],
    "http://feeds.feedburner.com/TheAustralianPolitics": [
        "Culleton lodges appeal",
        "Turnbull dinner cost 30k",
        "Security focus for Abe visit",
        "Judge anger on 10 art claim",
        "Centrelink data to be ‘refined’"
    ],
    "http://feeds.skynews.com/feeds/rss/technology.xml": [
        "Company started by 'two blokes in a Cardiff garage' is about to launch a game-changing space factory",
        "Erin Brockovich: 'My chiropractor saw mud on my stiletto - I said, I've been collecting dead frogs'",
        "From AI Barbie to 'Ghiblification' - how ChatGPT's image generator put 'insane' pressure on OpenAI",
        "Nintendo Switch 2 launches straight into Trump's trade war",
        "Six second AI video requires eight times more more electricity than it takes to charge mobile phone"
    ],
    "http://www.nytimes.com/services/xml/rss/nyt/Business.xml": [
        "Bessent Takes Tricky Center Stage as Trade Wars Roil U.S. Economy",
        "Trade War Forces Tough Question for Retailers: Raise Prices or Eat the Cost?",
        "As Tariffs Hit, Americans Are Racing to Buy Car Seats, iPhones and Christmas Gifts",
        "How the Crypto Industry’s Political Spending Is Paying Off",
        "6 Ways to Calm Your Anxiety When Economic Stress Flares"
    ],
    "http://metro.co.uk/sport/feed/": [
        "Carlo Ancelitti confirms Real Madrid injury boost ahead of Arsenal second leg",
        "Oliver Glasner criticises Jean-Philippe Mateta after Crystal Palace defeat to Manchester City",
        "Arsenal vs Brentford LIVE: Premier League latest score and confirmed lineups",
        "Donald Trump snubs Rory McIlroy as he reveals who he wants to win The Masters",
        "Kevin De Bruyne open to Premier League stay after Manchester City exit"
    ],
    "http://feeds.feedburner.com/NationPBSNewsHour": [
        "News Wrap: Sessions insists he didn’t lie about Russian contacts to Senate",
        "Escaping Harvey Weinstein was a ‘cat-and-mouse game,’ says Katherine Kendall",
        "WATCH: NFL commissioner says players ‘should stand for the national anthem’",
        "Column: For black athletes, wealth doesn’t equal freedom",
        "Twitter chat: How the gun control debate mirrors larger issues of partisanship in America"
    ],
    "http://www.theguardian.com/technology/games/rss": [
        "Blue Prince review – exploring this game may become your new obsession",
        "Rematch packs five-a-side football with sweaty thrills",
        "‘Parents left picking popcorn out of their hair’: the meme-soaked magic of A Minecraft Movie",
        "Bafta games awards 2025: full list of winners",
        "South of Midnight review – beautiful surfaces can’t hide thin gameplay"
    ],
    "http://www.thehindu.com/sport/?service=rss": [
        "IPL 2025, PBKS vs SRH: Punjab Kings elects to bat against Sunrisers Hyderabad",
        "IPL 2025, LSG vs GT | Lucknow Super Giants beat Gujarat Titans by six wickets",
        "Watch: PM Modi: We are working hard to host 2036 Olympics in India",
        "IPL 2025, GT vs LSG | Gujarat Titans’ Glenn Phillips ruled out of IPL due to injury",
        "Former England fast bowler James Anderson awarded knighthood"
    ],
    "http://www.bollywoodnewsworld.com/feed": [
        "Global Getaways: Explore the World and Have the Time of Your Life",
        "How a Family Calendar Can Simplify Your Life and Keep Everyone Organized",
        "Assessment of Land Condition: A Critical Step in Identifying Contaminated Sites",
        "Paris Pleasures: Leisurely Explorations",
        "Fashion Tips for Styling Legs and Hiding Cankles Effectively"
    ],
    "http://qz.com/feed": [
        "Apple's 'complete disaster,' Microsoft's tariff uncertainty, and Amazon's vibe: Tech news roundup",
        "Tesla's moment of truth, Trump Media stock spikes, and Warren Buffett wins again: Markets news roundup",
        "Trade tiffs in Trump-world, Amazon cuts back, and McDonald's lemonade: Business news roundup",
        "The 17 most reliable new cars and SUVs under 30,000, according to Consumer Reports",
        "The Dow spikes 600 points even as trade tensions deepen and consumer confidence falls"
    ],
    "http://feeds.feedburner.com/RockPaperShotgun": [
        "What are we all playing this weekend?",
        "Top up your Steam Deck or ROG Ally X with this hidden 3TB SanDisk Ultra discount",
        "Marvel Rivals Season 2 begins now with Emma Frost, new team-ups and a PC performance boosting mode",
        "James and Nic kick a thing: Sloclap's Rematch edition",
        "Mafia: The Old Country release date pegged for August by now-edited Steam blog"
    ],
    "http://www.chron.com/rss/feed/AP-Technology-and-Science-266.php": [
        "Report: Baylor officials did nothing after being notified of assaults",
        "Japanese leader says he hopes Osaka expo will help reunite a divided world",
        "Doctors remove pig kidney from an Alabama woman after a record 130 days",
        "Alert: An Alabama woman who lived with a pig kidney for a record 130 days had the organ removed and is back on dialysis",
        "Ahead of spaceflight, Katy Perry is reading Carl Sagan and channeling her 'feminine divine'"
    ],
    "http://rss.cnn.com/rss/cnn_health.rss": [
        "RSV hospitalization rate for seniors is 10 times higher than usual for this point in the season",
        "Covid-19 boosters could keep thousands of kids out of hospitals, but uptake remains low",
        "Experimental therapy gantenerumab fails to slow or improve Alzheimer's memory loss in clinical trials",
        "US gets D+ grade for rising preterm birth rates, new report finds",
        "Desperate for heart surgery for their baby, a family feels the effects of pediatric hospital shortages"
    ],
    "http://www.medscape.com/cx/rssfeeds/2700.xml": [
        "Sparsentan Provides Better Proteinuria Reduction in FSGS",
        "Chlorthalidone Increases Kidney Stone Recurrence",
        "Breastfeeding: USPSTF Finds Poor Support in Primary Care",
        "Malnutrition-Related Diabetes Officially Named ‘Type 5’",
        "Iron Overload: What Hematologists Should Know"
    ],
    "http://www.gamespot.com/feeds/mashup/": [
        "Trails Beyond The Horizon Deluxe And Collector's Edition Preorders Available Now",
        "Trails In The Sky 1st Chapter Preorders Are Available Now",
        "Victrix's Premium Arcade Sticks Are Over 50 Off For A Limited Time",
        "How To Solve Sanctum Sigil Puzzles In Blue Prince",
        "Disney Illusion Island PS5 And Xbox Preorders Are Live At Amazon For 30"
    ],
    "http://metro.co.uk/entertainment/gaming/feed/": [
        "Nintendo are repeating some very old mistakes with the Switch 2 – Reader’s Feature",
        "Ex-Nintendo fan sells PS5 Pro to buy Switch 2 – Reader’s Feature",
        "UK retailer GAME sells its office furniture as part of shut down",
        "Nintendo Switch 2 games are £10 off with this free promotion",
        "Mafia: The Old Country release date revealed and it’s a hint at GTA 6"
    ],
    "http://www.standard.co.uk/news/politics/rss": [
        "Labour MP calls for ministers to act over Grangemouth as well as at Scunthorpe",
        "US envoy suggests Ukraine can be partitioned ‘like Berlin post-Second World War’",
        "Hundreds attend funeral of SNP minister Christina McKelvie",
        "Ministers pledge to improve voter ID law as research shows it 'significantly reduces' turnout",
        "Greens oust Labour in north London by-election as party's losing streak in capital continues"
    ],
    "http://feeds.news.com.au/public/rss/2.0/ausit_exec_topstories_385.xml": [
        "Things just got personal again",
        "Mercedes steering health drive",
        "Glimpse of the future at Vegas",
        "Mirror tracks your wrinkles",
        "Samsung QLED takes on OLED"
    ],
    "http://feeds.bbci.co.uk/news/technology/rss.xml#": [
        "Everyone's jumping on the AI doll trend - but what are the concerns?",
        "Microsoft rolls out AI screenshot tool dubbed 'privacy nightmare'",
        "OpenAI sues Elon Musk claiming 'bad-faith tactics'",
        "Will iPhones cost more because of Trump's tariffs on China?",
        "Leave school phone bans to head teachers, children's commissioner says"
    ],
    "http://www.tmz.com/rss.xml": [
        "Missy Elliott Goes Full Transformer Mode at Coachella in Epic Moment",
        "Stars At Coachella -- Day 1 And Tons Of Fun",
        "Stars and Scars -- You Be the Judge",
        "Mark Geragos Deflects When Pressed About Representing Diddy On '2 Angry Men' Podcast",
        "JoJo Siwa's Mom Disgusted by Mickey Rourke's Homophobic Remarks on 'Celebrity Big Brother UK'"
    ],
    "http://feeds.feedburner.com/daily-express-uk-news": [
        "Clintons to close shops as it struggles to cope with Rachel Reeves pay hike",
        "Netflix users urged to be careful as using new feature could land them £1,000 fine",
        "WHSmith announces stores closing in May as 20 branches shutting in 2025 - check your area",
        "M1 traffic LIVE: Nightmare on key motorway as drivers face '2-hour delay'",
        "Protests erupt in beautiful Scottish 'ghost town' as £400m ferries don't fit the harbour"
    ],
    "http://feeds.bbci.co.uk/news/health/rss.xml": [
        "Cancer pill gave me 'four years of extra time'",
        "Saliva test may turn tide on prostate cancer, claim scientists",
        "What goes on inside toddlers' brains?",
        "Infected blood victims losing faith as inquiry hearings restart",
        "Trump threatens to end pharmaceuticals tariff exemption"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Sports.xml": [
        "The Fashion Police Have Arrived at the Masters",
        "The Best-Case Scenario for Shedeur Sanders in the N.F.L. Draft",
        "The M.V.P. of Each N.H.L. Team This Season",
        "Play Connections: Sports Edition. Tackle Today’s Puzzle.",
        "An N.F.L. Draft Guide Unlike Any Other"
    ],
    "http://feeds.feedburner.com/TheAustralianSportsNews": [
        "Legal big gun to help Blues",
        "Rioli wins place among greats",
        "Rich continue their rebellion",
        "Lealiifano has new focus",
        "Taxman joins gold rush"
    ],
    "http://feeds.news.com.au/public/rss/2.0/business_top_stories_346.xml": [
        "‘I have a conflict situation as President’",
        "ALDI’s tough stance on alcohol",
        "Creepy Airbnb host reveals ulterior motive",
        "The crazy thing we’re still buying",
        "Why you’re getting poorer right now"
    ],
    "http://feeds.nbcnews.com/feeds/health": [
        "RFK Jr. calls FDA a 'sock puppet' for industries in private speech to agency staff",
        "Map: Track the spread of measles in the U.S.",
        "Teddi Mellencamp posts before-and-after pics of last 4 months of cancer journey",
        "Video captures woman having stroke on TikTok Live: 'One of the scariest things'",
        "RFK Jr. falsely claims measles vaccine protection 'wanes very quickly'"
    ],
    "http://feeds.feedburner.com/factmag": [
        "Interview: Gabriel Moses",
        "Gabriel Moses announces largest ever exhibition at 180 Studios",
        "Interview: Cecilia Bengolea on her dancehall film for VF: Reverb",
        "The Vinyl Factory: Reverb exhibition extended until 2 March",
        "Es Devlin: Screenshare"
    ],
    "http://feeds.feedburner.com/BreitbartFeed": [
        "Border Patrol Adviser: Military Taking Over Federal Lands on Border Gives Us Extra Charges to File Against Crossers",
        "Trump’s Wild Card: EPA Chief Lee Zeldin to Go Full MAGA in Fight Club Live Event",
        "Exclusive — Tom Tiffany: China Is an Adversary and a Threat",
        "Trump Urges Putin to End 'Senseless' War in Ukraine",
        "Bomb Explodes Outside Train Station in Greek Capital Athens"
    ],
    "http://betakit.com/feed/": [
        "Wealthsimple’s acquihire, Shopify’s AI policy, and Nintendo’s Switch 2 confusion",
        "150 Canadian tech leaders urge federal parties to deliver plan for economic sovereignty in open letter",
        "Vancouver-based CO280 strikes 12-year carbon removal deal with Microsoft",
        "Corinex secures 42 million CAD to continue its European expansion",
        "Puzzle Medical raises 43 million to pursue clinical trial of less-invasive device for patients with heart failure"
    ],
    "http://feeds.feedburner.com/NewshourWorld": [
        "Xi Jinping celebrates China’s rising power — and his own",
        "The battle for Mosul is over, but this hidden ISIS danger could lurk for years",
        "As Rohingya refugees continue to flee from persecution, here’s how you can help",
        "Tillerson: ‘Heartbreaking’ reports of suffering in Myanmar",
        "Far-right groups gain ground in Sweden and Germany amid migrant influx"
    ],
    "http://www.express.co.uk/posts/rss/79/showbiznews": [
        "Full list of BBC stars who have died in 2025 in tragic year for broadcaster",
        "Jeremy Clarkson's £85 menu sparks outrage with Farmer's Dog customers over same complaint",
        "Davina McCall issues emotional health update after major brain tumour surgery",
        "Brian May makes huge music comeback on stage months after suffering major stroke",
        "Stacey Solomon and Joe Swash address son's absence after BBC fans notice 'missing' child"
    ],
    "http://www.skysports.com/rss/0,20514,12040,00.xml": [
        "McLaren set incredible pace as Piastri dominates Norris ahead of qualy",
        "Women's Six Nations LIVE Red Roses travel to face Ireland in Cork",
        "Impressive Alcaraz reaches Monte-Carlo Masters final",
        "EFL: WBA lead; Sunderland level | Leeds win Sheff U lose in early drama LIVE",
        "The Masters LIVE Early starters chase Rose, DeChambeau and McIlroy"
    ],
    "http://www.tigsource.com/feed/": [
        "Black Lives Matter",
        "The Wholesome Competition",
        "Dive into Early Access with We Need to go Deeper",
        "A Good Bundle – This is Fine",
        "Fantastic Arcade 2016"
    ],
    "http://feeds.webservice.techradar.com/us/rss/new": [
        "Cheaper than Black Friday: Samsung has a massive clearance sale on best-rated TVs - save up to 1,300",
        "Netflix is testing an AI search engine to supercharge your recommendations",
        "With this simple gadget, you can make great-tasting pour-over coffee with fewer beans",
        "The end is nigh for Windows 10 – here are 5 things Microsoft must do to get people to love Windows 11",
        "‘It will take time for foldables to become mainstream’: OnePlus defends decision to delay the OnePlus Open 2 and bow out of the foldable phones race in 2025"
    ],
    "http://www.bollywoodhungama.com/rss/news.xml": [
        "Vikrant Massey growing his beard for the role of Gurudev Sri Sri Ravi Shankar?",
        "Nora Fatehi and Jason Derulo’s ‘Snake’ slithers to rank 1 on UK British Asian Music Charts",
        "Kartik Aaryan to have a double role in Nagzilla; to be the hero villain like SRK in Jawan?",
        "Aamir Khan shoots special song with Genelia Deshmukh for Sitaare Zameen Par",
        "Kapil Sharma to star in new comedy film with Riddhima Kapoor Sahni in her debut: Report"
    ],
    "http://thewalrus.ca/feed/": [
        "The Secret Language We Share with Our Children",
        "Weekly Quiz: Plastic Pollution, Indian Interference, and Toronto’s Multicultural Accent",
        "The Kids Are Leaning Right: How the Manosphere Is Shaping Voters",
        "The Toronto Accent Is Real",
        "Anti-Trans Narratives Are Creeping into This Election"
    ],
    "http://www.thehindu.com/news/international/south-asia/?service=rss": [
        "Explained | The BRICS common currency push",
        "When did humans first arrive in Southeast Asia?",
        "Why It Matters | Using disposable diapers to make concrete?",
        "Data | Nearly 40 Indians paid bribes to use public services, highest among most Asian nations",
        "Death sentences of 15 convicts upheld in murder case"
    ],
    "http://www.polygon.com/rss/index.xml": [
        "In another universe, Steve Martin voiced Goofy in A Goofy Movie",
        "Roblox is secretly host to some wild Warhammer 40K fan games",
        "The Wheel of Time’s big battle episode is the finest kind of fantasy flex",
        "The best thrillers to watch on Netflix this April",
        "Mickey 17, Novocaine, G20 on Prime Video, and every movie new to streaming this weekend"
    ],
    "http://www.theguardian.com/au/rss": [
        "Albanese to pledge 10bn to help build 100,000 homes for first-time buyers",
        "Child killer Rick Thorburn, who murdered Tiahleigh Palmer, found dead in Queensland jail cell",
        "‘Space junk’: huge astronaut statue coming to Perth park is one giant leap too far for many",
        "‘Completely out of touch’: golf and dinners for ‘king’ Trump as economy melts down",
        "Prince Harry ‘exhausted’ by legal battle over UK police protection"
    ],
    "http://feeds2.feedburner.com/bit-tech/all": [
        "The end",
        "Intel Core i9-12900K claimed to be the World's Best Gaming Processor",
        "Inscryption Review",
        "PrimeStation Pulsar fanless workstation PC unveiled",
        "Shadow of the Tomb Raider gets Denuvo removal boost"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Health.xml": [
        "Experts Doubt Kennedy’s Timetable for Finding the Cause of Autism",
        "RFK Jr. Accuses FDA of Drug Industry Influence That Barred Alternative Remedies",
        "Pig Kidney Removed From Alabama Woman After Organ Rejection",
        "Trump Administration Delays Plan to Limit Pricey Bandages",
        "Medicare Bleeds Billions on Pricey Bandages, and Doctors Get a Cut"
    ],
    "http://feeds.bbci.co.uk/news/world/rss.xml": [
        "Iran says it wants 'fair agreement' as nuclear talks with US begin in Oman",
        "US special envoy meets Putin as Trump urges Russia to 'get moving' on Ukraine ceasefire",
        "Trump exempts smartphones and computers from new tariffs",
        "Judge allows Columbia graduate Mahmoud Khalil's deportation",
        "Nigerian bandit kingpin and 100 followers killed"
    ],
    "http://www.thehindu.com/sci-tech/technology/?service=rss": [
        "UPI outage: Several users say transactions failing; NPCI says working to resolve ‘intermittent technical issues’",
        "Government sites start trying Hindi web addresses",
        "Asus Vivobook S 14 OLED Review | For users needing portability and decent power, it’s a reasonable pick",
        "Meta to add Dina Powell McCormick, Patrick Collison to board",
        "Tesla stops taking new orders in China for two imported, U.S.-made models"
    ],
    "http://thecaucus.blogs.nytimes.com/feed/": [
        "Trump Adds Tariff Exemptions for Smartphones, Computers and Other Electronics",
        "Musk’s Latest Fraud Finding Isn’t What It Seems",
        "Trade War Forces Tough Question for Retailers: Raise Prices or Eat the Cost?",
        "Whitmer Shows How Democrats Are Playing With Fire in Cozying Up to Trump",
        "As Tariffs Hit, Americans Are Racing to Buy Car Seats, iPhones and Christmas Gifts"
    ],
    "http://feeds.theguardian.com/theguardian/politics/rss": [
        "MPs approve British Steel bill after Chinese owners’ ‘excessive’ demands – live",
        "UK MPs post selfies to show attendance of rare Saturday session in parliament",
        "Ministers raise concern over NASUWT move for ‘combative’ ex-FBU chief",
        "Starmer steps in to seize control of British Steel with nationalisation likely",
        "Starmer aiming to ‘pass emergency legislation in one day’ to save British Steel – as it happened"
    ],
    "http://www.theguardian.com/music/rss": [
        "Olly Alexander review – part night creature, part light entertainer",
        "One to watch: Pozer",
        "Pauline Black: ‘My most unappealing habit? Bluntness’",
        "TV on the Radio’s Tunde Adebimpe: ‘I remember thinking I never want to do this again’",
        "Coachella 2025: desert festival balances the new and the nostalgia"
    ],
    "http://feeds.bbci.co.uk/news/entertainment_and_arts/rss.xml": [
        "Spike Island: How The Stone Roses inspired Pulp",
        "Elton celebrates 'extraordinary' 10th number one album",
        "How 'deaf rage' inspired groundbreaking sign language thriller",
        "Minecraft Movie behaviour 'way too funny', director says",
        "Will Poulter and Kit Connor: We shaved each other's heads before filming Warfare"
    ],
    "http://deadline.com/feed/": [
        "Prince Harry Claims Police Protection “Was Withdrawn To Trap Me”",
        "Freddie Flintoff Reveals Healed Face Ahead Of Disney+ Documentary Detailing His ‘Top Gear’ Accident",
        "‘Harry Potter’ Actor Nick Moran Recovering After Emergency Surgery For “Life-Threatening Condition”",
        "‘Saturday Night Live UK’ Eyes ‘Late Late Show’ Producer James Longman As Showrunner",
        "Mel B Gives Biggest Hint Yet That Spice Girls Will Reunite For 30th Anniversary"
    ],
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_business_2783.xml": [
        "Beach Boy ‘witnessed a Manson murder’",
        "Oil rise fails to lift stocks",
        "Home loan approvals bounce back",
        "Union seeks say in Arrium future",
        "Banks an early drag on stocks"
    ],
    "http://www.popsci.com/rss.xml": [
        "Here’s a PDF editor that won’t make you cry",
        "Are cats really afraid of cucumbers? We asked the experts.",
        "Never leave home without an Apple Watch Charger with this keychain version, now 15",
        "Ancient rocks tie Roman Empire’s collapse to a mini ice age",
        "Amazon trained Prime drivers to use defibrillators"
    ],
    "http://timesofindia.indiatimes.com/rssfeeds/2886714.cms": [
        "Valley fever turning into an endemic in California: Scientists find a strong link to dogs",
        "​Can cracking joints lead to arthritis? Fact-check​",
        "This popular GLP-1 drug helps shed massive amount of weight and keep it off for years, find scientists",
        "Brain teaser: Only those with a sharp vision can find a mistake in this image in just 7 seconds",
        "Bengaluru woman reduces 56 kilos; shares diet, workout plan: Here's her little secret to weight loss"
    ],
    "http://globalnews.ca/canada/feed/": [
        "Poilievre heads to Carney’s riding, announces help for military veterans",
        "Could your next surgery be done by a robot? Meet the patient who tried it",
        "Ukrainian family in Canada facing new struggle with son’s cancer diagnosis",
        "Demidov fever; new Montreal Canadiens sniper bringing fanfare frenzy",
        "On the Brink: Rent is eating up half her pay, payday loans made it worse"
    ],
    "http://www.femina.in/feeds/feeds-lifestyle.xml": [
        "Did you know that rose is 35 million year-old?",
        "How to tell a good loan from a bad one",
        "Safety tips for solo woman traveller",
        "Bollywood posters copied from Hollywood",
        "Tips to make your small house look bigger"
    ],
    "http://www.theguardian.com/science/rss": [
        "Jawbone fossil builds richer image of ancient Denisovans",
        "Greek vase ‘looted’ in Italy removed from sale by London gallery",
        "At-home saliva test for prostate cancer better than blood test, study suggests",
        "US scientists create most comprehensive circuit diagram of mammalian brain",
        "Next Nasa leader says he would prioritize US missions to Mars if confirmed"
    ],
    "http://www.economist.com/blogs/blighty/index.xml": [
        "Fingerspitzengefühl",
        "Pay takes a pounding",
        "The real taboo",
        "Current concern",
        "No reservations"
    ],
    "http://www.nasa.gov/rss/dyn/breaking_news.rss": [
        "Sols 4507-4508: “Just Keep Driving”",
        "NASA-Developed Tools at Marshall Support Operations to Space Station",
        "GLOBE Mission Earth Supports Career Technical Education",
        "Apollo 13 Launch: 55 Years Ago",
        "NASA’s IMAP Arrives at NASA Marshall For Testing in XRCF"
    ],
    "http://rss.sciam.com/ScientificAmerican-News": [
        "Stunning Comet Could Photobomb This April's Total Solar Eclipse",
        "The Industrial Designer behind the N95 Mask",
        "An Evolutionary 'Big Bang' Explains Why Snakes Come in So Many Strange Varieties",
        "JWST Is Tracking Down the Cosmic Origins of Earth's Water",
        "Flimsy Antiabortion Studies Cited in Case to Ban Mifepristone Are Retracted"
    ],
    "http://feeds.news.com.au/public/rss/2.0/news_tech_506.xml": [
        "Galaxies collide in stunning picture",
        "Apple’s biggest product since the iPhone",
        "Rare ‘Morning Glory’ cloud dazzles Virgin flyers",
        "Towns ‘too hot to wear shorts’",
        "The gadget for the perfect coffee"
    ],
    "http://www.engadget.com/rss.xml": [
        "Engadget review recap: The Pixel 9a, smart glasses and AMD's latest CPU",
        "Meta's new board members include former Trump security advisor",
        "How to use the Apple Passwords app",
        "Nintendo Switch 2 recent updates: Release date, price, new games and everything else you need to know",
        "The Social Security Administration is reportedly moving all official communication to X"
    ],
    "http://www.journaldemontreal.com/rss.xml": [
        "50 000 d’amende: une prétendue séparation pour évincer leur locataire de 68 ans",
        "La fièvre du hockey au secours des Québécois",
        "Coup d’éclat de citoyens sur le site de Stablex",
        "Rage au volant mortelle: le Montréalais accusé libéré sous caution",
        "Quand les syndicats trahissent les Québécois"
    ],
    "http://globalnews.ca/tech/feed/": [
        "Filing your taxes? You might run into this CRA website ‘issue’",
        "Elon Musk says he plans to send his humanoid robots to Mars by 2026",
        "TikTok deal deadline extended after China pulled out over tariffs: reports",
        "Will TikTok be banned in U.S. again? Trump signals deal could be found",
        "What to know about Israeli spyware allegedly used by Ontario police"
    ],
    "http://feeds.arstechnica.com/arstechnica/technology-lab": [
        "That groan you hear is users’ reaction to Recall going back into Windows",
        "Researcher uncovers dozens of sketchy Chrome extensions with 4 million installs",
        "Researchers concerned to find AI models misrepresenting their “reasoning” processes",
        "OpenAI helps spammers plaster 80,000 sites with messages that bypassed filters",
        "After months of user complaints, Anthropic debuts new 200/month AI plan"
    ],
    "http://www.theguardian.com/world/usa/rss": [
        "Trump administration to exempt smartphones and computers from China tariffs",
        "Police searching for man who allegedly sexually abused corpse on New York subway",
        "‘It’s going to be messy’: Americans on how Trump’s tariffs are shaping their spending",
        "‘A new golden age’: how rightwing media stuck by Trump as global markets collapsed",
        "‘If there’s fascism we need to call it out’: Delaware governor on post-Biden world"
    ],
    "http://www.nytimes.com/services/xml/rss/nyt/Health.xml": [
        "Experts Doubt Kennedy’s Timetable for Finding the Cause of Autism",
        "RFK Jr. Accuses FDA of Drug Industry Influence That Barred Alternative Remedies",
        "Pig Kidney Removed From Alabama Woman After Organ Rejection",
        "Trump Administration Delays Plan to Limit Pricey Bandages",
        "Medicare Bleeds Billions on Pricey Bandages, and Doctors Get a Cut"
    ],
    "http://www.indodaily.com/indodaily.xml": [
        "ISRO completes extended plasma thruster test for future satellite propulsion",
        "Nepal fights wildfires and pollution amidst drier winter",
        "US storms, 'devastating' flooding death toll climbs to 17",
        "India's TCS posts small profits dip in 'challenging' environment",
        "India's Modi clinches defence, energy deals in Sri Lanka"
    ],
    "http://feeds.nbcnews.com/feeds/science": [
        "Trump signs executive order to boost U.S. coal industry, in part to fuel artificial intelligence",
        "A proposed tax credit could help homeowners hit by climate-fueled natural disasters",
        "Scientists genetically engineer wolves with white hair like the extinct dire wolf",
        "Rare virus that killed Gene Hackman's wife linked to 3 deaths in California town",
        "5 nurses who work on the same floor at Massachusetts hospital have brain tumors"
    ],
    "http://fivethirtyeight.com/politics/feed/": [
        "What Americans Think Of The Biden Impeachment Inquiry",
        "The Second GOP Debate Could Be Smaller, With Or Without Trump",
        "The Senate Is Losing One Of Its Few Remaining Moderate Republicans",
        "Why ‘Bidenomics’ Isn’t Working For Biden",
        "Why Biden Is Losing Support Among Voters Of Color"
    ],
    "http://www.dailymail.co.uk/auhome/index.rss": [
        "Huge Trump tariff U-turn will exempt iPhone and laptops",
        "Labor and Coalition launch big-spending promises as parties try to lure voters with big giveaways on income tax and housing",
        "Delta flyer stuns fellow lounge guests with outrageous move: 'Obscene'",
        "Muslim leader's shocking message and threat to 'filthy human' Peter Dutton",
        "Lady Gaga's 'unsettling' Coachella performance with 'satanic rituals' has fans all saying the same thing after watching pop star's opera-themed set"
    ],
    "http://feeds.nbcnews.com/feeds/todayentertainment": [
        "WrestleMania 41 (featuring a heel John Cena) is this month. What to know and how to watch",
        "Is ‘Saturday Night Live’ new tonight? About the April 12 episode",
        "Adam Levine shares which Maroon 5 song he thought would be a ‘career ender’",
        "Who is Rebecca Gayheart? What to know about Eric Dane's wife",
        "'MobLand' is shattering streaming records. Here's when new episodes come out"
    ],
    "http://www.gamesindustry.biz/rss/gamesindustry_news_feed.rss": [
        "Influencer report highlights gender pay gap in sponsored content earnings",
        "Tariffs are an industry nightmare, but digital games seem safe – for now | Opinion",
        "Tequila Works auctions off game rights and IP following insolvency",
        "Video game MA activity rises to 6.6 billion in Q1 2025, driven by mobile acquisitions",
        "Agonalea Games secures 2m in funding from Mika Capital"
    ],
    "http://www.theguardian.com/world/australian-politics/rss": [
        "Albanese to pledge 10bn to help build 100,000 homes for first-time buyers",
        "PM and opposition leader campaign in Perth – as it happened",
        "Revealed: nearly 2m hectares of koala habitat bulldozed since 2011 – despite political promises to protect species",
        "Liberal candidate co-authored inquiry submission suggesting Hazaras not persecuted for ethnicity in Afghanistan",
        "Stubborn or resolute: Anthony Albanese’s lifelong political instinct faces final judgment"
    ],
    "http://feeds.news.com.au/public/rss/2.0/cpost_news_entertainment_3329.xml": [
        "Sounds exhilarating",
        "Eyes on world",
        "Waifs celebrate 25 years with Cairns concert",
        "Big year to play host",
        "Exciting stage of life"
    ],
    "http://www.cbsnews.com/latest/rss/entertainment": [
        "F. Scott Fitzgerald's novel The Great Gatsby turns 100",
        "Grey's Anatomy star Eric Dane reveals he's been diagnosed with ALS",
        "Sony wins distribution rights to Wheel of Fortune, Jeopardy",
        "Cannes Film Festival unveils full list of 2025 competition titles",
        "2025 National Recording Registry additions: Elton John, Celine Dion, Amy Winehouse and Hamilton"
    ],
    "http://feeds.feedburner.com/thedailybeast/articles": [
        "Donald Trump Cancels Second Mainstream Interview in Days",
        "Mitch McConnell Called Donald Trump a ‘Stupid’ and ‘Despicable Human Being’",
        "Witnesses Say Would-Be Organ Donor Started ‘Thrashing’ on the Table",
        "Menendez Family Members: We Had ‘Gut-Level’ Fears Erik and Lyle Were Sexually Abused",
        "Liam Payne 911 Caller Said One Direction Star’s Life Could Be in Danger Minutes Before Death"
    ],
    "http://www.theguardian.com/world/rss": [
        "Coup leader favourite in presidential race as Gabon goes to the polls",
        "Zimbabwe starts compensating white farmers 25 years after land seizures",
        "Weather tracker: early heatwave sweeps northern India",
        "Bobi Wine to run for president in Uganda’s 2026 election ‘if I am still alive and not in jail’",
        "UK to co-host global conference with aim of resolving Sudan’s civil war"
    ],
    "http://feeds.bbci.co.uk/news/world/us_and_canada/rss.xml": [
        "US special envoy meets Putin as Trump urges Russia to 'get moving' on Ukraine ceasefire",
        "US coffee shops worried about bitter price hike after tariffs",
        "Judge allows Columbia graduate Mahmoud Khalil's deportation",
        "US pastor kidnapped during church service in South Africa",
        "RFK Jr pledges to find the cause of autism by September"
    ],
    "http://feeds.theguardian.com/theguardian/uk/sport/rss": [
        "Nottingham Forest v Everton, Brighton v Leicester and more: clockwatch – live",
        "De Bruyne leads Manchester City to comeback thrashing of Crystal Palace",
        "Beever-Jones breaks Liverpool hearts to send Chelsea into Women’s FA Cup final",
        "Rory McIlroy back in the mix after prayers answered around Amen Corner",
        "County cricket: Lancashire v Northants, Surrey v Hampshire and more – live"
    ],
    "http://www.techtree.com/rss.xml": [
        "“It’s the all-in-one capabilities that make UST projectors a hit in home entertainment,” says Sushil Motwani",
        "“Laser projectors can drive the green revolution in the home entertainment segment,” says Sushil Motwani",
        "Top home projectors to elevate your F1 racing experience",
        "POCO C71: Segment’s Ultimate Blockbuster is Here",
        "UNIX Launches Solo (UX-900 Pro) Neckband with ENC Technology and up to 62+ Hours of Playtime"
    ],
    "http://www.destructoid.com/?mode=atom": [
        "Brookhaven Easter Egg Hunt Guide [EASTER]",
        "CDawgVA Cyclethon 4: Schedule, Guests, and everything we know",
        "All NBA 2K25 2KTV answers: Episodes 1-29",
        "How to get the free Emma Frost Golden Diamond skin in Marvel Rivals season 2",
        "How to improve your Infinisuit in Crashlands 2"
    ],
    "http://feeds.lexblog.com/foodsafetynews/mRcs": [
        "West Virginia governor signs food dye ban into law",
        "Twelve E. coli cases under investigation in Latvia",
        "Australians warned about wild mushroom risk",
        "Nearly 900 cases of Coca-Cola recalled because of plastic contamination",
        "McDonald’s food safety ad: A rare move in a quiet industry"
    ],
    "http://www.theguardian.com/fashion/rss": [
        "We love: fashion fixes for the week ahead – in pictures",
        "Balenciaga and orthopaedic brand Scholl team up for ‘Frankenshoe’ hybrid",
        "The perfect ‘new’ handbag? An old one | Jess Cartner-Morley on fashion",
        "Cool condiments: ‘little treat culture’ leading to boom in preserves and sauces",
        "Prada buys Versace in 1.25bn deal uniting Italy’s biggest fashion brands"
    ],
    "http://feeds.bbci.co.uk/news/business/rss.xml": [
        "Government aims to take control of British Steel",
        "Laura Kuenssberg: Can UK afford to save British Steel – and can it afford not to?",
        "Why is British Steel in trouble and who owns it?",
        "US coffee shops worried about bitter price hike after tariffs",
        "Why Beijing is not backing down on tariffs"
    ],
    "http://www.medpagetoday.com/rss/Headlines.xml": [
        "States Advance Fetal Rights Measures That Critics Warn Could Lead to Abortion Bans",
        "Retrospective Study Links COVID in Kids With Post-Acute Kidney Outcomes",
        "U.S. Pregnancy-Related Deaths Rise Over 5 Years",
        "One Diuretic May Be Better for Hypertensive Patients With Kidney Stone History",
        "Narcolepsy-CVD Link: Stage Is Set as Early as Childhood"
    ],
    "http://www.popsugar.co.uk/celebrity/feed": [
        "Bridgerton's Hannah Dodd: Francesca Doesn't Chase Validation Like Her Siblings",
        "Tasha Ghouri: I Lost Friends and Family Due To Instant Fame",
        "The 24 Sexiest Movie Scenes of All Time",
        "How To Date Billy Walsh Charithra Chandran and Sebastian Croft on Rom-Com Diversity",
        "Kate's Cancer Diagnosis: Why Are Women Always Pressured to Show Up?"
    ],
    "http://www.dailymail.co.uk/news/index.rss": [
        "Who was evicted from Celebrity Big Brother? First housemate of series axed in bombshell decision",
        "Prince Harry claims his police protection was taken away to 'trap' him and Meghan Markle in the UK as he says his 'worst fears have been confirmed' by secret evidence from court case",
        "Beckhams 'blank Brooklyn' on his wedding anniversary as he celebrates third year with Nicola Peltz",
        "Cancer dietitian reveals controversial snack that wards off cancer",
        "Freddie Flintoff shows off his fully healed face as he announces new Disney+ documentary about horror Top Gear crash - two years after the accident left him 'lucky to be alive'"
    ],
    "http://www.pcworld.com/index.rss": [
        "Don’t pay more for Windows Pro’s features. Use these free tools instead",
        "Only 56 for the coding journey you’ve been putting off for years",
        "Get this Acer gaming laptop with RTX 4070 for a crazy 600 off",
        "Best smart garage door opener controllers",
        "Why is Windows 11’s April update creating a mysterious ‘inetpub’ folder?"
    ],
    "http://globalnews.ca/category/entertainment/feed/": [
        "Mick Jagger engaged to Melanie Hamrick, who says marriage is a ‘maybe’",
        "Eric Dane, ‘Grey’s Anatomy’ star, says he’s been diagnosed with ALS",
        "Captain Canuck comes to save Canadians in trade war-inspired comic",
        "Mickey Rourke gets ‘warning’ for homophobic remarks on ‘Celebrity Big Brother U.K.’",
        "Weezer bassist’s wife shot by police, arrested for attempted murder"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Upshot.xml": [
        "Musk’s Latest Fraud Finding Isn’t What It Seems",
        "Why I.R.S. Audits, Already at Their Lowest Levels, May Fall Further",
        "The Three States That Are Especially Stuck if Congress Cuts Medicaid",
        "For Republicans, Tariffs Pose a Risk Like No Other",
        "How Musk and Trump Are Working to Consolidate Government Data About You"
    ],
    "http://economictimes.indiatimes.com/rssfeedsdefault.cms": [
        "Nifty bulls in panic mode. Peter Lynch's 4 rules for surviving market mayhem",
        "Smallcaps stumble but Avanti Feeds, Senco Gold, 8 others shine with weekly gains up to 22",
        "Noida man duped of Rs 1 crore in WhatsApp-based stock trading scam",
        "Vijay Kedia trims stake in Global Vectra in March quarter. Here’s how this smallcap stock has performed",
        "Stay local, stay resilient: Aditya Khemka recommends healthcare, consumption plays"
    ],
    "http://www.entertainmentnews.co.uk/feed/": [
        "Digital jukebox network AMI Entertainment signs with 7digital, a Songtradr company, as a client",
        "7digital, a Songtradr Company, Powers the Launch of Popular Music on Canva",
        "7digital and Pex partner to create opportunities for rightsholders and UGC platforms",
        "7digital announces support of Stationhead live commerce feature",
        "Pinterest strikes deals with Warner, Merlin, BMG and 7digital to expand music experience on the platform"
    ],
    "http://grantland.com/hollywood-prospectus/feed/": [
        "Brand Echh: Sandra Bullock and Billy Bob Thornton Can’t Save the Lame ‘Our Brand Is Crisis’",
        "50 Scenes That Do Not Appear in the Fox ‘X-Files’ Revival",
        "In Praise of Beach Slang, 2015’s Best, Most Sincere Rock Band",
        "Who Was Missing From Taylor Swift’s Miami Squad?",
        "Happy ‘Halloween’: The Best Horror-Movie Monsters"
    ],
    "http://feeds.bbci.co.uk/sport/0/cricket/rss.xml?edition=uk": [
        "ICC urged to consider future status of T10 format",
        "Wong shines for England A in Sydney",
        "Sunrisers Hyderabad v Punjab Kings - IPL scorecard",
        "Karachi Kings v Multan Sultans - PSL scorecard",
        "Record wicket-taker Anderson to be knighted"
    ],
    "http://www.smh.com.au/rssheadlines/technology-news/article/rss.xml": [
        "There’s one way you can make your super more secure",
        "Introducing NEO Gamma - Another Step Closer to Home",
        "New Elder Scrolls Online expansion unveiled",
        "Did an AI chatbot help draft the US tariff policy?",
        "Have we reached the point of ‘peak connectivity’? We’re just getting started"
    ],
    "http://rss.cnn.com/rss/cnn_allpolitics.rss": [
        "How Kyrsten Sinema's decision makes Democrats' 2024 Senate map tighter",
        "Meet the woman steering Biden's bipartisan winning streak on Capitol Hill",
        "CNN Political Briefing",
        "The Axe Files with David Axelrod",
        "Margins of Error"
    ],
    "http://rss.cnn.com/rss/cnn_showbiz.rss": [
        "Kirstie Alley, 'Cheers' and 'Veronica's Closet' star, dead at 71",
        "John Travolta and Kirstie Alley: A love story",
        "Chelsea Handler, Leslie Jones and John Leguizamo among guest hosts to step in for Trevor Noah on 'The Daily Show'",
        "Ashton Kutcher and twin Michael talk health, guilt and rift between them",
        "Bong Joon Ho's 'Mickey 17' gets trailer and release date"
    ],
    "http://feeds.feedburner.com/uk/gizmodo": [
        "Ignore the Tariffs, Apple Is Slashing the Price of Its iPad 10 to a Record Low (50 Off)",
        "Dinosaurs Weren’t Fading Before the Asteroid—We Just Suck at Finding Their Fossils",
        "Even Cheaper Than During Black Friday, This 10,000mAh Portable Charger Is Flying Off Amazon’s Shelves",
        "Despite The Tariff Hike, Amazon Continues to Offer The Dyson V11 at Its Lowest Price of 2025",
        "If You’ve Ever Had a Google Alert for a Hacked Password, This Nearly Free Tool Is Your Best Defense"
    ],
    "http://feeds.theguardian.com/theguardian/technology/rss": [
        "Tesla stops taking orders in China for two models imported from US",
        "OpenAI countersues Elon Musk over ‘unlawful harassment’ of company",
        "Amazon’s satellite launch designed to compete with Musk’s Starlink cancelled",
        "Sledgehammer-wielding Musk critics smash up Tesla in London art project",
        "Apple said to be flying iPhones from India to US to avoid Trump tariffs"
    ],
    "http://feeds.dailykos.com/dailykos/index.xml": [
        "Caribbean Matters: A spotlight on who's fighting to save the planet",
        "Cartoon: For adults only",
        "Trump's tariffs will make things so damn expensive for everyone",
        "The Recap: Trump kiss-ass reaches gaudy new low, and dodgy DOGE bails out Tesla",
        "Cartoon: Republican economic innovations"
    ],
    "http://feeds.arstechnica.com/arstechnica/science": [
        "A guide to the “platonic ideal” of a Negroni and other handy tips",
        "Quantum hardware may be a good match for AI",
        "Rocket Report: “No man’s land” in rocket wars; Isaacman lukewarm on SLS",
        "New simulation of Titanic’s sinking confirms historical testimony",
        "Painted altar in Maya city of Tikal reveals aftermath of ancient coup"
    ],
    "http://www.theregister.co.uk/science/headlines.atom": [
        "UK's answer to DARPA sprouts new ideas, like programmable plants",
        "Laser-cooled chips: Maybe coming soon-ish to a datacenter near you",
        "Canada OKs construction of first licensed teeny atomic reactor",
        "Boffins turn Moon dirt into glass for solar panels, eye future lunar base power",
        "Brit universities told to keep up the world-class research with less cash"
    ],
    "http://time.com/health/feed/": [
        "Ex-FDA Official Is Worried About the FDA’s New “Anti-Vaccine Tone”",
        "The Two Words to Say When Someone Comments on Your Hygiene",
        "Title X Freeze Widely Threatens Health Care Access",
        "Invasive Strep Infections Are Rising in the U.S.",
        "Can Eating Certain Foods Really Help You Get Pregnant?"
    ],
    "http://feeds.feedburner.com/TheAustralianTheNationNews": [
        "Agent payouts to shift stock",
        "Commissions driving unit sales",
        "Bitter taste for local chefs",
        "Deep in space, a flicker of life",
        "Culleton lodges appeal"
    ],
    "http://feeds.bbci.co.uk/news/uk/rss.xml": [
        "UK seeks emergency powers to take over British Steel",
        "Sunny spell to cool in coming days - but pollen levels high for many",
        "'I didn't know I was pregnant until I gave birth'",
        "Expect 'fireworks and tears' in Gladiators final, says Team GB gymnast",
        "Driver charged £100 after stopping to be sick"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Space.xml": [
        "Jared Isaacman, Trump’s Pick to Lead NASA, Questioned Over Moon Plans and Elon Musk",
        "Launch of First Amazon Project Kuiper Internet Satellites Is Scrubbed",
        "Chinese Lunar Rocks Suggest a Thirsty Far Side of the Moon",
        "Jeremiah Ostriker, Who Plumbed Dark Forces That Shape Universe, Dies at 86",
        "SpaceX Astronauts Splash Down Off California Coast for the First Time"
    ],
    "http://feeds.feedburner.com/TechCrunch/": [
        "Top 10 AI Tools That Will Transform Your Content Creation in 2025",
        "LimeWire AI Studio Review 2023: Details, Pricing Features",
        "Top 10 AI Tools in 2023 That Will Make Your Life Easier",
        "Top 10 AI Content Generator Writer Tools in 2022",
        "Beginner Guide to CJ Affiliate (Commission Junction) in 2022"
    ],
    "http://feeds.feedburner.com/TheAustralianBusinessWorldBusNews?format=xml": [
        "China ends floats logjam",
        "Traders suspended in forex probe",
        "FBI probes possible J.P. Morgan hacking",
        "Snapchat valued at 10bn",
        "Rosneft poised for Arctic LNG stake"
    ],
    "http://rss.csmonitor.com/feeds/usa": [
        "To speed deportations, Trump revives rarely used laws",
        "After Gaza protests, more colleges try out an old-fashioned ideal: Civility",
        "Markets got a tariff pause. But damage to global confidence in US could last.",
        "Meet ‘the loud majority.’ College conservatives are silent no longer.",
        "AI vs. human connection: Which do schools most need to thwart threats?"
    ],
    "http://feeds.bbci.co.uk/news/world/asia/rss.xml": [
        "Why Beijing is not backing down on tariffs",
        "Australia's looming election brings housing crisis into focus",
        "Remains of dozens of Indigenous ancestors returned to Australia",
        "Will trade-shy India gain edge in tariff-driven slowdown?",
        "Millions told to stay indoors as China braces for strong winds"
    ],
    "http://feeds.news.com.au/public/rss/2.0/wtn_top_3368.xml": [
        "Big picture show catches on",
        "Fund for regions rebranded",
        "Farm production to be ‘worth 58.5b’",
        "CFA volunteers rally in Vic over deal",
        "Farming out skills to land a job"
    ],
    "http://feeds.newscientist.com/science-news": [
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind",
        "Rereading the best sci-fi writers of all time: Larry Niven",
        "What the new science of magic reveals about perception and free will",
        "US military launches initiative to find the best quantum computer"
    ],
    "http://feeds.skynews.com/feeds/rss/entertainment.xml": [
        "Erin Brockovich: 'My chiropractor saw mud on my stiletto - I said, I've been collecting dead frogs'",
        "Menendez brothers' resentencing hearing can go ahead next week, says judge",
        "Ex-Abercrombie Fitch boss 'unfit to stand trial'",
        "Saturday Night Live gets British version",
        "The government needs the guts to stand up to 'the bully in the White House', says director of hit BBC series"
    ],
    "http://feeds.theguardian.com/theguardian/science/rss": [
        "Jawbone fossil builds richer image of ancient Denisovans",
        "Greek vase ‘looted’ in Italy removed from sale by London gallery",
        "At-home saliva test for prostate cancer better than blood test, study suggests",
        "US scientists create most comprehensive circuit diagram of mammalian brain",
        "Next Nasa leader says he would prioritize US missions to Mars if confirmed"
    ],
    "http://www.npr.org/rss/rss.php?id=1014": [
        "Week in politics: Trump's tariff volatility, 'one big beautiful bill,' Supreme Court",
        "China put steep tariffs on U.S. exports. Farmers are worried",
        "Trump says he took a cognitive test as part of his latest physical",
        "'I cannot guarantee complete confidentiality,' VA therapists ordered to tell veterans",
        "For some students who protested war in Gaza, fear and silence is a new campus reality"
    ],
    "http://time.com/newsfeed/feed/": [
        "The 20 Best Halloween TV Episodes of All Time",
        "Watch the Biggest Moments From King Charles III’s Coronation",
        "How the World Is Reacting to Shinzo Abe’s Death",
        "Sanctions Won’t Hurt Myanmar’s Brutal Leaders, Activists Say. Here’s What Could",
        "Here Are the Most ‘Attractive’ Global Cities. But Can They Keep Their Edge in the Post-Pandemic World?"
    ],
    "http://feeds.feedburner.com/nymag/vulture": [
        "Doctor Who Recap: What’s Schwup, Doc?",
        "The 50 Greatest War Movies Ever Made",
        "The 15 Best Movies and TV Shows to Watch This Weekend",
        "Cinematrix No. 382: April 12, 2025",
        "Lady Gaga Played Chess with a ‘Poker Face’ at Coachella"
    ],
    "http://feeds.skynews.com/feeds/rss/politics.xml": [
        "A remarkable step by the government - and Trump, China and Reform UK have all played their part",
        "Michael Gove handed peerage - as Jeremy Hunt and England cricket great knighted",
        "2025 'the critical year' for Ukraine, warns defence secretary - as more financial support announced",
        "Some good news for the British economy - but the celebration might not last long",
        "Starmer needs to address 'elephant in room', Harriet Harman says"
    ],
    "http://zeenews.india.com/rss/india-national-news.xml": [
        "Congress Slams Nitish Kumar-Led NDA Govt Over Bihar`s Development, Caste Survey",
        "3 Dead As Clashes Erupt Amidst Waqf Act Protests In West Bengal`s Murshidabad",
        "Mamata Banerjee Inciting Anti-Hindu Violence In Name Of Waqf Protests, Alleges BJP",
        "JK: Two Students Killed, 22 Injured In Handwara Bus Accident",
        "National Herald Probe: ED`s Crackdown On Rs 661 Crores Assets In Rahul, Sonia Gandhi-Linked AJL Case"
    ],
    "http://feeds.abcnews.com/abcnews/usheadlines": [
        "Trump administration ordered to unfreeze funding in dispute with Maine over transgender students",
        "Trump's China tariffs swing a sledgehammer at importers and cheap goods",
        "Winning numbers drawn in Friday’s Mega Millions",
        "Deadly crash raises new questions about safety of New York’s helicopter tours",
        "Giant rodents cuddle with visitors at the Capybara Cafe in Florida"
    ],
    "http://www.express.co.uk/posts/rss/11/health": [
        "Groundbreaking eye test can detect Parkinson's 'seven years before symptoms'",
        "I have incurable bowel cancer — being on an NHS ward is hellish",
        "Antioxidant-rich tea fights inflammation and protects against heart disease and diabetes",
        "One simple Japanese eating rule that could help you lose weight",
        "Signs your body is begging for vital nutrient that affects 'almost all of you'"
    ],
    "http://www.theguardian.com/us/environment/rss": [
        "Mexico to send water to Texas farmers as US treaty threat grows",
        "Noaa fires hundreds of climate workers after court clears way for dismissals",
        "Trump administration cuts 4m to Princeton’s climate research funding",
        "Elon Musk’s xAI powering its facility in Memphis with ‘illegal’ generators",
        "White House ends funding for key US climate body: ‘No coming back from this’"
    ],
    "http://www.bollywoodlife.com/feed/": [
        "Sonu Kakkar cuts ties with siblings Tony and Neha Kakkar, says 'Deeply devastated...'",
        "Jaat Vs Good Bad Ugly Box Office Collection Day 3: Sunny Deol film inches close to..., Ajith Kumar starrer records an impressive...",
        "Charu Asopa hits out at ex-husband Rajeev Sen for ‘drama’ dig, REVEALS why she left Mumbai: 'Nothing is more...'",
        "Chahatt Khanna opens up on being eve-teased when she was on a drive, broke a man's...",
        "Yeh Rishta Kya Kehlata Hai: Samridhii Shukla, Rohit Purohit’s new pictures will leave you excited for the upcoming AbhiMaan romance"
    ],
    "http://dailycaller.com/section/politics/feed/": [
        "Conservatives Shut Out By ‘Big Law’ Have Little Sympathy As Firms Face Major Upset Under Trump",
        "GOP-Ordered Audits Find Wisconsin Universities, State Agencies Failed To Track DEI Spending",
        "Trump Cracks Down On Left’s Favorite Way To Discriminate",
        "WATCH: Musk Hater Leaves Swastika-Marked Brick On Tesla In NYC Jewish Community",
        "Sen. Michael Bennet Announces 2026 Bid For Governor, Would Get To Pick Successor If Successful"
    ],
    "http://www.technologyreview.com/stream/rss/": [
        "The Download: how the military is using AI, and AI’s climate promises",
        "Love or immortality: A short story",
        "How AI is interacting with our creative human processes",
        "Generative AI is learning to spy for the US military",
        "Why the climate promises of AI sound a lot like carbon offsets"
    ],
    "http://www.thehindu.com/sci-tech/?service=rss": [
        "Ensuring consistent, year-round blood donation can help overcome seasonal fluctuations, resolve supply challenges: experts",
        "Three docs booked as pregnant woman dies at UP hospital; CMO recommends sealing facility",
        "White House aims to eliminate NOAA climate research in budget plan",
        "Ecological disruptions are a risk to national security",
        "Trump’s NASA chief nominee boasts business experience in uncertain time"
    ],
    "http://feeds.webservice.techradar.com/rss/new": [
        "Cheaper than Black Friday: Samsung has a massive clearance sale on best-rated TVs - save up to 1,300",
        "Netflix is testing an AI search engine to supercharge your recommendations",
        "With this simple gadget, you can make great-tasting pour-over coffee with fewer beans",
        "The end is nigh for Windows 10 – here are 5 things Microsoft must do to get people to love Windows 11",
        "‘It will take time for foldables to become mainstream’: OnePlus defends decision to delay the OnePlus Open 2 and bow out of the foldable phones race in 2025"
    ],
    "http://feeds.abcnews.com/abcnews/healthheadlines": [
        "RFK Jr. wants to target chronic disease in US tribes. A key program to do that was gutted",
        "France rugby star Chabal doesn't remember 'single second' of career due to concussion",
        "Australian woman unknowingly gives birth to a stranger's baby after IVF clinic error",
        "States sue over Trump administration's sudden halt of pandemic relief aid for schools",
        "This federal rule helped clear air over America's most beloved parks. Trump's EPA wants to kill it"
    ],
    "http://www.cnet.com/rss/gaming/": [
        "Best Internet Providers in Bellingham, Washington",
        "Reddit's AI Answers Are About to Get Faster and More Accurate",
        "Premier League Soccer: Stream Arsenal vs. Brentford From Anywhere",
        "Is Your Internet as Fast as It Should Be? Here’s How to Find Out and Fix Lagging Speeds",
        "Best King-Size Mattresses for 2025, Tested by CNET’s Sleep Experts"
    ],
    "http://www.oxfordmail.co.uk/news/rss/": [
        "LOOKING BACK: ice cream in Oxfordshire over the years",
        "Oxfordshire councillors with best and worst meeting attendance revealed",
        "Jeremy Clarkson to serve 'brains and squirrels' at Oxfordshire pub",
        "Sadist 'utterly humiliated' after caught sending 'filthy' messages",
        "Oxford's busy Wetherspoons pub with tables outside for the sun"
    ],
    "http://www.uncut.co.uk/feed": [
        "Hear Lana Del Rey’s new single, “Henry, come on”",
        "Brian Eno and Beatie Wolfe announce two collaborative albums",
        "Nick Drake: a Five Leaves Left box set is coming",
        "Send us your questions for Arthur Baker",
        "Stereolab announce new album, Instant Holograms On Metal Film"
    ],
    "http://www.mirror.co.uk/tv/tv-news/rss.xml": [
        "CBB's first evictee Michael Fabricant cuts downcast appearance following 'sad' exit",
        "The Chase expert reveals 'lost' celebrity special episode which ITV 'won't broadcast'",
        "Death in Paradise star 'wasn't ready' to bid farewell as she opens up on show exit",
        "Celebrity Big Brother fans spot major show change during first live eviction",
        "Netflix's Black Mirror: Five times the dystopian drama predicted the future"
    ],
    "http://globalnews.ca/science/feed/": [
        "Elon Musk says he plans to send his humanoid robots to Mars by 2026",
        "The dire wolf has come out of extinction — kind of",
        "Glowing blue spiral spotted across Europe night sky captivates stargazers",
        "The 5 senses of spring: How climate change is shaping our seasonal experience",
        "NASA astronauts return to Earth after 9 months stuck in space"
    ],
    "http://www.eurogamer.net/?format=rss": [
        "Phasmophobia turns to its community to make this Easter event the most terrifying yet",
        "The new Netflix Black Mirror series has another Bandersnatch-like gaming crossover moment, but you might not even notice it",
        "What we've been playing - zombies in the snow, cursed mobile games, and family fun",
        "Chaotic match-modifying shooter FragPunk gets new console release date after last month's delay",
        "Baldur's Gate 3's last-ever major update gets long-awaited release date"
    ],
    "http://feeds.feedburner.com/the-edge-susu": [
        "Why Helen Hardt’s ‘The Blood Bond Saga’ Should Have a TV Adaptation",
        "Review: SUSU Theatre Group’s ‘Macbeth’ @ The Annex",
        "An Interview with Peter Hook"
    ],
    "http://www.thehindu.com/sci-tech/science/?service=rss": [
        "White House aims to eliminate NOAA climate research in budget plan",
        "Ecological disruptions are a risk to national security",
        "Trump’s NASA chief nominee boasts business experience in uncertain time",
        "ATREE researchers rediscover long-lost species after 111 years",
        "​Dire efforts: On de-extinction and conservation"
    ],
    "http://www.abc.net.au/news/feed/46182/rss.xml": [
        "Dutton pledges one-off 1,200 tax offset to half of taxpayers",
        "Labor proposes 5 per cent deposits for all first home buyers",
        "LNP senator vows to 'make Australia great again', dismisses Trump link"
    ],
    "http://www.menshealth.com/events-promotions/washpofeed": [
        "The Evolution of Ab Training",
        "The Brutal True Story Behind Warfare",
        "OOFOS Ooaah Sport Slide Vs. Hoka Restore TC: Which Recovery Shoe Is Better For You?",
        "The 6 Best Toothpastes for Men in 2025, According to a Dentist",
        "This Pork Tenderloin ‘Steak’ Has 33 Grams of Protein Per Serving"
    ],
    "http://feeds.feedburner.com/AtlanticNational": [
        "Trump’s Preoccupation With Tariffs",
        "The Consequences of the Signal Breach",
        "What Does ‘Constitutional Crisis’ Mean?",
        "Trump’s Unpredictability With Allies and Adversaries",
        "Trump’s Erratic Economic Policies"
    ],
    "http://zeenews.india.com/rss/sports-news.xml": [
        "Karachi Kings vs Multan Sultans Dream11 Team Prediction PSL 2025 3rd Match Preview, Fantasy Picks, Squads, Captain, Vice-Captain, Best Playing 11s, News For KK vs MUL Match Today At 9 PM",
        "'There Was No Intent...': Michael Clarke Questions CSK's Approach After Humiliating Loss Against KKR",
        "SRH vs PBKS - Head-to-Head, IPL 2025: Pat Cummins’ Hyderabad Face Off Against Shreyas Iyer’s Punjab - Check Stats And More",
        "KK vs MS PSL FREE Live Streaming Details: When And Where To Watch PSL 2025 Karachi Kings vs Multan Sultans 3rd Match Live Telecast On TV, Mobile APPs online",
        "LSG vs GT - Head-to-Head, IPL 2025: Rishabh’s Lucknow Face Off Against Shubman’s Gujarat - Check Stats And More"
    ],
    "http://www.npr.org/rss/rss.php?id=1019": [
        "What are your rights if border authorities ask for your phone?",
        "This former influencer gave up her smartphone. She says you should, too",
        "Trump administration backs off Nvidia's 'H20' chip crackdown after Mar-a-Lago dinner",
        "A new vacuum can alert you to incoming text messages. Why?",
        "How a false X post about pausing tariffs led to multitrillion-dollar market swings"
    ],
    "http://www.macworld.com/index.rss": [
        "Shure MV7i review: An all-in-one mic for podcasts and music",
        "Apple Maps on the web expands access to more devices and browsers",
        "Apple TV+ this week: ‘Your Friends and Neighbors’ is now streaming",
        "The delayed Siri Apple Intelligence features are now coming ‘in the fall’",
        "Apple could keep iPhone prices the same by upselling harder than ever"
    ],
    "http://feeds.news.com.au/public/rss/2.0/news_lifestyle_3171.xml": [
        "Hilarious Channel 7 gaffe goes viral",
        "Dave Hughes takes on Sam Kekovich",
        "‘Hang on, aren’t we all boat people?’",
        "Sunscreen leaves kids ‘screaming in pain’",
        "ALDI’s tough stance on alcohol"
    ],
    "http://feeds.feedburner.com/daily-star-Gaming": [
        "Copa City boss talks moving from career in football to building his dream game",
        "GTA 6 release window narrows as Mafia: The Old Country date leaks",
        "'I've played the new Nintendo Switch 2 – here's why you should pre-order it'",
        "How Elder Scrolls Online is shaking up a ten-year-old game in 2025",
        "How EA F1 25's My Team 2.0 brings the best of 'Drive To Survive' to the video game"
    ],
    "http://www.thehindu.com/news/national/?service=rss": [
        "Waqf Act a complex legislation, result of dialogue and democratic process: Jayant Chaudhary",
        "RB Minister expresses concern at depleting groundwater levels in Annamayya district",
        "Maddarki village accident: Death toll rises to five",
        "Believers visit Miracle Cross in Nandagad",
        "Youth Congress protest march to Suresh Gopi’s office in Thrissur against attack on Christian priest in Jabalpur"
    ],
    "http://www.thehindu.com/sci-tech/health/?service=rss": [
        "Ensuring consistent, year-round blood donation can help overcome seasonal fluctuations, resolve supply challenges: experts",
        "Three docs booked as pregnant woman dies at UP hospital; CMO recommends sealing facility",
        "New fitness metric may predict heart disease risk better than steps or heart rate, finds study",
        "Spinal muscular atrophy patients welcome development of generic drug; call for government intervention to ensure access",
        "U.S. measles battle hindered by confusion over health secretary response"
    ],
    "http://feeds.webservice.techradar.com/us/rss/news/gaming": [
        "Cheaper than Black Friday: Samsung has a massive clearance sale on best-rated TVs - save up to 1,300",
        "Netflix is testing an AI search engine to supercharge your recommendations",
        "With this simple gadget, you can make great-tasting pour-over coffee with fewer beans",
        "The end is nigh for Windows 10 – here are 5 things Microsoft must do to get people to love Windows 11",
        "‘It will take time for foldables to become mainstream’: OnePlus defends decision to delay the OnePlus Open 2 and bow out of the foldable phones race in 2025"
    ],
    "http://www.theguardian.com/uk/rss": [
        "MPs approve British Steel bill after Chinese owners’ ‘excessive’ demands – live",
        "‘I’m super worried’: fewer UK tourists visiting US amid Trump’s policies and rhetoric",
        "‘Completely out of touch’: golf and dinners for ‘king’ Trump as economy melts down",
        "National Trust bans coaches from East Sussex beauty spot to cut visitor numbers",
        "Nottingham Forest v Everton, Brighton v Leicester and more: clockwatch – live"
    ],
    "http://www.giantbomb.com/feeds/mashup/": [
        "265 - Mr. Lasagna",
        "Unprofessional Fridays: Supermarket Together",
        "Marvel Rivals Season 2",
        "GameBreaking News 04/11/25",
        "Voicemail Dump Truck 156 | Edging Pizza.mp3"
    ],
    "http://rss.csmonitor.com/feeds/science": [
        "The world’s bananas are at risk. A volcanic island might protect them.",
        "NASA astronauts’ return is near. Their long, unlikely trip puts focus on resilience.",
        "US science funding was a bipartisan priority. Now it’s a target of federal cuts.",
        "China’s DeepSeek impresses. But is a ‘fast follow’ good enough in AI?",
        "Nvidia unveils new products from supercharged graphics chip to AI that trains robots"
    ],
    "http://feeds.feedburner.com/DrudgeReportFeed": [
        "Investors dump US govt bonds as faith in America falters...",
        "Nation Braces for Summer of Layoffs...",
        "73 now financially stressed...",
        "'Moron premium' after tariff chaos...",
        "CONSUMER SENTIMENT TUMBLES"
    ],
    "https://news.google.com/news/feeds?cf=all&ned=in&hl=en&topic=b&output=rss": [
        "Trump’s tariff buffer: Phones, PCs, chips spared from 'reciprocal' tariffs - The Economic Times",
        "Calcutta HC orders CAPF deployment in Bengal' Murshidabad as Waqf clashes kill 3 - Hindustan Times",
        "Tamil Nadu Gets New BJP Chief, Day After Alliance Announced With AIADMK - NDTV",
        "Supreme Court puts President on a deadline, says prudent to consult apex court before taking a call on State Bills - The Hindu",
        "Trump opens door to Iran deal, warns of consequences if talks fail - The Tribune"
    ],
    "http://musiccanada.com/feed/": [
        "Music Canada celebrates the 50th anniversary of the Gold Platinum Certification Program at the JUNOS",
        "IFPI’s Global Music Report 2025 reveals tenth consecutive year of growth",
        "Music Canada’s Gold Platinum program celebrates 50 years",
        "Music Canada and DIMA issue joint letter to CRTC following Canadian content audio workshops",
        "Canada needed a reimagined broadcasting system. The CRTC’s contribution decision offers more of the same while risking the important role played by licensed streaming in building the careers of artists."
    ],
    "http://www.journaldemontreal.com/jm/sante/rss.xml": [
        "Elle quitte les réseaux sociaux pour réfléchir... et perd 47 livres",
        "Voici pourquoi une bonne nuit de sommeil prévient l'obésité et favorise la perte de poids",
        "Voici les meilleurs aliments à consommer pour avoir une meilleure mémoire",
        "Le saumon fumé au banc d’essai",
        "Une mauvaise alimentation pendant la grossesse hausse le risque de TDAH et d’autisme chez les enfants"
    ],
    "http://www.smh.com.au/rssheadlines/health/article/rss.xml": [
        "‘I’ve got the credentials to do the job’: Goodwin stands firm after Dons whip Dees",
        "Rising Bombers fear young ruck has serious knee injury after big win over Demons",
        "Five months after being injured in the West Bank, Ranem is still waiting for answers",
        "This family-run cafe and pasticceria is an old Italian soul worth visiting",
        "Superquiz, Sunday, April 13"
    ],
    "http://www.skysports.com/rss/0,20514,20876,00.xml": [
        "EFL: WBA lead; Sunderland level | Leeds win Sheff U lose in early drama LIVE",
        "Women's Six Nations LIVE Red Roses travel to face Ireland in Cork",
        "Damsgaard: It's crazy how my season has panned out after injuries",
        "The Masters tee times: R3 pairings and UK start times",
        "Leeds back on top of Championship after beating Preston"
    ],
    "http://feeds.abcnews.com/abcnews/technologyheadlines": [
        "Apple has few incentives to start making iPhones in U.S.",
        "OpenAI countersues Elon Musk in legal dispute over ChatGPT maker's business ambitions",
        "La Nina exits after three weak months, leaving Earth in neutral climate state",
        "A machine using ultrasound and AI can gauge the fattiness of a tuna fish",
        "Trump's 'buy' tip on social media before tariffs pause made money for investors"
    ],
    "http://syndication.howstuffworks.com/rss/science": [
        "Hodag: From Wisconsin Hoax to Best-selling Beast",
        "Yowie: Animal Kingdom Resident or Hoax Down Under?",
        "Drop Bears, Australia and an Enduring Prank on Non-Aussies",
        "The 'Not Deer' Cryptid Is Exactly What It Sounds Like",
        "Is the Bloop Real? Well, Yes and No"
    ],
    "http://feeds.news.com.au/rss/newslocal/dt_nlocal_sport_3214.xml": [
        "Finding the next football star",
        "Future stars bring home trophy",
        "Jesse James represents Australia",
        "Ironman legend Barry Rodgers dead at 74",
        "‘Everyone wants to be Suarez’"
    ],
    "http://feeds.feedburner.com/TheAustralianBusAviation?format=xml": [
        "Bali chaos as Tiger row deepens",
        "Passengers in safe hands",
        "Tigerair ban strands Aussies",
        "Tigerair passengers stranded",
        "Commercial flying ‘never safer’"
    ],
    "http://www.washingtontimes.com/rss/headlines/news/politics/": [
        "Washington Times Weekly: Tariff whiplash",
        "Federal judge blocks new deportations under Alien Enemies Act",
        "Judge's ruling allows ICE to make arrests near churches",
        "'Just need to start killing': Man arrested for threats to Trump, ICE",
        "Rampant 'shrimp fraud' deals another blow to devastated U.S. shrimpers but tariffs offer new hope"
    ],
    "http://www.journaldemontreal.com/sports/rss.xml": [
        "Course au Calder: Lane Hutson serait confortablement en avance",
        "5 trucs à surveiller aujourd’hui au Tournoi des Maîtres à Augusta",
        "Les Oilers retrouvent graduellement leurs éclopés",
        "Tournoi des Maîtres: la jeune vedette Ludvig Aberg se démarque avec sa mentalité gagnante",
        "Brock Boeser aurait refusé 40 M des Canucks"
    ],
    "http://www.abc.net.au/news/feed/45924/rss.xml": [
        "Gather Round's Sicko Saturday treats Adelaide Oval to some gloriously bad football",
        "Browning pips favourite Kennedy in 100m thriller to win national title",
        "WA premier flags 'positive' NRL expansion talks despite lowest Perth crowd",
        "Pit lane chaos mars Supercars race as Payne wins on home soil",
        "Super Rugby Women's: Waratahs defeat Reds in final to claim sixth championship"
    ],
    "http://feeds.news.com.au/public/rss/2.0/bcm_top_stories_257.xml": [
        "Secret tape not the only talking point",
        "‘It’s still a prison. I feel like an animal’",
        "Shock toxic water findings",
        "Living in fear for my family",
        "Wild weather: ’It was like a tidal wave’"
    ],
    "http://www.dailyrecord.co.uk/lifestyle/health-fitness/rss.xml": [
        "Kale and fish among foods that could boost brain health and reduce risk of dementia",
        "Poor hearing increases early death risk due to 'significant' link to heart failure",
        "Five easy lifestyle changes to get fitter - even if you're too busy for the gym",
        "Maximise your weight loss workouts with the expert-recommended ‘3-3-3 rule'",
        "When is the best time to exercise - morning, midday or evening?"
    ],
    "http://www.gamesradar.com/all-platforms/news/rss/": [
        "Marvel Rivals Season 2 quietly made one big cheeky change without telling anyone by buffing all the male hero's assets",
        "Dethroning Monster Hunter Wilds and Split Fiction, this surprise roguelike has instantly become the best-rated game of the year",
        "DC's Lanterns director clears up those True Detective comparisons",
        "Nosferatu director has no regrets on facial hair choice for Bill Skarsgård's Count Orlok: There’s just no f**king way that this guy wouldn’t have a mustache",
        "Black Panther director says Chadwick Boseman freaked out Disney execs by never breaking character and only speaking in T'Challa's accent"
    ],
    "http://time.com/tech/feed/": [
        "Trump Wants Tariffs to Bring Back U.S. Jobs. They Might Speed Up AI Automation Instead",
        "How Rare Earths Are Playing a Pivotal Role in the U.S.-China Trade War",
        "How Trump’s Tariffs Could Make AI Development More Expensive",
        "How Crypto Legislation Could Hand Big Tech the Keys to Banking",
        "What Are Stablecoins?"
    ],
    "http://www.crikey.com.au/politics/feed": [
        "Our politicians are selling pixels not policy. It’s a threat to democracy in the TikTok election",
        "Coalition ducks and weaves on how universities should make up for lost foreign student income",
        "Trump wants allies in his war on China. Albanese and Marles will bend the knee — as will Dutton",
        "Seven stories you will read roughly 100 times between now and election day",
        "Labor’s attack on Dutton ‘cuts’ isn’t the full picture"
    ],
    "http://feeds.newscientist.com/health": [
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind",
        "Rereading the best sci-fi writers of all time: Larry Niven",
        "What the new science of magic reveals about perception and free will",
        "US military launches initiative to find the best quantum computer"
    ],
    "http://www.dailymail.co.uk/sport/index.rss": [
        "Man City star 'could make shock summer exit and return to his former club' - with the player 'willing to take a pay cut on his £300k-a-week salary'",
        "Paddy Pimblett sends a final message to Michael Chandler ahead of their UFC 314 clash - as the crowd favourite prepares for his toughest test to date",
        "Boxing fans rave over epic four-minute promotional video for Chris Eubank Jr vs Conor Benn - including hilarious reference to egg incident",
        "Man City 5-2 Crystal Palace: Kevin De Bruyne produces vintage performance as Pep Guardiola's side turn on the style after going behind early at the Etihad",
        "Peter Crouch and Joe Cole issue verdicts on Premier League top-five race as both pundits agree on MAJOR omission"
    ],
    "http://toucharcade.com/feed/": [
        "The Reports of Our Death Have Been Mildly Exaggerated – The TouchArcade Show 612",
        "Nintendo Switch Part Deux – The TouchArcade Show 611",
        "Where Have We Been? – The TouchArcade Show 610",
        "Polar Express is SCARY – The TouchArcade Show 609",
        "Remember Payphones? – The TouchArcade Show 608"
    ],
    "http://techau.com.au/feed/": [
        "NVIDIA Studio Update supercharges DaVinci Resolve with RTX AI Acceleration",
        "REVIEW: Dell 27 Plus 4K monitor offers 120Hz, but is it worth the money?",
        "Next Level Racing cooked, F-GT PRO a multi-position racing simulator",
        "Yackandandah adds another Community Battery",
        "Tesla’s 2025 Spring Software Update to add B-Pillar camera access"
    ],
    "http://www.thehindu.com/news/cities/?service=rss": [
        "Viral clip showing remarks allegedly made by Minorities Commission Chairperson triggers a row",
        "T.N. government gives nod for Kalaignar biomedical research foundation",
        "Forest Department invites public participation to choose ‘Bird of Salem’",
        "Seven from Bhatkal booked for dangerous driving",
        "Protest against Wakf Amendment Act in Mangaluru"
    ],
    "http://www.healthcareitnews.com/home/feed": [
        "Cedars-Sinai CAIO: AI is transforming relationship between caregivers and IT",
        "Dayton VAMC rolls out IT upgrades ahead of EHR transition",
        "Picture this: Carle Health gains sizable rewards with enterprise imaging system",
        "Vendor notebook: Google and IBM make moves on clinical and business AI",
        "HHS employees fear IT staff reductions could destabilize agency"
    ],
    "http://www.dailymail.co.uk/sciencetech/articles.rss": [
        "You've been cooking pizza WRONG Experts reveal the secret to achieving restaurant-quality slices at home - and why you should never use the top shelf of the oven",
        "Would YOU try wine in aluminium bottles? MailOnline tastes Pinot Grigio from a bizarre metal container that promise to slash the carbon footprint - so, does it live up to its glass equivalent?",
        "Shocking new study confirms Elon Musk's worst fear about life in the US",
        "The AI action figure trend is taking over social media - here's how you can transform into a collector's toy",
        "Scientists reveal what zombies would REALLY look like - and say the possessed humans in the Last of Us Season 2 aren't far off"
    ],
    "http://rss.cnn.com/rss/cnn_tech.rss": [
        "",
        "",
        "",
        "",
        ""
    ],
    "http://www.theage.com.au/rssheadlines/technology-news/article/rss.xml": [
        "There’s one way you can make your super more secure",
        "Introducing NEO Gamma - Another Step Closer to Home",
        "New Elder Scrolls Online expansion unveiled",
        "Did an AI chatbot help draft the US tariff policy?",
        "I paid an athlete 120 to send me a personalised video. You can, too"
    ],
    "http://www.theguardian.com/lifeandstyle/health-and-wellbeing/rss": [
        "What happens when love tips over into the infatuated state of ‘limerence’?",
        "Young people in the UK: tell us about your gym habits",
        "Hay fever making your life a misery? Try these 20 tips from doctors and allergy experts",
        "Life let you down again? Congratulations – you’re growing",
        "A tub a day: might eating yoghurt help you live longer?"
    ],
    "http://feeds.bbci.co.uk/news/science_and_environment/rss.xml": [
        "Global breakthrough to tackle shipping emissions",
        "What goes on inside toddlers' brains? A pioneering project is trying to find out",
        "Starlings disappearing from gardens, says RSPB",
        "UK investigating claims green fuel contains virgin palm oil",
        "Royal Society of Biology mourns murdered scientist"
    ],
    "http://variety.com/feed/": [
        "Record Store Day 2025’s Most Wanted: T-Swift, T-Heads, Gracie Abrams, ‘Wicked,’ Wu Tang, Laufey, Oasis, Mingus and More Vinyl Worth the Queue",
        "Lady Gaga Outdoes Herself With a Coachella Spectacular That’s Equal Parts Freaky and Hearty",
        "Women Make Movies’ Debra Zimmerman Slams U.S. Grant Cuts at Visions du Réel",
        "‘Sacramento’ Review: Michael Cera in a Smart and Fluky Road Comedy About the Agony of Adulting",
        "WGA Seeks to Discipline Four Writers for Breaking Guild Rules During 2023 Strike"
    ],
    "http://mobilesyrup.com/feed/": [
        "Testing lossless audio on AirPods Max in 2025",
        "Apple aiming to launch delayed Apple Intelligence features this fall: report",
        "ChatGPT got over 52 times more monthly visitors than Copilot",
        "Even Trump officials think Elon Musk is a loser",
        "Theatrical adaptation of Rogers family feud gets stage date"
    ],
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_technology_2790.xml": [
        "Galaxies collide in stunning picture",
        "Apple’s biggest product since the iPhone",
        "Rare ‘Morning Glory’ cloud dazzles Virgin flyers",
        "Towns ‘too hot to wear shorts’",
        "The gadget for the perfect coffee"
    ],
    "http://www.theverge.com/rss/group/features/index.xml": [
        "The women who made America’s microchips and the children who paid for it",
        "How to disappear completely",
        "How one creator visualized AI by using very little AI",
        "Bad influence",
        "Can Philadelphia’s ballot counters outrun election lies?"
    ],
    "http://feeds.bbci.co.uk/sport/0/rss.xml?edition=uk": [
        "Chelsea reach FA Cup final with late winner against Liverpool",
        "France beat brave Wales to remain on course for title",
        "Edinburgh beat Bulls to seal home Euro semi-final",
        "France overcome spirited Wales to boost Six Nations hopes",
        "Guardiola praises 'unbelievable' Ederson after assist"
    ],
    "http://feeds.feedburner.com/IeeeSpectrumFullText": [
        "Video Friday: Tiny Robot Bug Hops and Jumps",
        "Climb the Career Ladder with Focused Expertise",
        "IEEE TryEngineering STEM Grants Fund Over 50 Projects",
        "The Great Chatbot Debate: Do They Really Understand?",
        "First Supercritical CO2 Circuit Breaker Debuts"
    ],
    "http://www.cnet.com/rss/iphone-update/": [
        "Best Mobile VPN of 2025: Stream on the Go and Avoid Mobile Traffic-Shaping",
        "iPhone 20th-Anniversary Edition Could Bring Major Design Overhaul",
        "What You Need to Know About Your iPhone's Enhanced Visual Search",
        "Don't Buy an iPhone Until You See How Tariffs Could Double the Price. We Do the Math",
        "Report Hints at Improved Siri This Fall After Inner Apple Turmoil"
    ],
    "http://www.standard.co.uk/lifestyle/rss": [
        "How a new generation fell for fishing — and the 5 best places to pick up a rod near London",
        "What's behind the 'feud' between the Beckhams over Kim Turnbull relationship?",
        "Savannah Miller on why her perfect place will always be Positano",
        "A ballet retreat in the Maldives changed my outlook — here's why everyone should do a hobby holiday",
        "Where to find wild garlic in London (and how to forage responsibly)"
    ],
    "http://www.cnet.com/rss/news/": [
        "Best King-Size Mattresses for 2025, Tested by CNET’s Sleep Experts",
        "Best Internet Providers in West Valley City, Utah",
        "Best Internet Providers in Traverse City, Michigan",
        "New Google Maps AI Tool Could Help Congestion and Fix Roads Near You",
        "Zelle App Is No More. But You Can Still Send Money Digitally With These Banks"
    ],
    "http://www.livemint.com/rss/money": [
        "Investment word of the day: Fund of funds —what is FoF and how does it work? Types, advantages and more",
        "These 5 credit cards give free access to domestic and international airport lounges. Check list here",
        "How to link your credit card to Google Pay: A step-by-step guide",
        "How to convert large purchases made by SBI credit card into EMIs? A step-by-step guide",
        "Monthly SIP of 10K in this mutual fund since its launch would have grown to 3.18 crore now. Check how"
    ],
    "http://www.reddit.com/r/politics/.rss": [
        "‘Completely out of touch’: golf and dinners for ‘king’ Trump as economy melts down",
        "Musk Mocked After 'Top Secret' Cabinet Meeting Notes Go Viral: 'They Wrote That to Make Him Feel Included'",
        "Donald Trump Supporters Are Losing Their Minds Over The New Trump Tariffs, And It's Exactly The Meltdown We All Saw Coming - The 34 tariffs threaten our survival. We voted for you, believing in America First. Please consider us.",
        "Staffers Walk Out of RFK Jr.’s Slur-Ridden Speech About Deep State",
        "Trump exempts phones, computers, chips from new tariffs"
    ],
    "http://www.techinsider.io/rss": [
        "The anti-aging secret these 80-somethings swear by: work",
        "I spent 337 a night to stay at an all-inclusive resort in Mexico with friends, and the 5-star experience blew me away",
        "'Dream news' for tech sector as US announces tariff exemptions",
        "I've always had a difficult relationship with my mom, but now I'm her caregiver. I'm struggling to set new boundaries with her.",
        "Before-and-after photos show changes Trump has made to the White House decor, so far"
    ],
    "http://www.thenation.com/rss/articles": [
        "This Passover, We Must Examine the Indecent Betrayal by Our Own",
        "Mr. Douglass in the Room",
        "Bond Vigilantes Are Now the Unchallenged Kings Thanks to a Feckless Congress and Reckless Trump",
        "Taking Action",
        "9 Ways You Can Save the Internet Right Now"
    ],
    "http://www.journaldemontreal.com/spectacles/rss.xml": [
        "L’acteur de «Grey’s Anatomy» et «Euphoria» Eric Dane révèle être atteint de la SLA",
        "«Je me suis dit: Profites-en parce que c’est peut-être la dernière fois que tu le fais», raconte la lectrice de nouvelles Julie Drolet qui révèle être atteinte d'un cancer du sein très agressif",
        "Salon international du livre de Québec: le phénomène Alex A., créateur de la bande dessinée «L’Agent Jean», attire les jeunes lecteurs",
        "«Qu’est-ce que vous allez faire dans l’espace?»: l’actrice Olivia Munn critique Katy Perry et son coûteux voyage de tourisme spatial",
        "«J’ai survécu. J’ai eu beaucoup de chance»: –Anjelica Huston, la vedette du film «La famille Addams», révèle avoir lutté contre un cancer en secret et en être guérie depuis 4 ans"
    ],
    "http://feeds.feedburner.com/dailytelegraphnationalnewsndm?format=xml": [
        "‘Being secret doesn’t make sense’",
        "Turnbull calls for electronic voting",
        "‘Thrown under the bus’: Jones unleashes",
        "Shorten blasted for ‘treaty bomb’",
        "Turnbull and Shorten speak of mistakes"
    ],
    "http://www.dailymail.co.uk/health/index.rss": [
        "Subtle warning signs of deadly motor neurone disease no one should dismiss - as Grey's Anatomy star Eric Dane reveals his diagnosis",
        "Weight loss jab supply risk as Trump's trade war threatens drug industry",
        "Harvard experts pinpoint 'overlooked' risk factors for dementia and they're all preventable",
        "'Most dangerous sex position' in the world is responsible for an unbelievable amount of injuries",
        "'Healthy' woman, 35, died just three days after medics dismissed symptoms of deadly condition"
    ],
    "http://feeds.news.com.au/public/rss/2.0/news_sport_3168.xml": [
        "USADA’s stunning anti-doping swoop on Lesnar",
        "Kangaroos’ extraordinary punishment",
        "Pies board accepts McGuire apology",
        "Why I hated being on Baywatch",
        "Stalker skirt shot divides internet"
    ],
    "http://www.dose.ca/feed": [
        "For Demidov, his talent will never be enough",
        "Here are the qualification scenarios for the playoffs for the Habs today",
        "Top-4 : the Flames refuse to die and come back in the playoff race",
        "The Canadiens unable to’ officiate their spot in playoffs",
        "Ivan Demidov visited the Hall of Fame today"
    ],
    "http://www.livemint.com/rss/industry": [
        "Bank holiday today: Are banks open or closed on Saturday, April 12? Check here",
        "What RBI's proposed norms mean for co-lending, gold loans",
        "India’s public wifi ambitions falters as telcos resist subsidising their rivals",
        "Small firms fear new MSME definitions favour giants, cry foul",
        "Niti Aayog proposes incentives for boosting auto parts production, exports"
    ],
    "http://www.techrepublic.com/rssfeeds/blog/australian-technology/": [
        "Will a Useful Quantum Computer Be a Reality Within 10 Years? DARPA, 2 Australian Startups, IBM More Are Working On It",
        "Top Tech Conferences Events to Add to Your Calendar in 2025",
        "Boosting RD Could Lift Australia’s GDP by 3, Report Finds",
        "Australians Hit With One Cyber Attack Every Second in 2024",
        "Australia Divided on DeepSeek Response: Industry Groups Call for Action, Minister Urges Caution"
    ],
    "http://feeds.newscientist.com/tech": [
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind",
        "Rereading the best sci-fi writers of all time: Larry Niven",
        "What the new science of magic reveals about perception and free will",
        "US military launches initiative to find the best quantum computer"
    ],
    "http://feeds.sbnation.com/rss/streams": [
        "8 defensive players who could be secret superstars in the 2025 NFL Draft",
        "6 offensive players who could be secret superstars in the 2025 NFL Draft",
        "Can you guess this outfielder in today’s in-5 trivia game?",
        "Can you guess this NFL tight end in today’s in-5 trivia game?",
        "One favorite, one longshot to win the Masters heading into the weekend"
    ],
    "http://twitchy.com/category/us-politics/feed/": [
        "Somebody Make Sure Hillary Clinton Sees the Video Trump Just Posted Where She Sounds Positively MAGA",
        "Judiciary Dems' Month-Old Tweet About Mahmoud Khalil Is Aging Worse by the Minute",
        "Proposed Cuts to NOAA Have Lefties Melting Down Faster than Polar Ice Caps in a Climate Hoax",
        "Lawrence O’Donnell Spreads Lie Trump Can Round Up American Citizens and Fly Them to El Salvador’s Prison",
        "Election Deflection: James Carville Says There’s Voter Fraud but the SAVE Act Is an ‘Unnecessary Idea’"
    ],
    "http://www.cbsnews.com/latest/rss/main": [
        "Police identify victims, including teen, in Boca Raton plane crash",
        "Harriet Tubman museum in NJ committed to preserving history after temporary removal from website",
        "Pastor abducted at gunpoint while delivering sermon",
        "Temple students surprised after human remains, bone fragments discovered on campus",
        "Iran, U.S. start negotiations over Tehran's rapidly advancing nuclear program"
    ],
    "http://www.mirror.co.uk/sport/rss.xml": [
        "Pep Guardiola response to Kevin de Bruyne speak volumes after thunderous cheers",
        "BREAKING: Cardiff vs Stoke City SUSPENDED as medical emergency halts Championship match",
        "Justin Rose's secret weapon in 2025 Masters battle with Rory McIlroy and Bryson DeChambeau",
        "Ederson DOUBLES old Premier League record in Man City's remarkable win over Crystal Palace",
        "John Terry says there's 'no comparison' between Jose Mourinho's Chelsea and Arsenal Invincibles"
    ],
    "http://feeds.foxnews.com/foxnews/sports": [
        "MLB umpire called 'perfect game' in Royals win over Twins, metrics tracking shows",
        "Paige Spiranac praises Nick Dunlap for finishing out Masters participation despite poor play",
        "Mystery remains over cause of death of former NFL cornerback Vontae Davis",
        "'College football is a joke,' NFL star declares amid sport's latest NIL drama",
        "NBA legend slams LeBron James for shirtless warmup: 'Put a fine on that'"
    ],
    "http://feeds.news.com.au/public/rss/2.0/anow_topstories_250.xml": [
        "Parents’ plea for SA man facing death",
        "Young volleyball star gone too soon",
        "Twin baby dies in home birth tragedy",
        "Holden to review Pies sponsorship",
        "Poll shows Kate Ellis heading for shock defeat"
    ],
    "http://feeds.bbci.co.uk/news/world/asia/india/rss.xml": [
        "Trump exempts smartphones and computers from new tariffs",
        "ICC urged to consider future status of T10 format",
        "Will trade-shy India gain edge in tariff-driven slowdown?",
        "Indian man who fed water to cheetahs in viral video restored in job",
        "Man accused of Mumbai terror attacks remanded in custody"
    ],
    "http://feeds.foxnews.com/foxnews/science": [
        "Wolf made famous in 'Game of Thrones' brought back from 12,500-year extinction, US company claims",
        "'Well-preserved' baby mammoth dating back to Ice Age dissected by scientists: photos",
        "Spectacular blue spiral light brightens up night sky, likely from Space X rocket",
        "Rare ‘Sharktopus’ – an octopus riding a shark – sighting caught on camera shared by scientists",
        "'Alien' encounter: ISS crew member plays joke as SpaceX team arrives"
    ],
    "http://www.techrepublic.com/rssfeeds/blog/european-technology/": [
        "EU AI Rules Delay Tech Rollouts, But Civil Societies Say Safety Comes First",
        "Meta Unveils Llama 4 AI Series Featuring New Expert-Based Architecture",
        "Trump’s Tariffs: Will They Affect Your Tech Prices?",
        "North Korean Hackers Disguised as IT Workers Targeting UK, European Companies, Google Finds",
        "Apple Rolls Out iOS 18.4 With New Languages, Emojis Apple Intelligence in the EU"
    ],
    "http://www.brandonsun.com/rss/?path=%2Fnational%2Fbreaking-news": [
        "Quebec teen, 15, dies after falling into silo at closed factory in Shawinigan, Que",
        "Topsy-turvy election campaign sees Liberals eyeing more seats in Tory-blue Alberta",
        "Iran and US agree to more talks over Tehran’s nuclear program after 1st round in Oman",
        "Artificial intelligence, wearable tech can improve safety in stroke rehab: study",
        "Canada federal election 2025: Where the leaders are on Saturday, April 12"
    ],
    "http://www.chartattack.com/feed/": [
        "How to Introduce Adult Toys Into Your Relationship Without Awkwardness",
        "What Men Like During Intimate Moments – The Subtle Moves That Drive Them Wild",
        "Can Adult Toys Help Improve Your Sex Life Without Overstepping Boundaries?",
        "What Happens When Your Blood Sugar Is Too High? Signs and Solutions",
        "How to Keep Your Relationship Exciting and Full of Surprises"
    ],
    "http://www.redstate.com/feed/": [
        "Trump Makes Big Tariff Move on China Overnight, Signals Where Things May Be Headed",
        "Behind the Scenes Video Shows Karoline Leavitt Praying Before Heading Out to Drop the Hammer on Reporters",
        "Jasmine Crockett Under Federal Investigation for Campaign Finance Violations",
        "Bill Maher Dishes on His Meeting With ‘Gracious’ President and One Hilarious Thing Trump Did",
        "Put It in an Ad: Democrat Announces Regret for Deporting Criminal Aliens"
    ],
    "http://www.npr.org/rss/rss.php?id=5": [
        "The Science in Science FIction",
        "After 11 Years Behind The Host Mic, Neal Conan Signs Off",
        "Hopes And Fears For The Future Of The World, With Ted Koppel",
        "What's The Talk Of Your Nation?",
        "So Hard To Say Goodbye: Advice For Farewell Notes"
    ],
    "http://www.theguardian.com/travel/rss": [
        "What’s new in Portugal? 10 reasons to visit in 2025",
        "Looking for the authentic Algarve? Go in the low season – and to Tavira",
        "Your favourite bars, beaches, swimming spots and more: readers’ top 10 travel tips on Portugal",
        "Prague’s Vietnamese food revolution",
        "Poetry in motion: walking the new Wordsworth Way in the Lake District"
    ],
    "http://www.newrepublic.com/taxonomy/term/17538/feed": [
        "Trump’s Horrifying Removal of Man in “Error” Takes an Even Darker Turn",
        "Gretchen Whitmer Fell Into Trump’s Tariff Trap",
        "Measles Is Spreading, and RFK Jr. Is Praising Quacks",
        "Trump Scores Massive Win as Judge Rules He Can Deport Mahmoud Khalil",
        "Um, It Turns Out No One at the Ports Is Collecting Trump’s Tariffs"
    ],
    "http://www.espncricinfo.com/rss/content/story/feeds/6.xml": [
        "Fleming: 'We were sloppy in the field, we lacked accuracy under pressure'",
        "Kashvee gets maiden call-up, regulars return for ODI tri-series in Sri Lanka",
        "Hardik says MI bowlers 'didn't have anywhere to hide' on a 'tough track'",
        "Patidar lauds Krunal's 'courage' after triple-wicket final over",
        "BCCI defends decision to hold India-SA Test in Delhi in November"
    ],
    "http://feeds.bizjournals.com/industry_7": [
        "SmartRent CEO steps down after less than two months on the job",
        "Axon-supported bill gains bipartisan lawmaker support. Here's what's next",
        "Netflix eyes first Seattle-area office, filings show",
        "Japa raises 1.3 million to grow its smart-parking market nationwide",
        "Google axed hundreds of jobs in its emerging platforms, devices division"
    ],
    "http://www.dnaindia.com/rss.xml": [
        "IPL 2025 Updated Points Table, Orange and Purple Cap lists after Lucknow Super Giants beat Gujarat Titans by 6 wickets",
        "LSG vs GT Match Report: Aiden Markram, Nicholas Pooran's rapid-fire 50s end Gujarat Titans' four-match winning streak in IPL 2025",
        "Abhishek Chauhan talks about his 'complex' character in Khauf, shares working experience with Monika Panwar, his take on OTT censorship | Exclusive",
        "Nushrratt Bharuccha admits she is 'hurt' for getting replaced in Dream Girl 2 with Ananya Panday: 'Why not me?'",
        "What is controversy over statue of DOG near memorial of Shivaji Maharaj at Raigad Fort?"
    ],
    "http://www.engadget.com/tag/@gaming/rss.xml": [
        "Engadget review recap: The Pixel 9a, smart glasses and AMD's latest CPU",
        "Meta's new board members include former Trump security advisor",
        "How to use the Apple Passwords app",
        "Nintendo Switch 2 recent updates: Release date, price, new games and everything else you need to know",
        "The Social Security Administration is reportedly moving all official communication to X"
    ],
    "http://www.newyorker.com/feed/culture": [
        "Can Reality TV Redeem Jake and Logan Paul?",
        "TikTok and the Retreat from Technological Globalization",
        "Will A.I. Save the News?",
        "The Trump Show Comes to the Kennedy Center",
        "Katie Kitamura Knows We’re Faking It"
    ],
    "http://metro.co.uk/entertainment/showbiz/feed/": [
        "Davina McCall confirms she’s got the all clear after brain tumour surgery",
        "Everything you need to know about Katy Perry’s all-female space mission",
        "Harry Potter actor Nick Moran ‘struggling to walk or talk’ after life-threatening diagnosis",
        "Warwick Davis hopes inquest into wife’s death ‘provides answers’ after finding love again",
        "Stranger Things star ‘spotted on dating app’ despite having famous girlfriend"
    ],
    "http://www.ok.co.uk/rss/entertainment": [
        "Coldplay 2025 tickets and where to buy cheapest resale dates now"
    ],
    "http://economictimes.indiatimes.com/News/rssfeeds/1715249553.cms": [
        "Will rising egg prices spoil the Easter tradition? Here’s what to expect",
        "Calcutta HC orders deployment of central forces in Murshidabad over clashes against Waqf Act",
        "PM Modi to launch development projects in Haryana on Ambedkar birth anniversary",
        "It’s not just a tariff war, a meme war has broken out between the U.S. and China; here’s how Americans are responding to Chinese videos",
        "Tesla enters Saudi market | Cybertruck in Riyadh as Musk eyes EV revival amid sales slump"
    ],
    "http://www.theguardian.com/tv-and-radio/entertainment/rss": [
        "‘We grew up among drugs and violence. Dance kept us focused’: Oti Mabuse on Strictly, survival and self-belief",
        "‘I’m like the TV Lorraine - just more sweary’: at home with the queen of the small screen",
        "Eddie Kadi: ‘People think I’m always ready to crack jokes. If you’re a doctor, I don’t ask you to operate on me’",
        "UK creative industries set behaviour standards after Strictly and MasterChef rows",
        "Wynne Evans to ‘take time out’ from Strictly Come Dancing live tour"
    ],
    "http://www.computerweekly.com/rss/All-Computer-Weekly-content.xml": [
        "Work-life balance biggest barrier for women in tech, says survey",
        "AI surveillance towers place migrants in ‘even greater jeopardy’",
        "More than 100 Horizon victims are challenging Post Office offers on complex claims",
        "IT strategy implications of US tariffs",
        "Met Police to deploy permanent facial recognition tech in Croydon"
    ],
    "http://www.thehindu.com/entertainment/?service=rss": [
        "I know what you are going to do next summer",
        "Kathak legend Kumudini Lakhia passes away",
        "‘When Life Gives You Tangerines’ K-Drama Review: This emotionally rich, profound show is a must watch",
        "‘Kennedy’ screened at 10th Indie Meme Film Festival; Anurag Kashyap says India release ‘should happen soon’",
        "Delayed ‘Phule’ to clear controversy, already complied with CBFC amendments: Anant Mahadevan"
    ],
    "http://www.buzzfeed.com/tvandmovies.xml": [
        "Critics Are Saying The Return Of Black Mirror: Will Be Your Next Binge-Watch",
        "'F*ck Off' – Brits React To News Of A UK Saturday Night Live",
        "I'm Sorry, But Only Someone Born In The '70s Or '80s Can Pass This 1990s Movie-Themed Pictionary",
        "11 Times Actors Couldn’t Hide Just How Much They Hated The Endings To Their Own Shows",
        "19 TV Characters Who Absolutely Do Not Deserve The Hate They Get"
    ],
    "http://grist.org/feed/": [
        "Massachusetts home-electrification pilot could offer a national model",
        "What do climate protests actually achieve? More than you think.",
        "‘People would die’: As summer approaches, Trump is jeopardizing funding for AC",
        "The fix for parched western states: Recycled toilet water",
        "Logging doesn’t prevent wildfires, but Trump is trying it anyway"
    ],
    "http://feeds.feedburner.com/SportcoukNewsRssFeed": [
        "Liverpool attempted to trademark 'Allez Allez Allez' after famous fan chant",
        "Henderson, Keita and Gomez fit for Fulham says Liverpool boss Klopp",
        "Jordan Nobbs Column: England Have Impressed So Far But Must Be Wary of Tough Japan Challenge",
        "Ashley Cole signs new one-year deal at LA Galaxynbsp;",
        "Cilic Expecting First Child In 2020"
    ],
    "http://www.manchestereveningnews.co.uk/news/showbiz-news/rss.xml": [
        "Davina McCall given all-clear after life-saving brain surgery",
        "Stacey Solomon unveils 'strategy' for sons' 'girlfriends' amid grandchildren plea",
        "GBBO's Prue Leith says 'it's ridiculous' as she issues 'alarming' health update",
        "'I was on 99 To Beat - this is what really happens on ITV's new game show'",
        "Blur fans are only just realising band had a different name 35 years ago"
    ],
    "http://feeds.feedburner.com/daily-express-sport-news": [
        "Masters LIVE: Rory McIlroy sends message to Justin Rose as commentators left stunned",
        "'I'm backing a 12/1 to win - Here are my Scottish Grand National tips 1-2-3-4-5'",
        "Sheffield United and Plymouth players brawl in tunnel after Chris Wilder loses his cool",
        "Three rowers banned from 2025 boat race and one race cancelled as chaos erupts",
        "Pep Guardiola taunts Man City fans as dramatic Crystal Palace clash takes turn"
    ],
    "http://cogconnected.com/feed/": [
        "A Decade of Adventure: Elder Scrolls Online Enters a Bold New Era",
        "Hook: Complete Edition Is Coming to Xbox and Switch Today",
        "Creepy Redneck Dinosaur Mansion 3 Just Dropped Its Release Date Trailer",
        "Driveloop: Survivors Blast Its Way to Steam",
        "Faun Town Reveals Its New Release Date"
    ],
    "http://indianexpress.com/section/technology/feed/": [
        "Apple Maps on the web is no longer in beta, now available on Android devices",
        "‘Every response is curated to be personalised’: Co-founders share how Mivi is reimagining AI interaction",
        "Engineers build a hologram you can touch: Here’s how it works",
        "Unitree’s humanoids gear up for the first-ever robot boxing event: Everthing you need to know",
        "Google Pixel 9a review: A smartphone for uncertain times"
    ],
    "http://feeds.feedburner.com/EtsBreakingNews": [
        "Best Shampoo For Colored Hair",
        "Karl Soderlund, Sally Jessy Raphael’s Husband, Dead at 90",
        "The Best Diaper Bag That Is Chic and Functional -- LeSportsac, Herschel, Rebecca Minkoff and More",
        "'AGT': Daredevil Annaliese Nock Terrifies Judges With Wheel of Death Stunt",
        "Justin Hartley's Ex-Wife and Daughter Support Him As Chrishell Stause Split Plays Out on 'Selling Sunset'"
    ],
    "http://feeds.feedburner.com/ExclaimCaAllArticles": [
        "Cœur de pirate Announces New Album 'Cavale,' Shares Title Track",
        "Lana Del Rey's New Album Has a Different Title and Release Date, Actually",
        "Thunder Bay's Wake the Giant Gets Black Eyed Peas, Prozzäk for 2025 Festival",
        "Brian Eno and Beatie Wolfe Announce Two Joint Albums",
        "Metric Drop Off Tour with Bloc Party, Add Canadian Dates"
    ],
    "http://rss.nzherald.co.nz/rss/xml/nzhrsscid_000000002.xml": [
        "Iran seeks ‘real and fair’ nuclear deal as US signals compromise",
        "US President Donald Trump undergoes health check amid scrutiny over age and fitness",
        "China slaps 125 tariffs on US goods but will ‘ignore’ further hikes",
        "Indonesia: Driver survives plunge from unfinished bridge after Google Maps fail",
        "Trump’s biggest U-turns before tariffs: Flip-flopper in chief?"
    ],
    "http://www.nytimes.com/services/xml/rss/nyt/InternationalBusiness.xml": [
        "Bessent Takes Tricky Center Stage as Trade Wars Roil U.S. Economy",
        "Trade War Forces Tough Question for Retailers: Raise Prices or Eat the Cost?",
        "As Tariffs Hit, Americans Are Racing to Buy Car Seats, iPhones and Christmas Gifts",
        "How the Crypto Industry’s Political Spending Is Paying Off",
        "6 Ways to Calm Your Anxiety When Economic Stress Flares"
    ],
    "http://feeds.feedburner.com/ScottishNewsHeraldScotland": [
        "Loch Lomond tourist attraction ceases trading after two decades",
        "Former printworks venue secures licence move in bid to attract 'international DJs'",
        "Inspectors warn two Edinburgh schools are 'substantial fire risk'",
        "Brian Donnelly: SNP housing law rent cap ‘no-go zone' for investors lifted",
        "Family sells village store at Scottish beauty spot after 40 years"
    ],
    "http://feeds.foxnews.com/foxnews/tech": [
        "Hackers find a way around built-in Windows protections",
        "Fox News AI Newsletter: White House record-keeping revamp",
        "Is this robot after our hospitality, retail and healthcare jobs?",
        "Can't find your Android phone? Here's what to do to track it down",
        "Teen goes from 10 nightly seizures to zero with brain implant"
    ],
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_morenews_2794.xml": [
        "Motorcyclist dead in horror truck smash",
        "Two more agencies admit underquoting",
        "Hilarious TV vox pop gaffe",
        "Factories damaged in huge blaze",
        "How a dating site aids liver transplant success"
    ],
    "http://feeds.howtogeek.com/howtogeek": [
        "Microsoft PowerPoint Keyboard Shortcuts: Printable Cheat Sheet",
        "7 Signs It’s Time to Quit a Mobile Gacha Game",
        "What Is Chromium, and Can You Use It as Your Browser?",
        "The Best iPads of 2025",
        "Everything You Need to Know About Watching the Lyrid Meteor Shower in 2025"
    ],
    "http://www.theguardian.com/sport/us-sport/rss": [
        "US star McKennie among 13 players being investigated for illegal gambling",
        "Nikola Jokić becomes third ever NBA player to average triple-double for year",
        "The Masters 2025: Rose just in front after day two – as it happened",
        "Rory McIlroy’s electric finish ignites Masters bid as Justin Rose leads pack",
        "Rory McIlroy back in the mix after prayers answered around Amen Corner"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Science.xml": [
        "She Worked in a Harvard Lab to Reverse Aging, Until ICE Jailed Her",
        "Denisovans Extend Their Range to Asia’s Pacific Coast",
        "Neutrinos Are Shrinking, and That’s a Good Thing for Physics",
        "Chinese Lunar Rocks Suggest a Thirsty Far Side of the Moon",
        "Scientists Map Miles of Wiring in a Speck of Mouse Brain"
    ],
    "http://www.dailymail.co.uk/tvshowbiz/articles.rss": [
        "Maura Higgins parties with 'besties' Kendall Jenner and Hailey Bieber at Coachella - as she moves on from Danny Jones 'drunken kiss' scandal",
        "Louis Tomlinson goes under the radar at Coachella while Zara McDermott is spotted just miles away after confirming romance",
        "Legendary 70s TV star and former supermodel looks unrecognizable on rare outing",
        "Cameron Diaz's many X-rated confessions about her steamy love life resurface",
        "Fans all saying same thing about Michelle Pfeiffer's, 66, new makeup-free selfie"
    ],
    "http://rss.cnn.com/rss/edition_business.rss": [
        "Mexico ready to retaliate by hurting US farmers",
        "Will the next iPhone charge wirelessly?",
        "How 'America First' could turn into to 'India First'",
        "Swiss voters reject corporate tax overhaul",
        "Stocks hit record again. Is Trump the reason?"
    ],
    "http://www.theguardian.com/uk/environment/rss": [
        "‘Toxic cocktail’: study finds almost 200 pesticides in European homes",
        "‘People love being here’: London development shows harmony between nature and housing",
        "California’s 59bn agriculture industry reels under Trump’s wavering tariffs",
        "PR campaign may have fuelled food study backlash, leaked document shows",
        "Starlings fall to record low in UK’s 2025 Big Garden Birdwatch"
    ],
    "http://feeds.feedburner.com/realclearpolitics/qlMj": [
        "Resetting a Trade System Rigged Against Americans",
        "Trump's Mistaken Obsession With Manufacturing Jobs",
        "The Climate Has Changed on Climate Change",
        "Data Shows Democrats Are No Longer the Party of the People",
        "Big Development in Effort To Destroy the Censorship Complex"
    ],
    "http://syndication.eonline.com/syndication/feeds/rssfeeds/": [
        "Inside Eddie Murphy's Sprawling Family Tree: Get to Know His 10 Kids",
        "Why Kaitlyn Bristowe, Jason Tartick and More Bachelor Duos Have Split",
        "The Best Spring Dresses Are 30 off at Abercrombie Fitch Right Now",
        "Kate Spade x Target Is the Collab of Our Dreams: Get a Sneak Peek",
        "The Gut-Wrenching True Story Behind Netflix's Con Mum"
    ],
    "http://feeds.news.com.au/public/rss/2.0/au_national_affairs_news_13_3296.xml": [
        "Culleton lodges appeal",
        "Turnbull dinner cost 30k",
        "Security focus for Abe visit",
        "Judge anger on 10 art claim",
        "Centrelink data to be ‘refined’"
    ],
    "http://www.theguardian.com/football/rss": [
        "Nottingham Forest v Everton, Brighton v Leicester and more: clockwatch – live",
        "De Bruyne leads Manchester City to comeback thrashing of Crystal Palace",
        "Beever-Jones breaks Liverpool hearts to send Chelsea into Women’s FA Cup final",
        "Bogle puts Leeds back on top with crucial winner over Preston",
        "Hatate sparks win over Kilmarnock as Celtic edge closer to title"
    ],
    "http://feeds.nbcnews.com/feeds/topstories": [
        "Stocks surge 600+ points after wild week",
        "Supreme Court avoids confronting Trump so far, even when it rules against him",
        "Judge rules Mahmoud Khalil can be deported",
        "U.S. says it needs more time to provide information on mistakenly deported Maryland man",
        "Federal judge refuses to block immigration enforcement operations in houses of worship"
    ],
    "http://www.digitaltrends.com/feed/": [
        "The future of hand and wrist rehabilitation is fun arcade games",
        "Amazon’s budget-friendly Fire TV Soundbar is an extra 25 off today",
        "A brilliant Google app fixed my problem with the Pixel 9a’s camera",
        "I love Rematch’s fast, fun spin on FIFA (even if my teammates hate me)",
        "Warfare: Alex Garland Ray Mendoza discuss brotherhood in their immersive war movie"
    ],
    "http://www.mirror.co.uk/news/technology-science/rss.xml": [
        "'I was born without a uterus - now I'm pregnant with my second child after life-changing op'",
        "What happens when you donate your body after death - as Coronation Street star has 'no funeral'"
    ],
    "http://www.hellomagazine.com/rss.xml": [
        "Lauren Sánchez reveals surprising possession she will take to space",
        "Loose Women star Gloria Hunniford's 'awful' health scare that led to emergency surgery",
        "Elizabeth Hurley wows in red hot string bikini during glamorous Maldives escape",
        "Kelly Ripa left embarrassed after insult to appearance from surprising source",
        "Masters 2025: Meet the gorgeous wives of Rory McIlroy, Justin Rose, Scottie Scheffler, more"
    ],
    "http://www.dnaindia.com/feeds/scitech.xml": [
        "Is your WhatsApp down too? Several users claim they are unable to upload status, send texts",
        "Pink Moon 2025: Check date, time and where to watch this 'Micromoon' from India?",
        "Neelima Chowdary Mulpuri: Engineering the future of agile through the lens of artificial intelligence",
        "Artificial Intelligence Explained: What is AI, how it works, where it is used, can it replace human beings?",
        "Is it Game of Thrones again? Dire wolves back to life after 10,000 years?"
    ],
    "http://www.pnas.org/rss/Feature_Article.xml": [
        "In This Issue",
        "Validating new limits for human thermoregulation",
        "Meltdown of trust in weakly governed economies",
        "Digital phenotyping using smartphones could help steer mental health treatment",
        "An unusual potassium conductance protects Caenorhabditis elegans pharyngeal muscle rhythms against environmental noise"
    ],
    "http://feeds.feedburner.com/TheAustralianBusNews?format=xml": [
        "Agent payouts to shift stock",
        "‘ALP’s NBN needs extra 10bn’",
        "Three in race for port sale",
        "Chinese airlines eye Qantas",
        "Fairfax-APN fears outlined"
    ],
    "http://feeds.feedburner.com/Rpgcast": [
        "RPG Cast – Episode 763: “Dollar Store King’s Field”",
        "RPG Cast – Episode 762: “Cautiously Pessimistic”",
        "RPG Cast – Episode 761: “It’s Chaos Legion, I Swear”",
        "RPG Cast – Episode 760: “Outdoor Gods”",
        "RPG Cast – Episode 759: “Game Awards 2024”"
    ],
    "http://www.starobserver.com.au/category/features/healthy-living/feed": [
        "Navigating Non-Binary Fashion In A Binary World",
        "Your Guide To Enjoying Transmasculine Sex",
        "Gender Neutral Blood Donation Comes With Sting In Its Tail",
        "Start 2021 Fresh With These 12 New Year Resolutions",
        "Stay safe online"
    ],
    "http://feeds.glamour.com/glamour/health_fitness": [
        "Dried Fruit and Nuts: When Is the Best Time to Eat Them?",
        "13 Best Whitening Toothpastes 2025, Approved by Dentists",
        "Why Am I Always Tired? Here Are 7 Common Reasons Why You Might Be Feeling Fatigue",
        "Teddi Mellencamp Reveals Multiple Brain Tumors: Here’s Everything the ‘RHOBH’ Star Has Shared About Her Diagnosis",
        "12 Best Teeth-Whitening Products, According to Dentists 2025"
    ],
    "http://www.theguardian.com/society/health/rss": [
        "Rogue doctors stole one woman’s eggs to get another patient pregnant. What happened next is an unlikely tale of friendship against the odds",
        "Tuberculosis could end if there’s more US public health funding, experts say",
        "‘We can’t pit boys against girls’: headlines overshadow struggles of a generation of girls",
        "People using drug Mounjaro sustain weight loss over three years, trial finds",
        "Overdiagnosis debate should not ignore social causes of mental illness | Letters"
    ],
    "http://www.standard.co.uk/showbiz/rss": [
        "Music, poetry and joy mark the first Benjamin Zephaniah Day tribute",
        "Davina McCall says brain tumour is ‘not coming back’ in ‘final’ surgery update",
        "Davina McCall shares emotional health update after getting the all-clear following brain tumour surgery",
        "Danny Dyer questioned on being working class in The Assembly trailer",
        "Beckhams 'blank Brooklyn' on his wedding anniversary as he celebrates third year with Nicola Peltz"
    ],
    "http://globalnews.ca/politics/feed/": [
        "Poilievre heads to Carney’s riding, announces help for military veterans",
        "Trump says he’s in ‘good shape’ after annual physical, but results still pending",
        "Before election, feds urged classified briefings for opposition leaders",
        "Poilievre vows not to pass abortion restrictions if elected prime minister",
        "Trump backs permanent daylight saving time. Could it lead to a change?"
    ],
    "http://zeenews.india.com/rss/business.xml": [
        "Which ITR Form Is Right For Senior Citizens In FY 2024-25? Check Income Tax Slabs Under New Tax Regime",
        "Bad News For TCS Employees Company Delays Salary Hikes Due To THIS Reason",
        "SEBI Warns Of Securities Market Frauds Via YouTube, Facebook, X And More",
        "Tatkal Ticket Booking Timings Changed By Indian Railways? IRCTC Shares Latest Update On New Rule Claim- Check",
        "How To Add Credit Or Debit Card On Google Pay In Android; Follow THESE Steps"
    ],
    "http://timesofindia.indiatimes.com/rssfeeds/1081479906.cms": [
        "Rise of Telugu cinema at the Indian box office",
        "Manish recalls Manoj Kumar’s bond with Dharmendra",
        "Aaradhya will become a 'dominating lady' in future",
        "Sonu Kakkar announces split from siblings Neha, Tony",
        "Salim’s prayer meet: Jackie, Vardhan and more pay respects"
    ],
    "http://www.winnipegfreepress.com/rss/?path=%2Fsports": [
        "De Bruyne yet to make decision about his post-Man City future",
        "Russia and Ukraine accuse each other of failing to pause strikes after US envoy leaves Moscow",
        "Fireworks from Pooran help Lucknow end Gujarat’s winning streak in IPL",
        "Trump administration says it will exclude some electronics from ‘reciprocal’ tariffs",
        "Quebec teen, 15, dies after falling into silo at closed factory in Shawinigan, Que"
    ],
    "http://vitals.lifehacker.com/rss": [
        "Why Siri's AI Upgrades Keep Getting Pushed Back",
        "Hackers Stole Health Records From 1.6 Million Planned Parenthood Patients",
        "Microsoft Edge Recently Got a Speed Boost",
        "My Favorite Amazon Deal of the Day: Samsung's 'The Frame' TV",
        "40 Under-the-Radar Netflix Originals You Should Watch"
    ],
    "http://feeds.arstechnica.com/arstechnica/business": [
        "Genetic testing company 23andMe declares bankruptcy",
        "You’ll be paying extra for ad-free Prime Video come January",
        "EA cracks down on modders selling their custom Sims 4 content",
        "HP wins huge fraud case against Autonomy founder and CEO Mike Lynch",
        "Ars online IT roundtable: What’s the future of the data center?"
    ],
    "http://www.femina.in/feeds/feeds-fitness.xml": [
        "Phone a trainer",
        "Save your hair. Have soy",
        "Chocolates for your heart",
        "Get fitter in just 53 days",
        "9 ways to prevent diabetes"
    ],
    "http://www.abc.net.au/news/feed/51892/rss.xml": [
        "US exempts smartphones and computers from Trump's reciprocal tariffs",
        "Australian exports surge into gap as US-China tariffs beef heats up",
        "'Dismal, pathetic, horrific': Older Australians brace to pay more for home care",
        "Hydro project in 'recycled' gold mine could power 2 million homes",
        "'Freezing us': American businesses paralysed in evolving trade war"
    ],
    "http://www.npr.org/rss/rss.php?id=1003": [
        "'The lawn giveth and the lawn taketh away': Photos from the 41st Annapolis Cup",
        "A day in the life of a migrant seeking asylum under the Trump administration",
        "A 3-year legal saga over an inmate's death has its final day in court",
        "Trump administration ends temporary protected status for thousands of Afghans",
        "How Trump's immigration policy changes who gets arrested and detained"
    ],
    "http://www.dnaindia.com/feeds/entertainment.xml": [
        "Abhishek Chauhan talks about his 'complex' character in Khauf, shares working experience with Monika Panwar, his take on OTT censorship | Exclusive",
        "Nushrratt Bharuccha admits she is 'hurt' for getting replaced in Dream Girl 2 with Ananya Panday: 'Why not me?'",
        "'Karan Johar only casts people who are like star kids or whatever but...': Kill fame Abhishek Chauhan talks about how industry works| Exclusive",
        "Meet actress who is close friends with Isha Ambani, charges Rs 35 crore for a film, will next be seen in...",
        "Sonu Kakkar announces she is 'no longer a sister' to Neha Kakkar, Tony Kakkar: 'This decision comes from...'"
    ],
    "http://feeds.nbcnews.com/feeds/worldnews": [
        "American teen was killed by Israeli soldiers in the West Bank. The U.S. has said little about it.",
        "Trump's nuclear talks with Iran come at a crossroads between a deal and all-out war, experts fear",
        "In a break from U.S., British PM calls for probe into Israel's killing of emergency workers in Gaza",
        "Indonesia offers shelter to Palestinians wounded and orphaned in Gaza",
        "More journalists are killed in Gaza in latest Israeli airstrike"
    ],
    "http://www.smh.com.au/rssheadlines/business.xml": [
        "Cheaper fuel? Five ways the market meltdown affects you",
        "ASX Runners of the Week: Osteopore, Leeuwin, Golden Horse Pivotal",
        "ASX closes in the red after Wall Street tumbles on US-China tensions",
        "Larvotto opens hub as NSW gold-antimony study nears completion",
        "Night owls drive Melbourne’s bar and restaurant boom"
    ],
    "http://www.newyorker.com/feed/news": [
        "What the World Learned from Donald Trump’s Tariff Week",
        "So You Want to Be a Dissident?",
        "Sayaka Murata’s Alien Eye",
        "The Dire Wolf Is Back",
        "Bluesky’s Quest to Build Nontoxic Social Media"
    ],
    "http://feeds.nature.com/nbt/rss/current": [
        "Hyperspectral reporters for long-distance and wide-area detection of gene expression in living bacteria",
        "Severus detects somatic structural variation and complex rearrangements in cancer genomes using long-read sequencing",
        "Improved RNA base editing with guide RNAs mimicking highly edited endogenous ADAR substrates",
        "Scalable spatial transcriptomics through computational array reconstruction",
        "Openness guides discovery"
    ],
    "https://ca.sports.yahoo.com/top/rss.xml": [
        "How Canadian investors are reacting to Trump's tariffs",
        "2025 NBA Playoff Picture: All the wild West scenarios entering the final day of the regular season",
        "A trove of artifacts recovered from the black market goes on display in Naples",
        "Trump exempts phones, computers and other electronics from his tariffs on Chinese goods",
        "Trump tariffs live updates: Cell phones, chips and laptops get a reprieve from tariffs; China hikes tariffs on US goods to 125"
    ],
    "http://feeds.feedburner.com/VGChartz": [
        "Zenless Zone Zero Launches in June for Xbox Series X|S",
        "Assassin's Creed Shadows Tops the German Charts for March 2025, Split Fiction Takes 2nd",
        "Rendering Ranger: R² [Rewind] (NS)",
        "PlayStation Plus Price to Increase in More Countries",
        "Shawn Layden on 80 Switch 2 Games: 'If It's the Only Place You Can Play Mario, You Get Your Wallet Out'"
    ],
    "http://feeds.feedburner.com/motherjones/Politics": [
        "The Intercept Discloses Top-Secret NSA Document on Russia Hacking Aimed at US Voting System",
        "Trump's Tweets Threaten His Travel Ban's Chances in Court",
        "Republican Congressman on Suspected Islamic Radicals: Kill Them All",
        "How Trump and His Allies Have Run With Russian Propaganda",
        "In 3 Months, 3 Immigrants Have Died at a Private Detention Center in California"
    ],
    "http://backofthebook.ca/feed/rss/": [
        "Fort McMurray: Shopping time",
        "From “Our Rape Blog”: Shooting the Moon",
        "Electoral reform: Hashtag fresh thinking",
        "The fish hotel",
        "Hatred on an Alberta golf course"
    ],
    "http://feeds.harvardbusiness.org/harvardbusiness?format=xml": [
        "Should You Record That Meeting?",
        "How Contracts Can Help Firms Navigate the Uncertainty of Global Tariffs",
        "What Is the Office for Today?",
        "Understanding the Global Macroeconomic Impacts of Trump’s Tariffs",
        "How People Are Really Using Gen AI in 2025"
    ],
    "http://www.sikhsiyasat.com/feed/": [
        "Issue of Sri Guru Granth Sahib Ji’s Saroop – Who Are The Real Culprits?",
        "How Gurbani Strengthened Me in Prison Cells: Exclusive Talk with Bhai Lal Singh Akalgarh",
        "Where Are Missing Saroops of Guru Granth Sahib: Analysing SGPC’s Reactions, Response Actions",
        "Khalsa Jee Ke Bol Baaley : Guru Khalsa Panth – Dr. Gurpreet Singh During Discussion by Samvad",
        "Why Akal Takht Sahib Acting Jathedar Suddenly Announced to Honour 11 Sikh Personalities"
    ],
    "http://www.channel4.com/news/uk/rss": [
        "Debate: What do Brits gain or lose from Trump tariffs?",
        "How do Brits feel about the future of the economy?",
        "Debate: Does the UK need British Steel?",
        "Are we on a one-way road to nationalising British Steel?",
        "Scunthorpe workers relieved as government considers nationalisation"
    ],
    "http://www.thehealthsite.com/comments/feed/": [
        "Comment on Sunita Williams Press Conference Live: NASA Astronaut To Share 9 Month Space Experience On March 31 – Where To Watch by Laurine Lowe",
        "Comment on Live News: Sunita Williams Considered Retirement Before Going To ISS – Family Shares NASA Astronaut’s Struggles In Space by jokerbet giriş",
        "Comment on Unexpected Delivery: Pregnant Woman Gives Birth On Bangkok Street Amid Strong Quake – WATCH VIDEO by jokerbet güncel",
        "Comment on Kamakhya Express Derails Near Odisha’s Cuttack: Impact of Train Accidents On Passengers’ Mental Health by jokerbet güncel giriş",
        "Comment on Unexpected Delivery: Pregnant Woman Gives Birth On Bangkok Street Amid Strong Quake – WATCH VIDEO by jokerbet giriş"
    ],
    "http://www.huffingtonpost.co.uk/feeds/verticals/uk-tech/index.xml": [
        "Conservative Journalist Mocked For Asking The Cringiest Possible Trump Question",
        "I Went To Prague And Discovered Tartar Sauce On Chips – Here’s What Other Countries Swear By",
        "'It Treats Us Like Children' – What 5 Autistic People Think Of Netflix's Love On The Spectrum",
        "If You Think Incels Are 'Gross, Basement Dwellers', Your Smug Politics Are Part Of The Problem",
        "Analysis: Why Those Who Want Starmer To Read Trump The Riot Act Will Be Disappointed"
    ],
    "http://feeds.foxnews.com/foxnews/politics": [
        "Here's what happened during Trump's 12th week in office",
        "Kennedy tells FDA employees that 'the Deep State is real': report",
        "Whitmer ditches Dem playbook on Trump's tariffs amid 2028 speculation",
        "Sen. Tim Scott outlines first 100 days of Congress, crypto, tariffs",
        "At least 26 American hostages released since Trump took office"
    ],
    "http://rss.sciam.com/ScientificAmerican-Global": [
        "This Robot Copies Life—By Decomposing",
        "HIV, Trans Health, and Covid Research Targeted by Trump Cuts to NIH",
        "Crows Are Surprisingly Good at Geometry",
        "JWST Spots Remains of Alien Planet That Fell into a Star",
        "Dolphins Communicate with ‘Fountains of Pee’"
    ],
    "http://feeds2.feedburner.com/time/scienceandhealth": [
        "What to Know About April’s ‘Micromoon’",
        "Yes, Climate Change Really is Making Your Hay Fever Worse",
        "The Science Behind the Return of the Dire Wolf",
        "The Return of the Dire Wolf",
        "How Realistic Is the Severance Procedure? Brain Surgeons Have Some Thoughts"
    ],
    "http://www.standard.co.uk/sport/football/rss": [
        "Arsenal vs Brentford LIVE: Premier League match stream, latest team news, lineups, TV, prediction",
        "Oliver Glasner criticises Jean-Philippe Mateta as he explains Crystal Palace half-time sub in Man City defeat",
        "Arsenal: Four big Mikel Arteta selection decisions for Brentford before Real Madrid",
        "Arsenal XI vs Brentford: Predicted lineup, confirmed team news and injury latest for Premier League today",
        "Arsenal vs Brentford: Prediction, kick-off time, TV, live stream, team news, h2h results, odds today"
    ],
    "http://feeds.feedburner.com/TheAustralianMediaNews": [
        "Advertising adds up to 40bn",
        "Chris Wharton’s starring role",
        "Fairfax-APN fears outlined",
        "Trump dumps ‘phony’ Post",
        "Delta puts Nine back in ratings"
    ],
    "http://feeds.bbci.co.uk/news/health/rss.xml?edition=us": [
        "Cancer pill gave me 'four years of extra time'",
        "Saliva test may turn tide on prostate cancer, claim scientists",
        "What goes on inside toddlers' brains?",
        "Infected blood victims losing faith as inquiry hearings restart",
        "Trump threatens to end pharmaceuticals tariff exemption"
    ],
    "http://www.ok.co.uk/rss/health": [
        "Amy Dowden looks 'gorgeous' in high street green dress as she celebrates Strictly return",
        "Scarlett Moffatt wears the perfect Next gingham dress that flatters curves",
        "'This £29 instant root disguiser has saved me thousands on hair salon appointments'",
        "Beauty editors are obsessed with this lightweight sunscreen that gives glowing, even skin",
        "Celeb Big Brother host AJ Odudu has a £29 hack for glowing skin that 4k shoppers agree with"
    ],
    "http://www.npr.org/rss/rss.php?id=1128": [
        "How climate change is making hay fever more miserable",
        "Mental health workers go on hunger strike, demanding better pay and benefits",
        "Dozens of USAID contracts were canceled last weekend. Here's what happened",
        "'I cannot guarantee complete confidentiality,' VA therapists ordered to tell veterans",
        "Pig kidney transplant fails after patient rejection"
    ],
    "http://www.sciencemag.org/rss/current.xml": [
        "Rules of engagement for condensins and cohesins guide mitotic chromosome formation | Science",
        "The genetic architecture of and evolutionary constraints on the human pelvic form | Science",
        "A distinct priming phase regulates CD8 T cell immunity by orchestrating paracrine IL-2 signals | Science",
        "A neuroimmune circuit mediates cancer cachexia-associated apathy | Science",
        "These two biologists found purpose—and love—trying to save Nigeria's bats"
    ],
    "http://www.theguardian.com/us/lifeandstyle/rss": [
        "What happens when love tips over into the infatuated state of ‘limerence’?",
        "Elton John and Madonna have made up, but why do famous people publicly go to war?",
        "Nobu Matsuhisa: ‘I’d watch my mentor making sushi and copy him under the table’",
        "How to raise kind children: lead by example, talk it over and get a dog",
        "Perfume brands fighting a ‘lost cause’ against cheap dupes, say lawyers"
    ],
    "http://www.theguardian.com/us/film/rss": [
        "Ted Kotcheff, director of First Blood, Weekend at Bernie’s and Wake in Fright, dies aged 94",
        "Streaming: The Last Showgirl and the best Las Vegas films",
        "Bella Thorne accuses Mickey Rourke of bruising her genitals on movie set",
        "‘A collective sigh of relief’: how Jesse Eisenberg’s A Real Pain went down in Poland",
        "Iranian directors of My Favourite Cake given suspended jail sentences for ‘spreading lies’"
    ],
    "http://feeds.feedburner.com/BreakingScienceNews?format=xml": [
        "Bizarre New Species of Therizinosaur Had Two-Fingered Hands",
        "KATRIN Physicists Measure Upper Mass Limit of Neutrino",
        "Pleistocene-Age Denisovan Fossil Found in Taiwan",
        "New Genomic Research Sheds More Light on Evolutionary History of Mammoths",
        "Astronomers Measure Rotation Rate of Uranus with Unprecedented Precision"
    ],
    "http://feeds.theguardian.com/theguardian/uk/business/rss": [
        "MPs approve British Steel bill after Chinese owners’ ‘excessive’ demands – live",
        "‘Completely out of touch’: golf and dinners for ‘king’ Trump as economy melts down",
        "‘It’s going to be messy’: Americans on how Trump’s tariffs are shaping their spending",
        "‘I’m super worried’: fewer UK tourists visiting US amid Trump’s policies and rhetoric",
        "Perfume brands fighting a ‘lost cause’ against cheap dupes, say lawyers"
    ],
    "http://www.livescience.com/home/feed/site.xml": [
        "Record-breaking 'dead' galaxy discovered by JWST lived fast and died young in the early universe",
        "'Major' ancient Egyptian town discovered — and it has a jug stamped with the name of Nefertiti's daughter",
        "Dracula parrot: The goth bird whose piercing screams echo through New Guinea forests",
        "What do black boxes on planes actually record?",
        "Science news this week: Controversy around the dire wolf 'de-extinctions' and a 3D hologram breakthrough"
    ],
    "http://feeds.feedburner.com/DiscoverTopStories": [
        "5 of the Biggest Extraterrestrial Impacts That Moved Oceans and Made Moons",
        "Watch How Male Fiddler Crabs Beat Sand Like a Drum to Attract Mates",
        "Sleep’s Surprising Role in Strengthening Long-Term Memory",
        "A Black Hole Awakens in a Distant Galaxy, Producing X-Ray Bursts",
        "The Stunning Lyrid Meteor Shower 2025 Peaks This Month — Here's What to Know"
    ],
    "http://www.npr.org/rss/rss.php?id=1004": [
        "Ukraine's DIY drone makers are helping fighters on the front lines",
        "Ecuador's next president faces rampant drug violence and few resources to combat it",
        "How Trump's immigration policy changes who gets arrested and detained",
        "Druze population resists Syrian government's push to disband militias",
        "Allegations of a Land Grab on Nigeria's Coast"
    ],
    "http://www.standard.co.uk/news/rss": [
        "Woman hit at golf club by van being pursued by police ‘critical but stable’",
        "Star Wars artist fundraising for colleague who lost sight fighting in Ukraine",
        "M25 traffic chaos near Heathrow Airport as crash causes severe delays",
        "Thousands march to derelict Casement Park to demand its redevelopment",
        "Labour MP calls for ministers to act over Grangemouth as well as at Scunthorpe"
    ],
    "http://www.techspot.com/backend.xml": [
        "Americans panic when their phone battery hits 38 on average, study says",
        "Whistleblower tells Congress Facebook worked with China on censorship and data access",
        "Sony stops making 8K TVs, but ultra high-def cameras remain key to future",
        "Researcher uncovers network of risky Chrome extensions with over 4 million installs",
        "Razer launches PC Remote Play app to compete in game streaming arena"
    ],
    "http://khn.org/feed/": [
        "Journalists Delve Into Effects of Deep Federal Cuts on Public Health",
        "Some Rural Hospitals Ditch Medicare Advantage",
        "More Psych Hospital Beds Are Needed for Kids, but Neighbors Say Not Here",
        "Trump HHS Eliminates Office That Sets Poverty Levels Tied to Benefits for at Least 80 Million People",
        "KFF Health News' 'What the Health?': The Dismantling of HHS"
    ],
    "http://feeds.examiner.ie/ietopstories": [
        "As it happens: Live updates from Munster's Champions Cup quarter-final against Bordeaux Bègles",
        "‘Completely out of touch’: golf and dinners for ‘king’ Trump as economy melts down",
        "Sarah Butler: If you like a Chinese takeaway you'll love this sweet and sticky stir fry",
        "Ireland at risk of energy crisis without gas reserve, warns environment minister",
        "Ardal O’Hanlon on comedy, trigger warnings, and life after Father Ted"
    ],
    "http://www.esquire.com/blogs/culture/culture-rss": [
        "‘The Last of Us’ Season 2 Schedule: When Do New Episodes Come Out?",
        "How to Watch Warfare",
        "Your Friends and Neighbors Release Schedule: When Do New Episodes Come Out?",
        "One to One: John Yoko Returns to an Often Forgotten Lennon Era",
        "The Pitt Episode 15 Finale Recap"
    ],
    "http://www.cnet.com/rss/android-update/": [
        "Best Internet Providers in Traverse City, Michigan",
        "Where's My State Tax Refund? How to Track Them in Each State",
        "New Google Maps AI Tool Could Help Congestion and Fix Roads Near You",
        "45 K-Cups Later, These Are the Pods With the Boldest Flavor",
        "ATT Assistant VP Shares the Travel Advantages of an In-Car Wi-Fi Hotspot"
    ],
    "http://globalnews.ca/sports/feed/": [
        "Demidov fever; new Montreal Canadiens sniper bringing fanfare frenzy",
        "Toronto Raptors waive Robinson and Swider",
        "Mogbo has first triple-double of his career",
        "Raptors dominate Hornets despite resting starters",
        "Brandon Ingram gets injection for ankle sprain"
    ],
    "http://feeds.foxnews.com/foxnews/latest?format=xml": [
        "Kamala Harris mocked on social media for reported interest in creating an institute for policy and ideas",
        "MLB umpire called 'perfect game' in Royals win over Twins, metrics tracking shows",
        "DAVID MARCUS: Sorry Dems, literally nobody believes married women can’t get IDs",
        "Paige Spiranac praises Nick Dunlap for finishing out Masters participation despite poor play",
        "Microdosing spirituality: How our everyday attachments connect us to the divine"
    ],
    "http://feeds.feedburner.com/IeeeSpectrumRoboticsChannel": [
        "Video Friday: Tiny Robot Bug Hops and Jumps",
        "Video Friday: RIVR Delivers Your Package",
        "How Dairy Robots Are Changing Work for Cows (and Farmers)",
        "Protecting Robots in Harsh Environments with Advanced Sealing Systems",
        "The Tiniest Flying Robot Soars Thanks to Magnets"
    ],
    "http://feeds.slate.com/slate-101526": [
        "A Fun New Thriller Doesn’t Make Any Sense. Good Thing It Doesn’t Need To.",
        "Trump’s Tariffs Shook the Economy. This Website’s Response Might Matter More.",
        "Slate Mini Crossword for April 12, 2025",
        "How The Last of Us Fans Turned Against Its Breakout Star",
        "The One Thing That Brought Trump Close to Reality This Week"
    ],
    "http://www.livemint.com/rss/consumer": [
        "Star, Zee join hands for TV distribution venture",
        "Deep-voiced Scotty McCreery wins amp;8220;American Idolamp;8221;",
        "Mumbai knock KKR out of IPL, set up qualifier-II against RCB",
        "A new spin to the spin theory",
        "IPL reschedule due to assembly elections"
    ],
    "http://www.cbssports.com/partners/feeds/rss/home_news": [
        "2025 Masters TV schedule, coverage, channel, where to watch online, how to live stream today, golf tee times",
        "NBA final weekend: What's at stake as West playoff spots still up for grabs; Lakers, Knicks lock No. 3 seeds",
        "Matthew Golden NFL Draft 2025 profile: Full scouting report, pro comparison, future outlook and more",
        "Arkansas basketball under John Calipari: Insiders unveil transfer portal news, 2025 recruits, roster, targets",
        "NASCAR DFS: 2025 Bristol lineups, Food City 500 daily fantasy racing picks on DraftKings, FanDuel"
    ],
    "http://feeds.feedburner.com/rabble-news?format=xml": [
        "Don’t buy-in to climate science denialism",
        "UCP set to announce plan to bust up AHS",
        "Deepfakes and gender based violence",
        "City of Vancouver to lowest paid workers: Let them eat cuts",
        "Hundreds of thousands of Quebec public sector workers vow further strike action"
    ],
    "http://feeds.newscientist.com/space": [
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind",
        "Rereading the best sci-fi writers of all time: Larry Niven",
        "What the new science of magic reveals about perception and free will",
        "US military launches initiative to find the best quantum computer"
    ],
    "http://feeds.feedburner.com/FP_TopStories?format=xml": [
        "Making the most of market volatility: FP Video on the latest tariff tangents",
        "Posthaste: Stressed-out bond markets forced Trump into tariff U-turn. Could it happen again?",
        "Bond vigilantes are back raising the spectre of an American face-off",
        "Canada's next government will have to deal with an immigration system that has 'lost its brand'",
        "Energy on the ballot: The key to Canadian prosperity"
    ],
    "http://www.dynamicbusiness.com.au/feed": [
        "WPSmartPay: Modern payment solution for WordPress",
        "WPCommerz: Product recommendation tool for WooCommerce",
        "VideoToBlog: Video to blog convertor",
        "Apify: AI web scraper",
        "Protevia: Personal safety app protector"
    ],
    "http://www.watoday.com.au/rssheadlines/technology-news/article/rss.xml": [
        "There’s one way you can make your super more secure",
        "Introducing NEO Gamma - Another Step Closer to Home",
        "New Elder Scrolls Online expansion unveiled",
        "Did an AI chatbot help draft the US tariff policy?",
        "I paid an athlete 120 to send me a personalised video. You can, too"
    ],
    "http://feeds.feedburner.com/TheAtlanticWire": [
        "The 'Only' Profession to 'Celebrate What It Means to Live a Life'",
        "Corinne Found the Perfect Way to Rebel Against The Bachelor",
        "Viola Davis's Urgent Call to 'Exhume the Ordinary'",
        "What Moonlight’s Win Says About the Oscars’ Future",
        "Five Ways of Seeing Five Minutes of 'Real People' at the Oscars"
    ],
    "http://rss.cnn.com/rss/cnn_topstories.rss": [
        "Some on-air claims about Dominion Voting Systems were false, Fox News acknowledges in statement after deal is announced",
        "Dominion still has pending lawsuits against election deniers such as Rudy Giuliani and Sidney Powell",
        "Here are the 20 specific Fox broadcasts and tweets Dominion says were defamatory",
        "Judge in Fox News-Dominion defamation trial: 'The parties have resolved their case'",
        "'Difficult to say with a straight face': Tapper reacts to Fox News' statement on settlement"
    ],
    "http://www.deccanchronicle.com/rss.xml": [
        "Andhra Pradesh: AP Records 83 Pass in Inter Second Year, 70 in First Year",
        "Gottipati Attacks YSRC Govt. For Sand Loot",
        "Ananya Birla gifts Janhvi Rs 5-cr Lamborghini",
        "Ooh Bedroom lucky charms and jinx talk",
        "Trisha is a titan herself"
    ],
    "https://sports.yahoo.com/top/rss.xml": [
        "De Bruyne yet to make decision about his post-Man City future",
        "ESPN projects Nets to take Jeremiah Fears in 2025 NBA mock draft",
        "USC picks up commitment from Samford transfer Jaden Brownell",
        "Former Dolphins QB worked out for Cardinals",
        "Masters 2025 live updates: Leaderboard, best pairings from third round at Augusta National"
    ],
    "http://www.popsugar.com/feed": [
        "How Much Does Does F45 Cost? Here's the Membership Breakdown",
        "70+ First-Date Questions to Keep the Conversation Moving",
        "The Love on the Spectrum Siblings Open Up About Life With Connor, Abbey, and Tanner",
        "The 10 Best Amazon Dressers For Every Style and Budget",
        "The 20 Best Amazon Kitchen Products That Will Make Your Life Easier"
    ],
    "http://www.hilltimes.com/feed": [
        "Supply chain strategy must go beyond transportation, says Supply Chain Canada president"
    ],
    "http://torontosportsmedia.com/feed": [
        "‘Don’t let me flip that switch’: Riders’ RB A.J. Ouellette turned carnivore to fuel viral body transformation",
        "Canadian DB Tyrell Ford turned down multiple NFL offers to stay in CFL, sign with Edmonton Elks",
        "‘I see it every day’: Bo Levi Mitchell visualizes retiring if Hamilton Tiger-Cats win Grey Cup in 2025",
        "Ottawa Redblacks’ DB Ty Cranston retires from CFL",
        "Winnipeg RB Brady Oliveira reveals hamstring injury, MCL sprain limited historic CFL MOP season"
    ]
}