{
    "http://www.cbsnews.com/latest/rss/main": [
        "Man arrested after arson at Pa. Governor's Residence​",
        "Helicopter tour company involved in fatal NYC crash shuts down, FAA says",
        "No distress call before plane with 6 aboard crashed in New York: NTSB",
        "Volodymyr Zelenskyy's full 2025 60 Minutes interview in Ukrainian",
        "MIT graduate and family from Weston killed in plane crash in upstate New York"
    ],
    "http://feeds.bbci.co.uk/news/health/rss.xml": [
        "Three million child deaths linked to drug resistance, study shows",
        "Lab-grown human teeth to 'fill in the gaps' in regenerative dentistry",
        "Cancer pill gave me 'four years of extra time'",
        "Saliva test may turn tide on prostate cancer, claim scientists",
        "What goes on inside toddlers' brains?"
    ],
    "http://feeds.bbci.co.uk/news/technology/rss.xml": [
        "Landmark antitrust trial could force Zuckerberg to sell Instagram",
        "Everyone's jumping on the AI doll trend - but what are the concerns?",
        "Microsoft rolls out AI screenshot tool dubbed 'privacy nightmare'",
        "OpenAI sues Elon Musk claiming 'bad-faith tactics'",
        "Will iPhones cost more because of Trump's tariffs on China?"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Technology.xml": [
        "U.S. Prepares to Challenge Meta’s Social Media Dominance",
        "What to Know About Trump’s Antitrust Efforts Against Tech Giants",
        "Trump Adds Tariff Exemptions for Smartphones, Computers and Other Electronics",
        "How the Crypto Industry’s Political Spending Is Paying Off",
        "Big Tech’s Tariff Chaos + A.I. 2027 + Llama Drama"
    ],
    "http://feeds.theguardian.com/theguardian/science/rss": [
        "Lauren Sanchez’s all-female space flight is about to blast off – and will challenge Elon Musk’s SpaceX",
        "How and where to watch the Lyrid meteor shower",
        "What I’ve learned after 40 years as the Observer’s science editor",
        "Jawbone fossil builds richer image of ancient Denisovans",
        "Greek vase ‘looted’ in Italy removed from sale by London gallery"
    ],
    "http://feeds.arstechnica.com/arstechnica/science": [
        "A guide to the “platonic ideal” of a Negroni and other handy tips",
        "Quantum hardware may be a good match for AI",
        "Rocket Report: “No man’s land” in rocket wars; Isaacman lukewarm on SLS",
        "New simulation of Titanic’s sinking confirms historical testimony",
        "Painted altar in Maya city of Tikal reveals aftermath of ancient coup"
    ],
    "http://feeds.glamour.com/glamour/health_fitness": [
        "Dried Fruit and Nuts: When Is the Best Time to Eat Them?",
        "13 Best Whitening Toothpastes 2025, Approved by Dentists",
        "Why Am I Always Tired? Here Are 7 Common Reasons Why You Might Be Feeling Fatigue",
        "Teddi Mellencamp Reveals Multiple Brain Tumors: Here’s Everything the ‘RHOBH’ Star Has Shared About Her Diagnosis",
        "12 Best Teeth-Whitening Products, According to Dentists 2025"
    ],
    "http://rss.sciam.com/ScientificAmerican-Global": [
        "This Butterfly’s Epic Migration Is Written into Its Chemistry",
        "This Robot Copies Life—By Decomposing",
        "HIV, Trans Health, and Covid Research Targeted by Trump Cuts to NIH",
        "Crows Are Surprisingly Good at Geometry",
        "JWST Spots Remains of Alien Planet That Fell into a Star"
    ],
    "http://www.redstate.com/feed/": [
        "Dems Hold Lame Protest of Tom Homan in Arizona -- He Just Bodies Them With Perfect Response",
        "Not Known for Squishy Takes, Stephen Miller Says Tariffs Will Save US From 'Complete Economic Domination'",
        "Trump's Department of Justice Tells Judge They're No Longer Amused Playing Her Silly Games",
        "Worst News Outlet of the Week - a Look at the Latest Deliveries From the Dysfunctional Media",
        "Gretchen Whitmer Ended Her POTUS Run With Progressives Last Week, but She Never Really Had One"
    ],
    "http://feeds.feedburner.com/TheAustralianBusinessWorldBusNews?format=xml": [
        "China ends floats logjam",
        "Traders suspended in forex probe",
        "FBI probes possible J.P. Morgan hacking",
        "Snapchat valued at 10bn",
        "Rosneft poised for Arctic LNG stake"
    ],
    "http://www.cnet.com/rss/iphone-update/": [
        "Best Phone to Buy for 2025",
        "Think You Need to Delete Stuff to Free Up iPhone Space? Think Again",
        "Map Your Hikes This Spring With This iOS Feature on iPhone",
        "Best Mobile VPN of 2025: Stream on the Go and Avoid Mobile Traffic-Shaping",
        "iPhone 20th-Anniversary Edition Could Bring Major Design Overhaul"
    ],
    "http://feeds.arstechnica.com/arstechnica/gadgets": [
        "Turbulent global economy could drive up prices for Netflix and rivals",
        "Chrome’s new dynamic bottom bar gives websites a little more room to breathe",
        "Powerful programming: BBC-controlled electric meters are coming to an end",
        "OnePlus releases Watch 3 with inflated 500 price tag, won’t say why",
        "Google takes advantage of federal cost-cutting with steep Workspace discount"
    ],
    "http://feeds.bbci.co.uk/news/health/rss.xml?edition=us": [
        "Three million child deaths linked to drug resistance, study shows",
        "Lab-grown human teeth to 'fill in the gaps' in regenerative dentistry",
        "Cancer pill gave me 'four years of extra time'",
        "Saliva test may turn tide on prostate cancer, claim scientists",
        "What goes on inside toddlers' brains?"
    ],
    "http://www.journaldemontreal.com/spectacles/rss.xml": [
        "«Ta fille est dans Hitster»: le jeu musical qui fait fureur auprès des Québécois et de nos artistes",
        "«Dans quelle job apprends-tu devant tout le monde, à part premier ministre du Canada?»: Rosalie Vaillancourt se confie sur sa co-animation de l'émission «Sortez-moi d'ici»",
        "«Je suis fasciné par le magma humain», confie l'acteur français Daniel Auteuil, qui réalise le film «Le fil»",
        "Hitster: des chansons choisies par et pour le Québec",
        "«Elle avait une ardente volonté de réussir»: la vie tumultueuse de la chanteuse Sylvie Vartan, racontée dans une biographie non autorisée"
    ],
    "http://www.bollywoodlife.com/feed/": [
        "THIS actress' lip-lock photo with a South actor went viral after, she has earned fame from, received massive praise for",
        "Kaisi Teri Khudgarzi to Darr Khuda Say; Top 7 Pakistani dramas with more toxic husbands than Indian serials",
        "Jaat box office collection day 4: Sunny Deol's film swiftly enters Rs...; Salman Khan's Sikandar slumps down to...",
        "THIS superstar cheated on his 15 year younger wife who gave bold scenes in Rishi Kapoor's film, ended her career because..., reunited after 27 years due to...",
        "MEET the world’s richest actor, never gave a blockbuster film, has a net worth of, lived on streets, beats Tom Cruise, Shah Rukh Khan, Ryan Reynolds, he is..."
    ],
    "http://rss.sciam.com/ScientificAmerican-News": [
        "Stunning Comet Could Photobomb This April's Total Solar Eclipse",
        "The Industrial Designer behind the N95 Mask",
        "An Evolutionary 'Big Bang' Explains Why Snakes Come in So Many Strange Varieties",
        "JWST Is Tracking Down the Cosmic Origins of Earth's Water",
        "Flimsy Antiabortion Studies Cited in Case to Ban Mifepristone Are Retracted"
    ],
    "http://feeds.feedburner.com/rabble-news?format=xml": [
        "Don’t buy-in to climate science denialism",
        "UCP set to announce plan to bust up AHS",
        "Deepfakes and gender based violence",
        "City of Vancouver to lowest paid workers: Let them eat cuts",
        "Hundreds of thousands of Quebec public sector workers vow further strike action"
    ],
    "http://www.macworld.com/index.rss": [
        "Apple gets a tariff exemption on iPhones and, well, everything else",
        "Shure MV7i review: An all-in-one mic for podcasts and music",
        "Apple Maps on the web expands access to more devices and browsers",
        "Apple TV+ this week: ‘Your Friends and Neighbors’ is now streaming",
        "The delayed Siri Apple Intelligence features are now coming ‘in the fall’"
    ],
    "http://feeds.bbci.co.uk/sport/0/rss.xml?edition=uk": [
        "How coping with 'heartbreak' changed everything for McIlroy",
        "McIlroy wins Masters play-off to complete career Grand Slam",
        "Bayindir's failed Man Utd audition offers Onana dilemma",
        "McIlroy 'proud' as Masters play-off win seals career Grand Slam at last",
        "'A fascinating contrast between team-mates and title contenders'"
    ],
    "http://www.smh.com.au/rssheadlines/health/article/rss.xml": [
        "Scarborough venue sacks bouncers at centre of alleged assault of patron",
        "Major parties have no solution to the housing crisis",
        "Vinesmith",
        "Divers search Parramatta River for man who drove into water at popular north shore fishing spot",
        "As it happened: Albanese, Dutton signature policies revealed; economists warn of house price surge"
    ],
    "http://www.techinsider.io/rss": [
        "It's easier than ever for businesses to jack up prices",
        "America has already lost the robot war to China",
        "Vibe coding is changing the way investors think about founders",
        "Masters champion Rory McIlroy says he overcomes performance anxiety by visualizing the worst-case scenario",
        "Sam Altman has a crib recommendation &mdash; and it's not the Snoo"
    ],
    "http://feeds.skynews.com/feeds/rss/politics.xml": [
        "'My world fell apart': Rise in suicide attempts linked to HMRC tax crackdown",
        "Bangladesh issues arrest warrant for Tulip Siddiq - as she denies claims against her",
        "No evidence of 'two-tier policing' in handling of Southport riots, MPs say",
        "MP refused entry to Hong Kong says it should be 'wake-up call' to all parliamentarians",
        "The art of the steel"
    ],
    "http://feeds.feedburner.com/IeeeSpectrumFullText": [
        "Video Friday: Tiny Robot Bug Hops and Jumps",
        "Climb the Career Ladder with Focused Expertise",
        "IEEE TryEngineering STEM Grants Fund Over 50 Projects",
        "The Great Chatbot Debate: Do They Really Understand?",
        "First Supercritical CO2 Circuit Breaker Debuts"
    ],
    "http://feeds.feedburner.com/RockPaperShotgun": [
        "What's on your bookshelf?: Mouthwashing's Johanna Kasurinen",
        "The Sunday Papers",
        "V Rising's first big post 1.0 update brings a bevy of additions, combat reworks, and Steam Deck support later this month",
        "Elden Ring Nightreign? The Duskbloods? Who needs them, now that Dark Souls' seamless co-op mod is here",
        "Marathon is real, looks ridiculously stylish, has a release date, and is getting a closed alpha test this month"
    ],
    "http://feeds.newscientist.com/tech": [
        "'Quantum Darwinism' may explain why we live in a shared reality",
        "What the surprising lives of solitary animals reveal about us",
        "How to spot Haumea, one of the solar system's strangest objects",
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind"
    ],
    "http://www.cnet.com/rss/gaming/": [
        "Today's NYT Connections: Sports Edition Hints and Answers for April 14, 203",
        "Today's NYT Mini Crossword Answers for Monday, April 14",
        "Best Internet Providers in Mankato, Minnesota",
        "Today's NYT Strands Hints, Answers and Help for April 14, 407",
        "Today's NYT Connections Hints, Answers and Help for April 14, 673"
    ],
    "http://feeds.bbci.co.uk/news/world/asia/india/rss.xml": [
        "Indian pot belly: From status symbol to silent killer",
        "ICC forms taskforce to help Afghan female players",
        "Trump exempts smartphones and computers from new tariffs",
        "Will trade-shy India gain edge in tariff-driven slowdown?",
        "Indian man who fed water to cheetahs in viral video restored in job"
    ],
    "http://feeds.feedburner.com/daily-express-uk-news": [
        "Beloved store closing its doors with huge 20 off sale in latest blow to the high street",
        "The UK’s ‘most beautiful’ McDonald’s that even has its own ‘beer garden’",
        "Police force spends £4.5m taxpayers' cash on training officers about the slave trade",
        "M6 LIVE: Motorway closed after huge lorry fire threatening rush hour chaos",
        "Prosecutors ‘hampered’ police by blocking facts about Southport killer say MPs"
    ],
    "https://ca.sports.yahoo.com/top/rss.xml": [
        "Singapore downgrades GDP forecast for 2025 amid US-China trade war; PM Wong’s message to young Singaporeans and first-time voters: Singapore live news",
        "Iranian foreign minister will consult on Iran-U.S. talks during visit to Russia",
        "Reuters poll: Rising Canada recession risk to trigger at least two more rate cuts this year",
        "Goldman Sachs cuts Europe's STOXX 600 forecast for second time this month",
        "Germany ready to send Taurus missiles to Ukraine"
    ],
    "http://www.theguardian.com/us/film/rss": [
        "Eclipse review – Tom Conti stars in intriguing but elusive tale of a mysterious death",
        "The Balcony Movie review – funny/sad film that offers a view into strangers’ lives",
        "Iraq veteran and film-maker Ray Mendoza: ‘Writing Warfare with Alex Garland was like going to a therapist’",
        "Ted Kotcheff, director of First Blood, Weekend at Bernie’s and Wake in Fright, dies aged 94",
        "Streaming: The Last Showgirl and the best Las Vegas films"
    ],
    "http://www.smh.com.au/rssheadlines/business.xml": [
        "Housing is the right problem but our leaders have the wrong policies",
        "ASX lifts as miners and banks rally",
        "Javelin starts two-week drill program chasing high-grade WA targets",
        "Auric fires up first owner-operated WA gold mine",
        "Infill drill testing firms up Ardea high-grade WA nickel deposit"
    ],
    "http://feeds.webservice.techradar.com/us/rss/new": [
        "IT: Welcome to Derry – everything you need to know about the new Max horror series",
        "World Quantum Day – is the internet ready for the biggest security threat of all time?",
        "The state of AI in 2025: the road ahead",
        "This curling wand looks like a drill and I'm not sure if it's dumb or genius",
        "The Last of Us season 2 episode 1 is a purposefully paced, slightly dreary return for Pedro Pascal and Bella Ramsey's highly acclaimed HBO TV show"
    ],
    "http://www.popsugar.com/feed": [
        "27 Festival Season Essentials, From Face Gems to Cowboy Boots",
        "The Wellness Industry Has a Pill Problem",
        "How Much Does Does F45 Cost? Here's the Membership Breakdown",
        "70+ First-Date Questions to Keep the Conversation Moving",
        "The Love on the Spectrum Siblings Open Up About Life With Connor, Abbey, and Tanner"
    ],
    "http://feeds.howtogeek.com/howtogeek": [
        "Physical Media Won't Cannibalize Streaming Subscriptions, Apple",
        "ChatGPT's Image Gen Still Hasn't Fixed My Favorite Scheduled Task",
        "A Wearable That Measures Gases Can Forever Change Skin Care",
        "Think You Can't Game on a Work Laptop? Think Again",
        "You Don't Need ChatGPT Plus to Use Custom GPTs, Just to Make Them"
    ],
    "http://timesofindia.indiatimes.com/rssfeeds/2886714.cms": [
        "5 simple ancient Indian techniques that help remove laziness and increase daily productivity",
        "10 simple hacks to eat the right amount of protein everyday",
        "Teen addicted to vaping diagnosed with popcorn lung: Know what it is and what are the risks",
        "Man links middle-class upbringing to rising health issues in India",
        "10 daily habits that supercharge memory and boost brain power"
    ],
    "http://www.dnaindia.com/feeds/entertainment.xml": [
        "Pawan Kalyan's wife Anna Lezhneva shaves her head at Tirupati temple due to this reason, watch",
        "Salman Khan gets fresh death threat: 'Will blow up his car with bomb'",
        "'Woh jo chhoti Alia Bhatt thi...': Randeep Hooda clarifies his stance against Kangana Ranaut",
        "'I want to slap this boy': Huma Qureshi allegedly snaps at Irrfan Khan's son Babil Khan; know exactly what happened",
        "Amitabh Bachchan feels stuck at 49M, fans offer hilarious tips to grow followers: 'Rekha Ji k saath...'"
    ],
    "http://www.thenation.com/rss/articles": [
        "This Passover, We Must Examine the Indecent Betrayal by Our Own",
        "Mr. Douglass in the Room",
        "Bond Vigilantes Are Now the Unchallenged Kings Thanks to a Feckless Congress and Reckless Trump",
        "Taking Action",
        "9 Ways You Can Save the Internet Right Now"
    ],
    "http://www.medscape.com/cx/rssfeeds/2700.xml": [
        "Menstrual Cycle Affects Atopic Dermatitis Exacerbations",
        "Living Alone With Depression, Anxiety May Up Suicide Risk",
        "New ASCO Guidelines for Fertility Preservation in Cancer",
        "Social Media Aids Post-Op Care in Ectopia Lentis",
        "Investigational Drug Slows Decline in Early Huntington"
    ],
    "http://www.huffingtonpost.co.uk/feeds/verticals/uk-tech/index.xml": [
        "Here's Why Mickey Rourke Was Asked To Leave Celebrity Big Brother After A Week Of Controversies",
        "Pass The Damn Mic: Mainstream Media Keeps Getting Sex Work Wrong. Let Us Tell It Right",
        "Zelenskyy Urges Trump To Visit Ukraine After Dozens Killed By Russian Missile Attack",
        "Feeling Extra 'Meh' Lately? You Could Have This Condition",
        "Aimee Lou Wood Hits Out At 'Mean And Unfunny' Saturday Night Live Sketch"
    ],
    "http://www.theguardian.com/society/health/rss": [
        "‘It looks like I’ve gone 10 rounds with a boxer’: when hay fever becomes debilitating – and potentially deadly",
        "A new start after 60: I had a breakdown, the old me died – and I cried for the first time in my life",
        "Melanoma patients in England get fast-track access to cancer vaccine",
        "Trump is ‘fully fit’ and manages high cholesterol, says White House physician",
        "Who Wants Normal? The Disabled Girls’ Guide to Life by Frances Ryan review – countering the stereotypes"
    ],
    "http://www.theguardian.com/world/australian-politics/rss": [
        "A ‘diss track’ and Harry Dutton’s campaign cameo: the Coalition wants to show it ‘gets it’",
        "David Pocock says major parties lack the ‘courage’ to tackle housing crisis – as it happened",
        "Is this the worst most boring election campaign ever? Will voting make any difference? | First Dog on the Moon",
        "Dutton launches campaign in one of the election’s 'most important' battlegrounds – video",
        "Albanese launches campaign in Perth promising housing boost and tax deductions – video"
    ],
    "http://www.npr.org/rss/rss.php?id=1004": [
        "The 'world's coolest dictator' heads to the White House",
        "Morning news brief",
        "Ukrainian military officers attempt to dispel what they call myths of Russia's war",
        "How Trump's cuts to U.S. foreign aid have hobbled Syria's war crimes investigations",
        "The latest on the unfolding trade war with China"
    ],
    "http://feeds.news.com.au/rss/newslocal/dt_nlocal_sport_3214.xml": [
        "Finding the next football star",
        "Future stars bring home trophy",
        "Jesse James represents Australia",
        "Ironman legend Barry Rodgers dead at 74",
        "‘Everyone wants to be Suarez’"
    ],
    "http://www.theguardian.com/football/rss": [
        "Premier League: 10 talking points from the weekend’s action",
        "‘Closer to our dreams’: Van Dijk proud as Liverpool move 13 points clear",
        "Manchester United reach Women’s FA Cup final after Bizet and Clinton sink City",
        "Howe remains in hospital but Tindall sure Newcastle win has ‘lifted his spirits’",
        "Rangers’ Hagi delays Celtic’s Premiership title party with late leveller at Aberdeen"
    ],
    "http://www.mirror.co.uk/news/technology-science/rss.xml": [
        "'I was born without a uterus - now I'm pregnant with my second child after life-changing op'",
        "What happens when you donate your body after death - as Coronation Street star has 'no funeral'"
    ],
    "http://www.cbsnews.com/latest/rss/entertainment": [
        "Price of Admission: The battle over concert tickets",
        "F. Scott Fitzgerald's novel The Great Gatsby turns 100",
        "Grey's Anatomy star Eric Dane reveals he's been diagnosed with ALS",
        "Sony wins distribution rights to Wheel of Fortune, Jeopardy",
        "Cannes Film Festival unveils full list of 2025 competition titles"
    ],
    "http://www.theguardian.com/technology/games/rss": [
        "Blue Prince review – exploring this game may become your new obsession",
        "Rematch packs five-a-side football with sweaty thrills",
        "‘Parents left picking popcorn out of their hair’: the meme-soaked magic of A Minecraft Movie",
        "Bafta games awards 2025: full list of winners",
        "South of Midnight review – beautiful surfaces can’t hide thin gameplay"
    ],
    "http://feeds.nbcnews.com/feeds/health": [
        "One of the country's leading Alzheimer's projects is in jeopardy",
        "North Carolina flu-related deaths at all-time high",
        "RFK Jr. calls FDA a 'sock puppet' for industries in private speech to agency staff",
        "Map: Track the spread of measles in the U.S.",
        "Teddi Mellencamp posts before-and-after pics of last 4 months of cancer journey"
    ],
    "http://feeds.news.com.au/public/rss/2.0/ausit_exec_topstories_385.xml": [
        "Things just got personal again",
        "Mercedes steering health drive",
        "Glimpse of the future at Vegas",
        "Mirror tracks your wrinkles",
        "Samsung QLED takes on OLED"
    ],
    "http://rss.nzherald.co.nz/rss/xml/nzhrsscid_000000002.xml": [
        "South Korea’s ex-President attends first day of criminal trial over insurrection charges",
        "Trump’s military border surge takes shape along US-Mexico frontier",
        "Wisconsin teen charged with parents’ killings accused of plot to assassinate Trump",
        "A devastating trade spat with China shows few signs of abating",
        "Trump tariffs: Donald Trump downplays tariffs walk-back, says no country ‘off the hook’"
    ],
    "http://feeds.feedburner.com/FP_TopStories?format=xml": [
        "Making the most of market volatility: FP Video on the latest tariff tangents",
        "Posthaste: Stressed-out bond markets forced Trump into tariff U-turn. Could it happen again?",
        "Bond vigilantes are back raising the spectre of an American face-off",
        "Canada's next government will have to deal with an immigration system that has 'lost its brand'",
        "Energy on the ballot: The key to Canadian prosperity"
    ],
    "http://www.tmz.com/rss.xml": [
        "L.A. County D.A.'s Office Apologizes For Not Giving Menendez Family Crime Scene Photos Warning",
        "The Miz Gloats Over John Cena Heel Turn, I've Said It Forever",
        "Pennsylvania Man Arrested After Cops Say He Set Fire to Governor's Residence on Passover",
        "Former LSU Wide Receiver Kyren Lacy Suspected to Have Died From Self-Inflicted Gunshot Wound",
        "Patio Furniture and Outdoor Accessories for Summer on Amazon"
    ],
    "http://www.channel4.com/news/uk/rss": [
        "National Park bosses warn that funding cuts threaten conservation",
        "UK needs cheap energy to compete in market – expert",
        "‘Without steel this town dies’: Scunthorpe reacts to emergency bill",
        "British Steel nationalisation may be necessary, says David Davis",
        "MPs vote to save British Steel Scunthorpe blast furnaces"
    ],
    "http://feeds.feedburner.com/motherjones/Politics": [
        "The Intercept Discloses Top-Secret NSA Document on Russia Hacking Aimed at US Voting System",
        "Trump's Tweets Threaten His Travel Ban's Chances in Court",
        "Republican Congressman on Suspected Islamic Radicals: Kill Them All",
        "How Trump and His Allies Have Run With Russian Propaganda",
        "In 3 Months, 3 Immigrants Have Died at a Private Detention Center in California"
    ],
    "http://betakit.com/feed/": [
        "Inside Eric Migicovsky’s crazy journey to relaunch Pebble",
        "Wealthsimple’s acquihire, Shopify’s AI policy, and Nintendo’s Switch 2 confusion",
        "150 Canadian tech leaders urge federal parties to deliver plan for economic sovereignty in open letter",
        "Vancouver-based CO280 strikes 12-year carbon removal deal with Microsoft",
        "Corinex secures 42 million CAD to continue its European expansion"
    ],
    "http://time.com/newsfeed/feed/": [
        "The 20 Best Halloween TV Episodes of All Time",
        "Watch the Biggest Moments From King Charles III’s Coronation",
        "How the World Is Reacting to Shinzo Abe’s Death",
        "Sanctions Won’t Hurt Myanmar’s Brutal Leaders, Activists Say. Here’s What Could",
        "Here Are the Most ‘Attractive’ Global Cities. But Can They Keep Their Edge in the Post-Pandemic World?"
    ],
    "http://www.abc.net.au/news/feed/45924/rss.xml": [
        "Last-minute cancellation of desert racing event leaves riders furious",
        "Willie Rioli's 'hatred' of Hawthorn outlined in deleted social media post",
        "Gather Round gets its magic from recreating our childlike love of footy",
        "Galvin to depart Tigers after knocking back record contract extension",
        "One of sport's greatest final-day battles ends with McIlroy's name in lights"
    ],
    "http://metro.co.uk/sport/feed/": [
        "Gary Neville names biggest worry for Man Utd amid ‘desperate situation’",
        "Roy Keane makes Arsenal claim after Mohamed Salah signs new Liverpool deal",
        "Bryson Dechambeau reveals ruthless Rory McIlroy snub during Masters climax",
        "Alan Shearer tells Man Utd to replace two players after dismal Newcastle defeat",
        "Justin Rose reveals what he told Rory McIlroy after dramatic Masters play-off"
    ],
    "http://www.dnaindia.com/rss.xml": [
        "WTF: Transforming India's fitness landscape through tech, empowerment, and community",
        "Meet man who cracked, IIT, IIM, CAT, left high-paying job in Hong Kong to crack UPSC exam twice, became IPS then IAS officer with AIR...",
        "Man shows up 25 minutes early for job interview, gets rejected Viral post sparks debate",
        "BCCI slaps heavy fine on Delhi Capitals skipper Axar Patel for breaching this IPL code of conduct against Mumbai Indians",
        "Donald Trump calls Russia's strike on Sumy 'mistake', Zelenskyy says come see 'what Putin did,' urges US President to visit Ukraine"
    ],
    "http://www.pnas.org/rss/Feature_Article.xml": [
        "In This Issue",
        "Validating new limits for human thermoregulation",
        "Meltdown of trust in weakly governed economies",
        "Digital phenotyping using smartphones could help steer mental health treatment",
        "An unusual potassium conductance protects Caenorhabditis elegans pharyngeal muscle rhythms against environmental noise"
    ],
    "http://www.techrepublic.com/rssfeeds/blog/european-technology/": [
        "EU AI Rules Delay Tech Rollouts, But Civil Societies Say Safety Comes First",
        "Meta Unveils Llama 4 AI Series Featuring New Expert-Based Architecture",
        "Trump’s Tariffs: Will They Affect Your Tech Prices?",
        "North Korean Hackers Disguised as IT Workers Targeting UK, European Companies, Google Finds",
        "Apple Rolls Out iOS 18.4 With New Languages, Emojis & Apple Intelligence in the EU"
    ],
    "http://feeds.foxnews.com/foxnews/science": [
        "Wolf made famous in 'Game of Thrones' brought back from 12,500-year extinction, US company claims",
        "'Well-preserved' baby mammoth dating back to Ice Age dissected by scientists: photos",
        "Spectacular blue spiral light brightens up night sky, likely from Space X rocket",
        "Rare ‘Sharktopus’ – an octopus riding a shark – sighting caught on camera shared by scientists",
        "'Alien' encounter: ISS crew member plays joke as SpaceX team arrives"
    ],
    "http://feeds.feedburner.com/VGChartz": [
        "PS5 Price to Increase in Europe, Australia, and New Zealand",
        "Atomfall Tops 2 Million Players",
        "Action RPG Rise of Rebellion Launches April 21 for PC",
        "Action Pixel RPG HYKE: Northern Light(s) Launches This Summer for PS5, Switch, and PC",
        "Marathon Launches September 23 for PS5, Xbox Series X|S, and PC"
    ],
    "http://www.nytimes.com/services/xml/rss/nyt/Business.xml": [
        "China Halts Critical Rare Earth Exports as Trade War Intensifies",
        "Trump’s Tariff War Has Added Risk to U.S. Bonds, Long the Surest Bet in Global Finance",
        "A Devastating Trade Spat With China Shows Few Signs of Abating",
        "The Treasury Secretary Is Wrong About How Most Retirees See the Stock Market",
        "How Should You Invest in 529 College Savings Plans During Market Swings?"
    ],
    "http://www.theguardian.com/world/rss": [
        "More than 200 civilians killed as Sudan’s RSF attacks Darfur displacement camps",
        "Coup leader favourite in presidential race as Gabon goes to the polls",
        "Zimbabwe starts compensating white farmers 25 years after land seizures",
        "Weather tracker: early heatwave sweeps northern India",
        "Bobi Wine to run for president in Uganda’s 2026 election ‘if I am still alive and not in jail’"
    ],
    "http://feeds.bbci.co.uk/news/world/asia/rss.xml": [
        "MP barred from Hong Kong says it was to 'shut me up'",
        "Relatives charged after boy killed in Australia shooting accident",
        "Bangladesh issues arrest warrant for British MP Tulip Siddiq",
        "Hundreds of flights cancelled in China as strong winds hit capital",
        "Why Beijing is not backing down on tariffs"
    ],
    "http://www.standard.co.uk/news/rss": [
        "No evidence of ‘two-tier policing’ in summer riots response – MPs",
        "Warwick Davis’s family facing ‘difficult next chapter’ as wife’s inquest begins",
        "FTSE 100 surges and global markets rise after Trump’s tech tariff reprieve",
        "London travel news LIVE: IT issues affect Gatwick Express, Great Northern, Southern and Thameslink services",
        "Banksy-backed graffiti exhibition is shut after vandals daub 'f*** the King' on building owned by Crown Estate"
    ],
    "http://feeds.arstechnica.com/arstechnica/technology-lab": [
        "That groan you hear is users’ reaction to Recall going back into Windows",
        "Researcher uncovers dozens of sketchy Chrome extensions with 4 million installs",
        "Researchers concerned to find AI models misrepresenting their “reasoning” processes",
        "OpenAI helps spammers plaster 80,000 sites with messages that bypassed filters",
        "After months of user complaints, Anthropic debuts new 200/month AI plan"
    ],
    "http://www.newyorker.com/feed/news": [
        "What the World Learned from Donald Trump’s Tariff Week",
        "So You Want to Be a Dissident?",
        "Sayaka Murata’s Alien Eye",
        "The Dire Wolf Is Back",
        "Bluesky’s Quest to Build Nontoxic Social Media"
    ],
    "http://feeds.nature.com/nbt/rss/current": [
        "Hyperspectral reporters for long-distance and wide-area detection of gene expression in living bacteria",
        "Severus detects somatic structural variation and complex rearrangements in cancer genomes using long-read sequencing",
        "Improved RNA base editing with guide RNAs mimicking highly edited endogenous ADAR substrates",
        "Scalable spatial transcriptomics through computational array reconstruction",
        "Openness guides discovery"
    ],
    "http://www.theguardian.com/world/usa/rss": [
        "Tariff turmoil to continue as Trump warns nobody ‘off the hook’ amid smartphone exemption – US politics live",
        "Trump news at a glance: Deep confusion as Trump signals new tariffs on smartphones and computers",
        "Trump warns exemptions on smartphones, electronics will be short-lived, promises future tariffs",
        "Trump official who oversaw dismantling of USAID leaves US state department",
        "Six injured and 24 properties damaged in Texas house explosion, say officials"
    ],
    "http://globalnews.ca/canada/feed/": [
        "Edmonton Police Foundation hosts accessible Easter Egg hunt for visually impaired",
        "Poilievre targets Carney’s assets, promises tougher ethics rules",
        "Aggie Days marks 40 years of showcasing Canadian agriculture",
        "Liberals lead dips for 1st time in Canada election as Tories gain: poll",
        "The Auto Experience show returns to Edmonton as new vehicle tariff rules begin"
    ],
    "http://www.livemint.com/rss/consumer": [
        "Star, Zee join hands for TV distribution venture",
        "Deep-voiced Scotty McCreery wins &amp;8220;American Idol&amp;8221;",
        "Mumbai knock KKR out of IPL, set up qualifier-II against RCB",
        "A new spin to the spin theory",
        "IPL reschedule due to assembly elections"
    ],
    "http://globalnews.ca/tech/feed/": [
        "Filing your taxes? You might run into this CRA website ‘issue’",
        "Elon Musk says he plans to send his humanoid robots to Mars by 2026",
        "TikTok deal deadline extended after China pulled out over tariffs: reports",
        "Will TikTok be banned in U.S. again? Trump signals deal could be found",
        "What to know about Israeli spyware allegedly used by Ontario police"
    ],
    "http://economictimes.indiatimes.com/News/rssfeeds/1715249553.cms": [
        "'Your presence making Trump, Elon very nervous': At Coachella, Bernie Sanders' big message to crowd",
        "PS5 price hiked by Sony: Check new costs for affected markets",
        "How Election Commission came into being after Ambedkar brought amendment in Constituent Assembly",
        "Probe on after Ram Temple Trust receives threat email",
        "UK govt races against time to keep steel furnaces running"
    ],
    "http://timesofindia.indiatimes.com/rssfeeds/1081479906.cms": [
        "Kesari Chapter 2 to Odela 2: Movies releasing this week",
        "Will blow his car with a bomb: Salman gets a fresh death threat",
        "When Kareena got real about the catfight with Priyanka",
        "Off-beat jodis that graced the Koffee With Karan couch",
        "Randeep has NOT yet been approached for ‘Kick 2’"
    ],
    "http://rss.cnn.com/rss/edition_business.rss": [
        "Mexico ready to retaliate by hurting US farmers",
        "Will the next iPhone charge wirelessly?",
        "How 'America First' could turn into to 'India First'",
        "Swiss voters reject corporate tax overhaul",
        "Stocks hit record again. Is Trump the reason?"
    ],
    "http://feeds.bbci.co.uk/news/entertainment_and_arts/rss.xml": [
        "Katy Perry set for space with all-women crew on Blue Origin rocket",
        "Daryl Hannah shows husband Neil Young's softer side in new tour film",
        "Aimee Lou Wood calls SNL parody 'mean and unfunny'",
        "Upstairs Downstairs actress Jean Marsh dies aged 90",
        "Mario Vargas Llosa: Giant of Latin American literature, dies aged 89"
    ],
    "http://backofthebook.ca/feed/rss/": [
        "Fort McMurray: Shopping time",
        "From “Our Rape Blog”: Shooting the Moon",
        "Electoral reform: Hashtag fresh thinking",
        "The fish hotel",
        "Hatred on an Alberta golf course"
    ],
    "http://indianexpress.com/section/technology/feed/": [
        "Infosys co-founder Nandan Nilekani’s 5-point take on AI: hype, trust, enterprise, improving lives, and India",
        "HP OmniBook AI PCs are now up for pre-order, starting at Rs 78,999",
        "iPads will soon feel and function like Macs with Apple’s upcoming iPadOS overhaul: Report",
        "U.S. prepares to challenge Meta’s social media dominance",
        "Trump warns tariffs on smartphones will be back in ‘a month or two’"
    ],
    "http://www.sikhsiyasat.com/feed/": [
        "Issue of Sri Guru Granth Sahib Ji’s Saroop – Who Are The Real Culprits?",
        "How Gurbani Strengthened Me in Prison Cells: Exclusive Talk with Bhai Lal Singh Akalgarh",
        "Where Are Missing Saroops of Guru Granth Sahib: Analysing SGPC’s Reactions, Response & Actions",
        "Khalsa Jee Ke Bol Baaley : Guru Khalsa Panth – Dr. Gurpreet Singh During Discussion by Samvad",
        "Why Akal Takht Sahib Acting Jathedar Suddenly Announced to Honour 11 Sikh Personalities"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Business.xml": [
        "China Halts Critical Rare Earth Exports as Trade War Intensifies",
        "Trump’s Tariff War Has Added Risk to U.S. Bonds, Long the Surest Bet in Global Finance",
        "A Devastating Trade Spat With China Shows Few Signs of Abating",
        "The Treasury Secretary Is Wrong About How Most Retirees See the Stock Market",
        "How Should You Invest in 529 College Savings Plans During Market Swings?"
    ],
    "http://www.dailymail.co.uk/sport/index.rss": [
        "Rory McIlroy wins the Masters Northern Irishman edges Justin Rose in sudden death play-off - after blowing four-shot lead and missing putt to win it - to end 11-year major drought and complete career Grand Slam",
        "Justin Rose breaks silence in touching message to Rory McIlroy after heartbreaking Masters play-off defeat",
        "Rory McIlroy reveals the secret 'ironic' note he received from controversial jailed Masters champion Angel Cabrera ahead of Augusta victory",
        "Diego Maradona's psychiatrist, on trial over his death, jokingly claimed she had sex with football legend before he died as a 'therapy technique' as her WhatsApp messages are leaked",
        "Gary Neville reveals Manchester United's 'biggest problem' as he tears into his former side after their woeful 4-1 defeat by Newcastle"
    ],
    "http://feeds.feedburner.com/daily-star-Gaming": [
        "Copa City boss talks moving from career in football to building his dream game",
        "GTA 6 release window narrows as Mafia: The Old Country date leaks",
        "'I've played the new Nintendo Switch 2 – here's why you should pre-order it'",
        "How Elder Scrolls Online is shaking up a ten-year-old game in 2025",
        "How EA F1 25's My Team 2.0 brings the best of 'Drive To Survive' to the video game"
    ],
    "http://www.livescience.com/home/feed/site.xml": [
        "Scientific consensus shows race is a human invention, not biological reality",
        "The Earth's oceans used to be green — and could one day turn purple, scientists say",
        "What is the 'Eye of Horus' and why is it found in so many ancient Egyptian burials?",
        "Study reveals 'flawed argument' in debate over when plate tectonics began",
        "GPT-4.5 is the first AI model to pass an authentic Turing test, scientists say"
    ],
    "http://feeds.sbnation.com/rss/streams": [
        "Rory McIlroy breaks down in tears when defending caddy amid Masters title",
        "Paige Bueckers' new Unrivaled contract is a sobering reminder of WNBA salaries",
        "Chicago Sky and Minnesota Lynx make last-minute trade before WNBA draft",
        "‘Everything went wrong’ declares Max Verstappen after difficult Bahrain Grand Prix",
        "The ballad of Rory McIlroy: Masters champion and Grand Slam winner"
    ],
    "http://feeds.foxnews.com/foxnews/tech": [
        "5 mobile privacy terms you need to know to protect yourself",
        "AI humanoid robot learns to mimic human emotions and behavior",
        "Hackers find a way around built-in Windows protections",
        "Fox News AI Newsletter: White House record-keeping revamp",
        "Is this robot after our hospitality, retail and healthcare jobs?"
    ],
    "http://www.theage.com.au/rssheadlines/technology-news/article/rss.xml": [
        "There’s one way you can make your super more secure",
        "Introducing NEO Gamma - Another Step Closer to Home",
        "New Elder Scrolls Online expansion unveiled",
        "Did an AI chatbot help draft the US tariff policy?",
        "I paid an athlete 120 to send me a personalised video. You can, too"
    ],
    "http://feeds.nbcnews.com/feeds/worldnews": [
        "Mountains of trash and 'cat-size' rats as garbage workers strike in U.K.'s second-largest city",
        "At least 31 killed, 80 injured in Russian attack on Ukrainian city",
        "Israeli military strikes Gaza City's last functioning hospital",
        "Palestinians struggle to find water as clean sources become increasingly scarce in Gaza",
        "American teen was killed by Israeli soldiers in the West Bank. The U.S. has said little about it."
    ],
    "http://www.dailymail.co.uk/news/index.rss": [
        "'My girlfriend and I bought our first house together. It was a dream come true until we broke up'",
        "The brutal comment Princess Anne made about Mike Tindall's nose before he married Zara Phillips - and how the rugby pro got his own back years later",
        "Counter-terror police lead probe after Manchester Arena bomber's brother attacks prison guards with makeshift weapon and scalding oil - stabbing one in the neck, as critics condemn 'spectacular breach of security'",
        "Labour's net zero crusader Ed Miliband has a carbon footprint 12 times higher than the average Briton",
        "Ukraine could be carved up 'like Germany after World War Two' as part of US-backed peace deal in bid to end war - as Trump envoy meets with Putin at the same time Russian drones bring terror to Kyiv"
    ],
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_morenews_2794.xml": [
        "Motorcyclist dead in horror truck smash",
        "Two more agencies admit underquoting",
        "Hilarious TV vox pop gaffe",
        "Factories damaged in huge blaze",
        "How a dating site aids liver transplant success"
    ],
    "http://feeds.feedburner.com/TheAtlanticWire": [
        "The 'Only' Profession to 'Celebrate What It Means to Live a Life'",
        "Corinne Found the Perfect Way to Rebel Against The Bachelor",
        "Viola Davis's Urgent Call to 'Exhume the Ordinary'",
        "What Moonlight’s Win Says About the Oscars’ Future",
        "Five Ways of Seeing Five Minutes of 'Real People' at the Oscars"
    ],
    "http://feeds.harvardbusiness.org/harvardbusiness?format=xml": [
        "Should You Record That Meeting?",
        "How Contracts Can Help Firms Navigate the Uncertainty of Global Tariffs",
        "What Is the Office for Today?",
        "Understanding the Global Macroeconomic Impacts of Trump’s Tariffs",
        "How People Are Really Using Gen AI in 2025"
    ],
    "http://feeds.news.com.au/public/rss/2.0/bcm_top_stories_257.xml": [
        "Secret tape not the only talking point",
        "‘It’s still a prison. I feel like an animal’",
        "Shock toxic water findings",
        "Living in fear for my family",
        "Wild weather: ’It was like a tidal wave’"
    ],
    "http://feeds.webservice.techradar.com/rss/new": [
        "IT: Welcome to Derry – everything you need to know about the new Max horror series",
        "World Quantum Day – is the internet ready for the biggest security threat of all time?",
        "The state of AI in 2025: the road ahead",
        "This curling wand looks like a drill and I'm not sure if it's dumb or genius",
        "The Last of Us season 2 episode 1 is a purposefully paced, slightly dreary return for Pedro Pascal and Bella Ramsey's highly acclaimed HBO TV show"
    ],
    "http://www.techspot.com/backend.xml": [
        "Four years in, Meta has burned through 45 billion chasing its metaverse dream",
        "DaVinci Resolve offers a free pro-grade video editing platform",
        "Apple Maps web app is now available on all devices, including Android",
        "Use OBS Studio to livestream your gaming sessions",
        "Microsoft research shows AI coding tools fall short in key debugging tasks"
    ],
    "http://feeds.feedburner.com/TheAustralianBusNews?format=xml": [
        "Agent payouts to shift stock",
        "‘ALP’s NBN needs extra 10bn’",
        "Three in race for port sale",
        "Chinese airlines eye Qantas",
        "Fairfax-APN fears outlined"
    ],
    "http://www.livemint.com/rss/money": [
        "Is gold the GOAT asset of our lifetime?",
        "Lower EMIs ahead? Bank of India cuts home loan interest rates to 7.90 per cent",
        "Your Questions Answered: I want to invest in equity mutual funds. Please elaborate on Nifty Top 10 Equal Weight Index",
        "No loans, no problem: 5 proven ways to raise your credit score without debt",
        "Top 6 HDFC Bank credit cards offering complimentary lounge access in 2025"
    ],
    "http://www.dailymail.co.uk/tvshowbiz/articles.rss": [
        "David Bowie's daughter Lexi Jones insists she's 'not a copy' of her famous father in defiant message as she releases debut album",
        "Katy Perry reveals she's 'dreamt of going to space for 15 years' ahead of all-female mission as she gives BTS look inside Blue Origin rocket",
        "SNL 'apologise' to Aimee Lou Wood for 'mean' sketch that mocked her teeth as The White Lotus star continues to slam 'misogynistic' show",
        "Only Fools And Horses and Miami Vice star dies aged 78 after suffering from a 'long and painful illness'",
        "Would YOU wear this to a music festival? Aussie influencers turn heads in very revealing ensembles including fur skirts and belt bras at Coachella"
    ],
    "http://www.theregister.co.uk/science/headlines.atom": [
        "AI is making hyperscalers' sustainability pledges look more and more like a Hail Mary",
        "UK's answer to DARPA sprouts new ideas, like programmable plants",
        "Laser-cooled chips: Maybe coming soon-ish to a datacenter near you",
        "Canada OKs construction of first licensed teeny atomic reactor",
        "Boffins turn Moon dirt into glass for solar panels, eye future lunar base power"
    ],
    "http://www.gamesradar.com/all-platforms/news/rss/": [
        "A new kind of Infected was just introduced in The Last of Us season 2 episode 1",
        "Who is Eugene? The Last of Us season 2 premiere's off-screen casualty is actually a character you may have missed in the games",
        "We based our decisions on that selling 100,000 copies over 2 years, it did 200,000 copies in the first month: Indie publisher says planning small is key to its success",
        "Bungie thinks Marathon can coexist with games like Escape from Tarkov and help players get to the survival storytelling a little bit faster",
        "The Legend of Zelda: Breath of the Wild's divisive weapon durability is getting a workaround, but it's locked to the Nintendo Switch 2 Edition app"
    ],
    "http://www.thehindu.com/sci-tech/health/?service=rss": [
        "With GenomeIndia, population-scale genomics comes of age in India",
        "Nourish your liver, enrich your life: Simple ways to keep your liver in good shape",
        "Nizam’s Institute of Medical Sciences, Hyderabad leading the way in Parkinson’s treatment with deep brain stimulation",
        "As malaria cases fall, a look at Tamil Nadu’s strategies for elimination",
        "Will make Delhi a hub of medical tourism: Gupta"
    ],
    "http://feeds.news.com.au/public/rss/2.0/news_tech_506.xml": [
        "Galaxies collide in stunning picture",
        "Apple’s biggest product since the iPhone",
        "Rare ‘Morning Glory’ cloud dazzles Virgin flyers",
        "Towns ‘too hot to wear shorts’",
        "The gadget for the perfect coffee"
    ],
    "http://feeds.examiner.ie/ietopstories": [
        "Rory McIlroy: 'I’ve literally made my dreams come true'",
        "Amid an unhinged Masters madness, Rory McIlroy's heart of a champion beats loudest",
        "Apple submits plan for 300 new parking spaces in Cork City hub",
        "Sex File: My new partner says we're sexually incompatible",
        "Old Cork piggery rubble to be inspected after asbestos concern leads to cancelled GAA games"
    ],
    "http://toucharcade.com/feed/": [
        "The Reports of Our Death Have Been Mildly Exaggerated – The TouchArcade Show 612",
        "Nintendo Switch Part Deux – The TouchArcade Show 611",
        "Where Have We Been? – The TouchArcade Show 610",
        "Polar Express is SCARY – The TouchArcade Show 609",
        "Remember Payphones? – The TouchArcade Show 608"
    ],
    "http://feeds.feedburner.com/NewshourWorld": [
        "Xi Jinping celebrates China’s rising power — and his own",
        "The battle for Mosul is over, but this hidden ISIS danger could lurk for years",
        "As Rohingya refugees continue to flee from persecution, here’s how you can help",
        "Tillerson: ‘Heartbreaking’ reports of suffering in Myanmar",
        "Far-right groups gain ground in Sweden and Germany amid migrant influx"
    ],
    "http://www.esquire.com/blogs/culture/culture-rss": [
        "The Director of The Last of Us Knows Season 2 Is Daunting As Hell",
        "'The Last of Us' Season 2, Episode 1 Recap",
        "‘The Last of Us’ Season 2 Schedule: When Do New Episodes Come Out?",
        "How to Watch Warfare",
        "Your Friends and Neighbors Release Schedule: When Do New Episodes Come Out?"
    ],
    "http://www.economist.com/blogs/blighty/index.xml": [
        "Fingerspitzengefühl",
        "Pay takes a pounding",
        "The real taboo",
        "Current concern",
        "No reservations"
    ],
    "http://www.theguardian.com/science/rss": [
        "Lauren Sanchez’s all-female space flight is about to blast off – and will challenge Elon Musk’s SpaceX",
        "How and where to watch the Lyrid meteor shower",
        "What I’ve learned after 40 years as the Observer’s science editor",
        "Jawbone fossil builds richer image of ancient Denisovans",
        "Greek vase ‘looted’ in Italy removed from sale by London gallery"
    ],
    "http://www.computerweekly.com/rss/All-Computer-Weekly-content.xml": [
        "The role of small language models in enterprise AI",
        "What’s the government up to with digital verification services? ‘ID’ like to know",
        "Work-life balance biggest barrier for women in tech, says survey",
        "AI surveillance towers place migrants in ‘even greater jeopardy’",
        "More than 100 Horizon victims are challenging Post Office offers on complex claims"
    ],
    "http://www.cnet.com/rss/news/": [
        "Today's NYT Connections: Sports Edition Hints and Answers for April 14, 203",
        "Today's NYT Mini Crossword Answers for Monday, April 14",
        "Best Internet Providers in Mankato, Minnesota",
        "Today's NYT Strands Hints, Answers and Help for April 14, 407",
        "Today's NYT Connections Hints, Answers and Help for April 14, 673"
    ],
    "http://www.manchestereveningnews.co.uk/news/showbiz-news/rss.xml": [
        "Celebrity Big Brother's Mickey Rourke 'ashamed' of himself after 'trying hardest' to leave ITV show",
        "Great British Bake Off star 'in shock' as she announces pregnancy after 'lonely road'",
        "Michelle Keegan makes baby Palma name link in sweet tribute after husband Mark Wright explains real meaning",
        "Molly-Mae Hague leaves fans 'shocked' with cheeky snap after making major move with Tommy Fury",
        "Netflix's young Adolescence star branded 'intimidating' over new major role with streaming giant"
    ],
    "http://www.chron.com/rss/feed/AP-Technology-and-Science-266.php": [
        "Report: Baylor officials did nothing after being notified of assaults",
        "Historic domes of Hagia Sophia are renovated to protect the landmark from earthquakes",
        "Japanese leader says he hopes Osaka expo will help reunite a divided world",
        "Doctors remove pig kidney from an Alabama woman after a record 130 days",
        "Alert: An Alabama woman who lived with a pig kidney for a record 130 days had the organ removed and is back on dialysis"
    ],
    "http://www.theverge.com/rss/group/features/index.xml": [
        "The women who made America’s microchips and the children who paid for it",
        "How to disappear completely",
        "How one creator visualized AI by using very little AI",
        "Bad influence",
        "Can Philadelphia’s ballot counters outrun election lies?"
    ],
    "http://www.standard.co.uk/news/politics/rss": [
        "No evidence of ‘two-tier policing’ in summer riots response – MPs",
        "Trump condemns 'terrible' Russian missile attack on Sumy as Zelensky invites US President to Ukraine",
        "Tulip Siddiq hits out at 'politically motivated' claims as Bangladesh issues arrest warrant for Labour MP",
        "Campaigners seek legal action against those who failed to tackle grooming gangs",
        "Israel’s latest strike on Gaza hospital is ‘appalling’, says Archbishop of York"
    ],
    "http://www.nytimes.com/services/xml/rss/nyt/InternationalBusiness.xml": [
        "China Halts Critical Rare Earth Exports as Trade War Intensifies",
        "Trump’s Tariff War Has Added Risk to U.S. Bonds, Long the Surest Bet in Global Finance",
        "A Devastating Trade Spat With China Shows Few Signs of Abating",
        "The Treasury Secretary Is Wrong About How Most Retirees See the Stock Market",
        "How Should You Invest in 529 College Savings Plans During Market Swings?"
    ],
    "http://www.livemint.com/rss/industry": [
        "Bank holiday today: Are banks closed on April 14 for Ambedkar Jayanti 2025? Check schedule here",
        "Tight liquidity forced lenders to ramp up short-term borrowing in FY25",
        "When ads start to preach, audiences start to scroll",
        "Ad review: HDFC Mutual Fund’s new campaign finds value in everyday choices",
        "Genetics can spike Indians' cholesterol, but relief may be at hand"
    ],
    "http://www.express.co.uk/posts/rss/11/health": [
        "GP lists five bowel cancer symptoms that are 'mistaken for other conditions'",
        "Doctor explains why your cough won't go away - and how to treat it",
        "The lesser-known symptoms on the face that could be a sign of high cholesterol",
        "Crisis in India as country warned 450m will soon be too fat - 'only China is worse'",
        "I was so fat I got stuck in football turnstiles - now I've lost 17 stone"
    ],
    "http://www.theguardian.com/tv-and-radio/entertainment/rss": [
        "‘We grew up among drugs and violence. Dance kept us focused’: Oti Mabuse on Strictly, survival and self-belief",
        "‘I’m like the TV Lorraine - just more sweary’: at home with the queen of the small screen",
        "Eddie Kadi: ‘People think I’m always ready to crack jokes. If you’re a doctor, I don’t ask you to operate on me’",
        "UK creative industries set behaviour standards after Strictly and MasterChef rows",
        "Wynne Evans to ‘take time out’ from Strictly Come Dancing live tour"
    ],
    "http://www.smh.com.au/rssheadlines/technology-news/article/rss.xml": [
        "There’s one way you can make your super more secure",
        "Introducing NEO Gamma - Another Step Closer to Home",
        "New Elder Scrolls Online expansion unveiled",
        "Did an AI chatbot help draft the US tariff policy?",
        "Have we reached the point of ‘peak connectivity’? We’re just getting started"
    ],
    "http://feeds.newscientist.com/science-news": [
        "'Quantum Darwinism' may explain why we live in a shared reality",
        "What the surprising lives of solitary animals reveal about us",
        "How to spot Haumea, one of the solar system's strangest objects",
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind"
    ],
    "http://feeds.feedburner.com/EtsBreakingNews": [
        "Best Shampoo For Colored Hair",
        "Karl Soderlund, Sally Jessy Raphael’s Husband, Dead at 90",
        "The Best Diaper Bag That Is Chic and Functional -- LeSportsac, Herschel, Rebecca Minkoff and More",
        "'AGT': Daredevil Annaliese Nock Terrifies Judges With Wheel of Death Stunt",
        "Justin Hartley's Ex-Wife and Daughter Support Him As Chrishell Stause Split Plays Out on 'Selling Sunset'"
    ],
    "http://feeds.bbci.co.uk/news/science_and_environment/rss.xml": [
        "Katy Perry set for space with all-women crew on Blue Origin rocket",
        "Global breakthrough to tackle shipping emissions",
        "What goes on inside toddlers' brains? A pioneering project is trying to find out",
        "Starlings disappearing from gardens, says RSPB",
        "UK investigating claims green fuel contains virgin palm oil"
    ],
    "http://rss.cnn.com/rss/cnn_health.rss": [
        "RSV hospitalization rate for seniors is 10 times higher than usual for this point in the season",
        "Covid-19 boosters could keep thousands of kids out of hospitals, but uptake remains low",
        "Experimental therapy gantenerumab fails to slow or improve Alzheimer's memory loss in clinical trials",
        "US gets D+ grade for rising preterm birth rates, new report finds",
        "Desperate for heart surgery for their baby, a family feels the effects of pediatric hospital shortages"
    ],
    "http://www.mirror.co.uk/sport/rss.xml": [
        "Who's in Rory McIlroy's inner circle? Caddie Harry Diamond, wife Erica Stoll, 'the Mac Pack'",
        "Gary Neville tears into Man Utd flops and tells Ruben Amorim his biggest problem",
        "Rory McIlroy's prize money from Masters boosts huge net worth – but he loses massive chunk",
        "Rory McIlroy calls out Tiger Woods and three other golf icons for 'tough' comments about him",
        "Rory McIlroy's staggering investments including billion pound brand and STD test providers"
    ],
    "https://www.newscientist.com/feed/home": [
        "'Quantum Darwinism' may explain why we live in a shared reality",
        "What the surprising lives of solitary animals reveal about us",
        "How to spot Haumea, one of the solar system's strangest objects",
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind"
    ],
    "http://www.standard.co.uk/lifestyle/rss": [
        "How to come off Ozempic without gaining weight — the expert's guide",
        "Horoscope today: Your daily guide for Monday, April 14, 2025",
        "A ballet retreat in the Maldives changed my outlook — here's why everyone should do a hobby holiday",
        "Mickey Rourke controversy explained — why was he kicked off Celebrity Big Brother?"
    ],
    "http://rss.cnn.com/rss/cnn_topstories.rss": [
        "Some on-air claims about Dominion Voting Systems were false, Fox News acknowledges in statement after deal is announced",
        "Dominion still has pending lawsuits against election deniers such as Rudy Giuliani and Sidney Powell",
        "Here are the 20 specific Fox broadcasts and tweets Dominion says were defamatory",
        "Judge in Fox News-Dominion defamation trial: 'The parties have resolved their case'",
        "'Difficult to say with a straight face': Tapper reacts to Fox News' statement on settlement"
    ],
    "http://www.thehindu.com/sci-tech/?service=rss": [
        "Motorola Edge 60 Fusion Review | A phone that ticks nearly all the boxes",
        "Apple shares lead tech higher after tariff exemptions",
        "Studied over 21 years, new frog species ‘Leptobrachium aryatium’ named after Assam college",
        "With GenomeIndia, population-scale genomics comes of age in India",
        "Nourish your liver, enrich your life: Simple ways to keep your liver in good shape"
    ],
    "http://www.theguardian.com/uk/environment/rss": [
        "‘It looks like I’ve gone 10 rounds with a boxer’: when hay fever becomes debilitating – and potentially deadly",
        "BP dropped its green pledges and turned back to oil. Now the price of crude has collapsed",
        "‘They called it black gold’: but should cuttlefish be on our menus?",
        "Country diary: The slow-motion magic of watching a mallard build its nest | Susie White",
        "‘Unprecedented’ sightings of Asian hornets raise fears for UK bees"
    ],
    "http://www.abc.net.au/news/feed/51892/rss.xml": [
        "Rival housing policies to dominate debate between Chalmers and Taylor",
        "Trump to impose new chip tariffs, including on electronics exempted days ago",
        "World-first certification for once 'severely overfished' Australian tuna",
        "Dutton says he wants house prices to 'steadily increase' in Australia",
        "Bosses at trouble-plagued Qld power station step down after explosion"
    ],
    "http://feeds.nbcnews.com/feeds/topstories": [
        "Billionaire investor Ray Dalio is worried about 'something worse than recession’: Full interview",
        "Tariffs on imported semiconductor chips coming soon, Trump says",
        "Peter Navarro says ‘Elon and I are great’ after Musk calls him ‘dumber than a sack of bricks’",
        "Bond market moves raise fears of growing bets against America",
        "Arrest made after arson at PA governor's home"
    ],
    "http://feeds2.feedburner.com/time/scienceandhealth": [
        "Breaking the Gender Barrier May Be New for Space Tourism—but Not for NASA Missions",
        "What to Know About April’s ‘Micromoon’",
        "Yes, Climate Change Really is Making Your Hay Fever Worse",
        "The Science Behind the Return of the Dire Wolf",
        "The Return of the Dire Wolf"
    ],
    "http://feeds.feedburner.com/BreitbartFeed": [
        "Pennsylvania Gov. Josh Shapiro Reveals Arsonist 'Set Fire' to Governor's Mansion",
        "Federal Judge Orders USDA to Unfreeze Funding to Maine as Trans Athletes Dispute Continues",
        "DOE Begins Process of Terminating Maine’s Federal K-12 Funding as State Allows Trans Athletes on Female Teams",
        "Poll: Majority of Voters Approve of Shutting Down Federal Department of Education",
        "Elizabeth Warren: Congress Has to Take Tariff Authority Away from Trump"
    ],
    "http://feeds.feedburner.com/Rpgcast": [
        "RPG Cast – Episode 764: “Cool Ranch Switch Cartridges”",
        "RPG Cast – Episode 763: “Dollar Store King’s Field”",
        "RPG Cast – Episode 762: “Cautiously Pessimistic”",
        "RPG Cast – Episode 761: “It’s Chaos Legion, I Swear”",
        "RPG Cast – Episode 760: “Outdoor Gods”"
    ],
    "http://www.chartattack.com/feed/": [
        "How Your Gut Bacteria Affect Weight Loss (and What to Do About It)",
        "Step-by-Step Guide to Buying Your First Property in Malta as a Foreigner",
        "How to Introduce Adult Toys Into Your Relationship Without Awkwardness",
        "What Men Like During Intimate Moments – The Subtle Moves That Drive Them Wild",
        "Can Adult Toys Help Improve Your Sex Life Without Overstepping Boundaries?"
    ],
    "http://www.menshealth.com/events-promotions/washpofeed": [
        "Why The Last of Us Put Joel In Therapy (and the Video Game Didn't)",
        "The Last Of Us Brings Pedro Pascal and Bella Ramsey Back for 7 Episodes of Post-Apocalyptic Drama",
        "The Evolution of Ab Training",
        "The Brutal True Story Behind Warfare",
        "OOFOS Ooaah Sport Slide Vs. Hoka Restore TC: Which Recovery Shoe Is Better For You?"
    ],
    "http://www.cbssports.com/partners/feeds/rss/home_news": [
        "2025 WNBA Draft: Biggest needs, possible fits for all 13 teams; Valkyries looking for a bit of everything",
        "An Augusta National masterpiece: History, epic moments, all-time champion make 2025 Masters one to remember",
        "Sky-Lynx trade grades: Chicago acquires No. 11 pick in WNBA draft, Minnesota gets future first-rounder",
        "Rory McIlroy winning the Masters had to be this tortuous; it was never going to happen any other way",
        "Fantasy Baseball Week 4 Preview: Top 10 sleeper hitters include Michael Conforto, Jacob Wilson"
    ],
    "http://feeds.bbci.co.uk/news/world/rss.xml": [
        "Zelensky urges Trump to visit Ukraine ahead of deal with Russia",
        "Ecuador's President Daniel Noboa wins re-election",
        "Man arrested after suspected arson attack at Pennsylvania governor's home",
        "Israeli air strike destroys part of last fully functional hospital in Gaza City",
        "White Lotus' Aimee Lou Wood calls SNL parody 'mean and unfunny'"
    ],
    "https://news.google.com/news/feeds?cf=all&ned=in&hl=en&topic=b&output=rss": [
        "'His wallet is full': PNB scam whistleblower on Mehul Choksi's India extradition after arrest in Belgium - Times of India",
        "Are banks open on April 14, Ambedkar Jayanti 2025? Full bank holiday list for the month - Hindustan Times",
        "17 companies of CAPF deployed in Murshidabad, situation under control says West Bengal DGP - The Hindu",
        "Pawan Kalyan Returns With Son After Singapore School Fire; Imran Khan Breaks Silence On Divorce From Ex-Wif - News18",
        "26/11 Mumbai Terror Attacks: Tahawwur Rana Singing Before NIA, Pakistan Exposed? - News18"
    ],
    "http://feeds.newscientist.com/health": [
        "'Quantum Darwinism' may explain why we live in a shared reality",
        "What the surprising lives of solitary animals reveal about us",
        "How to spot Haumea, one of the solar system's strangest objects",
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind"
    ],
    "http://www.medpagetoday.com/rss/Headlines.xml": [
        "Pridopidine Shows Promise in Subgroup of Huntington's Patients",
        "'It Will Cost Lives': What We Heard This Week",
        "Trump:'Fully Fit' to serve as Commander in Chief, Doctor Says",
        "Estimated GFR Equation Matters When Dosing Chemotherapy in Cancer Patients",
        "Removing Restraints: Reclaiming Patient Dignity in Delirium Care"
    ],
    "http://www.thehindu.com/entertainment/?service=rss": [
        "‘STR 49’: Sai Abhyankkar to compose music for Silambarasan and Ramkumar Balakrishnan’s film",
        "Anupam Kher’s ‘Tanvi the Great’ set to debut at Cannes",
        "‘Good Bad Ugly’ day 4 box office collection: Ajith Kumar-starrer earns 150 crore worldwide",
        "Veteran Kannada comedy actor Bank Janardhan passes away",
        "Kareena Kapoor Khan, Prithviraj Sukumaran to star in Meghna Gulzar’s crime-drama ‘Daayra’"
    ],
    "http://www.journaldemontreal.com/jm/sante/rss.xml": [
        "Voici pourquoi il faut manger des champignons pour vivre plus longtemps",
        "Testés: voici les meilleurs biscuits à l’érable sur les tablettes de votre épicerie",
        "Voici les meilleurs aliments à consommer pour éviter les crampes musculaires",
        "Elle quitte les réseaux sociaux pour réfléchir... et perd 47 livres",
        "Voici pourquoi une bonne nuit de sommeil prévient l'obésité et favorise la perte de poids"
    ],
    "http://feeds.feedburner.com/the-edge-susu": [
        "Nostalgic News: Chappell Roan’s ‘Pink Pony Club’ turns 5",
        "Why Helen Hardt’s ‘The Blood Bond Saga’ Should Have a TV Adaptation",
        "Review: SUSU Theatre Group’s ‘Macbeth’ @ The Annex"
    ],
    "http://feeds.nbcnews.com/feeds/todayentertainment": [
        "'The Last of Us' imagines a pandemic caused by fungi. Could it happen?",
        "Aimee Lou Wood reacts to ‘SNL’ impression of her ‘White Lotus’ character: ‘mean and unfunny’",
        "Jon Hamm is that one employee that always overshares in 'Icebreaker' 'SNL' sketch",
        "Jon Hamm has some 'crazy ideas' in spot-on 'The White Lotus' 'SNL' sketch",
        "Bowen Yang sums up the reality of working at ‘SNL’ in 9 words"
    ],
    "http://www.theguardian.com/us/lifeandstyle/rss": [
        "A new start after 60: I had a breakdown, the old me died – and I cried for the first time in my life",
        "From US tariffs to no more Netflix: Edith Pritchett’s week in Venn diagrams – cartoon",
        "‘I’ve pulled myself out of a very dark abyss’: Garbage’s Shirley Manson on depression, sexism, dodgy hips and happiness",
        "The kindness of strangers: I was ready to leave the theatre in disgrace when a gentle usher made me an offer",
        "Do all wind turbines rotate in the same direction? If so, why?"
    ],
    "http://feeds.feedburner.com/AtlanticNational": [
        "Trump’s Trade War Unleashes Global Uncertainty",
        "Trump’s Preoccupation With Tariffs",
        "The Consequences of the Signal Breach",
        "What Does ‘Constitutional Crisis’ Mean?",
        "Trump’s Unpredictability With Allies and Adversaries"
    ],
    "http://variety.com/feed/": [
        "Post Malone Closes Coachella With Headlining Set Blending Hip-Hop and Country",
        "Korea Box Office: ‘The Match’ Dominates Again as ‘The Amateur’ Debuts at No. 2",
        "China Box Office: ‘We Girls’ Claims Top Spot as ‘A Minecraft Movie’ and ‘Ne Zha 2’ Trail Closely",
        "Vietnamese Box Office Smash ‘The Ancestral Home’ Sets North American Release (EXCLUSIVE)",
        "Anupam Kher’s ‘Tanvi the Great’ Set for Global Debut at Cannes Market (EXCLUSIVE)"
    ],
    "http://www.thehindubusinessline.com/news/?service=rss": [
        "AICTE sets up panel to embed AI across disciplines, eyes 4 crore students",
        "Ambedkar: A revolutionary's vision for equality continues to inspire and challenge today's India",
        "Fire breaks out at chemical unit in Bharuch",
        "Japan's Nikkei rises as iPhone-related stocks jump",
        "Telangana to launch Bhu Bharati portal today"
    ],
    "http://feeds.skynews.com/feeds/rss/technology.xml": [
        "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
        "Company started by 'two blokes in a Cardiff garage' is about to launch a game-changing space factory",
        "Erin Brockovich: 'My chiropractor saw mud on my stiletto - I said, I've been collecting dead frogs'",
        "From AI Barbie to 'Ghiblification' - how ChatGPT's image generator put 'insane' pressure on OpenAI",
        "Nintendo Switch 2 launches straight into Trump's trade war"
    ],
    "http://feeds2.feedburner.com/bit-tech/all": [
        "The end",
        "Intel Core i9-12900K claimed to be the World's Best Gaming Processor",
        "Inscryption Review",
        "PrimeStation Pulsar fanless workstation PC unveiled",
        "Shadow of the Tomb Raider gets Denuvo removal boost"
    ],
    "http://feeds.feedburner.com/DiscoverTopStories": [
        "5 of the Biggest Extraterrestrial Impacts That Moved Oceans and Made Moons",
        "Watch How Male Fiddler Crabs Beat Sand Like a Drum to Attract Mates",
        "Sleep’s Surprising Role in Strengthening Long-Term Memory",
        "A Black Hole Awakens in a Distant Galaxy, Producing X-Ray Bursts",
        "The Stunning Lyrid Meteor Shower 2025 Peaks This Month — Here's What to Know"
    ],
    "http://qz.com/feed": [
        "Netflix, Goldman Sachs, Citigroup, and more stocks to watch this week",
        "The 8 most chaotic airports in America",
        "Apple, Nvidia, and Microsoft can 'breathe a huge sigh of relief' after Trump's China tariff exemptions",
        "Apple's 'complete disaster,' Microsoft's tariff uncertainty, and Amazon's vibe: Tech news roundup",
        "Tesla's moment of truth, Trump Media stock spikes, and Warren Buffett wins again: Markets news roundup"
    ],
    "http://www.nytimes.com/services/xml/rss/nyt/Health.xml": [
        "The Many Ways Kennedy Is Already Undermining Vaccines",
        "Experts Doubt Kennedy’s Timetable for Finding the Cause of Autism",
        "RFK Jr. Accuses FDA of Drug Industry Influence That Barred Alternative Remedies",
        "Pig Kidney Removed From Alabama Woman After Organ Rejection",
        "Trump Administration Delays Plan to Limit Pricey Bandages"
    ],
    "http://feeds.foxnews.com/foxnews/politics": [
        "Trump takes swipe at Biden, says US will support Somalia against Houthis",
        "Trump vows nobody getting 'off the hook' for 'unfair' trade balances, says there was no tariff 'exception'",
        "Results of President Trump's physical released, here's what they say",
        "Video of Trump allegedly 'snubbing' actress Cheryl Hines spreads like wildfire but doesn't show full picture",
        "SCOOP: Arizona to begin removing as many as 50K noncitizens from voter rolls following lawsuit"
    ],
    "http://time.com/tech/feed/": [
        "Trump Wants Tariffs to Bring Back U.S. Jobs. They Might Speed Up AI Automation Instead",
        "How Rare Earths Are Playing a Pivotal Role in the U.S.-China Trade War",
        "How Trump’s Tariffs Could Make AI Development More Expensive",
        "How Crypto Legislation Could Hand Big Tech the Keys to Banking",
        "What Are Stablecoins?"
    ],
    "http://www.thehindu.com/sci-tech/technology/?service=rss": [
        "Motorola Edge 60 Fusion Review | A phone that ticks nearly all the boxes",
        "Apple shares lead tech higher after tariff exemptions",
        "Motorola Edge 60 Stylus launches tomorrow in India. Details",
        "Netflix testing OpenAI-powered search tool: Report",
        "YouTube launches new AI tool that generates background music for creators"
    ],
    "http://www.newyorker.com/feed/culture": [
        "Jeff Bridges Is Digging It",
        "Can Reality TV Redeem Jake and Logan Paul?",
        "TikTok and the Retreat from Technological Globalization",
        "Will A.I. Save the News?",
        "The Trump Show Comes to the Kennedy Center"
    ],
    "http://www.npr.org/rss/rss.php?id=1128": [
        "Move over Paleo diet, it's Dinosaur Time, a TikTok trend all about devouring veggies",
        "When adults reject vaccines, children pay the price",
        "Here's how to retrain your brain to crave movement more than screen time",
        "Soccer-loving 'grannies' go for the GOOOOAAAALLLL in their version of the World Cup",
        "How climate change is making hay fever more miserable"
    ],
    "http://www.livemint.com/rss/companies": [
        "BofA Seeks to Rebuild India Investment Banking Team Post Probe, Resignations",
        "MoEngage taps Avendus to raise up to 180 million from new and existing backers",
        "India preparing to ship 40,000 tonnes of shrimp to US after tariff pause",
        "Delhi Customer, living in 50-crore bungalow, tries to cheat company of 5,000; founder turns her into a regular client",
        "Indigo flights to shift to T1 from tomorrow: What passengers should know about terminals, departures, schedule, and more"
    ],
    "http://syndication.eonline.com/syndication/feeds/rssfeeds/": [
        "How Georgina Chapman Found Love Again With Adrien Brody",
        "What Katy Perry and More Stars Have Said About Going to Space",
        "You'll Love Our The Last of Us Gift Guide for a Long Long Time",
        "Rami Malek and Emma Corrin Break Up After 2 Years of Dating",
        "Khloe Kardashian's Daughter True Celebrates 7th Birthday at Neon Party"
    ],
    "http://feeds.bbci.co.uk/news/technology/rss.xml#": [
        "Landmark antitrust trial could force Zuckerberg to sell Instagram",
        "Everyone's jumping on the AI doll trend - but what are the concerns?",
        "Microsoft rolls out AI screenshot tool dubbed 'privacy nightmare'",
        "OpenAI sues Elon Musk claiming 'bad-faith tactics'",
        "Will iPhones cost more because of Trump's tariffs on China?"
    ],
    "http://feeds.feedburner.com/daily-express-finance-news": [
        "Join our free WhatsApp Money community to get the latest tips and advice to your phone",
        "HSBC to roll out biggest banking app overhaul in 13 years - some are already trying it",
        "Martin Lewis explains when using air fryer is more expensive than an oven",
        "Every UK worker sent letter with code to check if you're owed cash",
        "HMRC cuts tax-free Personal Allowance to £11,000 with one tax code change"
    ],
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_technology_2790.xml": [
        "Galaxies collide in stunning picture",
        "Apple’s biggest product since the iPhone",
        "Rare ‘Morning Glory’ cloud dazzles Virgin flyers",
        "Towns ‘too hot to wear shorts’",
        "The gadget for the perfect coffee"
    ],
    "http://feeds.feedburner.com/nymag/vulture": [
        "Every Single Thing That Happened at Coachella 2025",
        "The Baldwins Almost Succeeded",
        "The Righteous Gemstones Recap: Love Isn’t Always On Time",
        "The Last of Us Season-Premiere Recap: Welcome to Wyoming",
        "Dark Winds Recap: Gods and Monsters"
    ],
    "http://www.dailymail.co.uk/health/index.rss": [
        "New Ozempic? Scientists develop 'expanding' weight loss pill that slashes more fat than blockbuster drug but DOESN'T make you feel sick",
        "We tried a new Ozempic trick after piling on the pounds... and are stunned by our transformation",
        "I'm a colon cancer surgeon - I banned two bathroom cabinet staples to protect my family from the disease",
        "Flight attendant reveals the food and drink items you should NEVER order on a plane due to hidden health risks",
        "Paul was diagnosed with bowel cancer at 39... the only sign was a problem millions suffer from every day"
    ],
    "http://www.watoday.com.au/rssheadlines/technology-news/article/rss.xml": [
        "There’s one way you can make your super more secure",
        "Introducing NEO Gamma - Another Step Closer to Home",
        "New Elder Scrolls Online expansion unveiled",
        "Did an AI chatbot help draft the US tariff policy?",
        "I paid an athlete 120 to send me a personalised video. You can, too"
    ],
    "http://time.com/health/feed/": [
        "Ex-FDA Official Is Worried About the FDA’s New “Anti-Vaccine Tone”",
        "The Two Words to Say When Someone Comments on Your Hygiene",
        "Title X Freeze Widely Threatens Health Care Access",
        "Invasive Strep Infections Are Rising in the U.S.",
        "Can Eating Certain Foods Really Help You Get Pregnant?"
    ],
    "http://feeds.slate.com/slate-101526": [
        "My Daughter Hates Being Coached",
        "The Last of Us’ New Season Presents an Even Greater Threat Than the Infected",
        "It Looked Like Heartbreak Was Inevitable. Then Came the Moment That Will Go Down in History.",
        "Ever Wonder How Generations Get Their Names? One Man Is to Blame—but Not Everyone’s Happy About It.",
        "My Daughter Finally Gave the Neighbor’s Kid a Taste of His Own Medicine. But She Might’ve Gone Too Far."
    ],
    "http://www.polygon.com/rss/index.xml": [
        "Please, The Last of Us, don’t ruin Jackson",
        "The Last of Us’ Stalkers may be even smarter than in the video game",
        "League’s current main plot moves forward toward Ionia and the deadly Darkin",
        "These 7 video games have amazing ASMR",
        "5 movies about revolution to watch while you wait for Andor season 2"
    ],
    "http://www.cnet.com/rss/android-update/": [
        "Today's NYT Connections: Sports Edition Hints and Answers for April 14, 203",
        "Today's NYT Mini Crossword Answers for Monday, April 14",
        "Best Internet Providers in Mankato, Minnesota",
        "Today's NYT Strands Hints, Answers and Help for April 14, 407",
        "Today's NYT Connections Hints, Answers and Help for April 14, 673"
    ],
    "http://economictimes.indiatimes.com/rssfeedsdefault.cms": [
        "PL Capital predicts Nifty bull case target at 27,590, flags 23 SMID, largecap stocks as high conviction picks",
        "Rethinking reserve strategies: Will Central Banks dump the dollar?",
        "Peter Lynch’s 4 rules from One Up on Wall Street to survive market panic",
        "Info Edge announces 1:5 stock split, May 7 set as record date",
        "Tariff pause for India offers relief, yet China’s export spillover remains a risk: Jigar Mistry"
    ],
    "http://feeds.feedburner.com/NationPBSNewsHour": [
        "News Wrap: Sessions insists he didn’t lie about Russian contacts to Senate",
        "Escaping Harvey Weinstein was a ‘cat-and-mouse game,’ says Katherine Kendall",
        "WATCH: NFL commissioner says players ‘should stand for the national anthem’",
        "Column: For black athletes, wealth doesn’t equal freedom",
        "Twitter chat: How the gun control debate mirrors larger issues of partisanship in America"
    ],
    "http://rss.csmonitor.com/feeds/science": [
        "The world’s bananas are at risk. A volcanic island might protect them.",
        "NASA astronauts’ return is near. Their long, unlikely trip puts focus on resilience.",
        "US science funding was a bipartisan priority. Now it’s a target of federal cuts.",
        "China’s DeepSeek impresses. But is a ‘fast follow’ good enough in AI?",
        "Nvidia unveils new products from supercharged graphics chip to AI that trains robots"
    ],
    "http://www.bollywoodnewsworld.com/feed": [
        "Global Getaways: Explore the World and Have the Time of Your Life",
        "How a Family Calendar Can Simplify Your Life and Keep Everyone Organized",
        "Assessment of Land Condition: A Critical Step in Identifying Contaminated Sites",
        "Paris Pleasures: Leisurely Explorations",
        "Fashion Tips for Styling Legs and Hiding Cankles Effectively"
    ],
    "http://www.standard.co.uk/showbiz/rss": [
        "Katy Perry gives fans rare look inside Blue Origin rocket hours before historic space mission",
        "Aimee Lou Wood: The White Lotus star condemns ‘mean’ Saturday Night Live sketch mocking her teeth",
        "Mickey Rourke says he tried his ‘hardest’ to leave Celebrity Big Brother",
        "‘Sexual language’ among reasons Mickey Rourke booted from Celebrity Big Brother",
        "Dazed and Confused actor Nicky Katt dies aged 54"
    ],
    "http://www.giantbomb.com/feeds/mashup/": [
        "The Community Spotlight 2025.04.12",
        "265 - Mr. Lasagna",
        "Unprofessional Fridays: Supermarket Together",
        "Marvel Rivals Season 2",
        "GameBreaking News 04/11/25"
    ],
    "http://deadline.com/feed/": [
        "DogTV Unleashes FAST Channel; ZEE5 Global’s First Kannada Series; NBCU Ups Caroline Cleland In APAC – Global Briefs",
        "Kedoo Entertainment Launches Super Toons App, Strikes FAST Channel Deals & Buys Kids Series ‘Gormiti’",
        "“Cruel” L.A. DA Should Be Removed From Menendez Brothers’ Case, Family Demands; Aunt In ICU After Photos Of Shotgun Killed Father Displayed In Court",
        "Danny Dyer Developing Play About His Friendship With “Mentor” Harold Pinter",
        "Mélanie Laurent Signs Up For ‘Fauda’ Season 5"
    ],
    "http://www.entertainmentnews.co.uk/feed/": [
        "Digital jukebox network AMI Entertainment signs with 7digital, a Songtradr company, as a client",
        "7digital, a Songtradr Company, Powers the Launch of Popular Music on Canva",
        "7digital and Pex partner to create opportunities for rightsholders and UGC platforms",
        "7digital announces support of Stationhead live commerce feature",
        "Pinterest strikes deals with Warner, Merlin, BMG and 7digital to expand music experience on the platform"
    ],
    "http://www.dailyrecord.co.uk/lifestyle/health-fitness/rss.xml": [
        "Women credit 'gorgeous' protein shakes for their 'better mood and energy levels'",
        "Kale and fish among foods that could boost brain health and reduce risk of dementia",
        "Poor hearing increases early death risk due to 'significant' link to heart failure",
        "Five easy lifestyle changes to get fitter - even if you're too busy for the gym",
        "Maximise your weight loss workouts with the expert-recommended ‘3-3-3 rule'"
    ],
    "http://indianexpress.com/section/india/feed/": [
        "Modi govt only pays lip service to Ambedkar, BJP-RSS his enemies: Congress chief Kharge",
        "An Ambedkar statue, a nameplate, and a midnight slugfest between Congress and BJP in Rajasthan",
        "SC to hear on Apr 16 matter related to tree felling in Hyderabad’s Kancha Gachibowli forest",
        "Country dedicated to social justice due to Ambedkar’s inspiration: PM Modi",
        "Bank Holidays in April 2025: Are banks open or closed today, on April 14?"
    ],
    "http://www.abc.net.au/news/feed/1534/rss.xml": [
        "Trumpet of Patriots candidate facing criminal charges stands in Dutton's seat",
        "PM wants Australia to co-host 2026 UN climate conference",
        "Cattle industry back in court chasing final payout for live export ban",
        "Plibersek laughs off awkward interaction with PM",
        "Dutton says he wants house prices to 'steadily increase' in Australia"
    ],
    "http://syndication.howstuffworks.com/rss/science": [
        "Hodag: From Wisconsin Hoax to Best-selling Beast",
        "Yowie: Animal Kingdom Resident or Hoax Down Under?",
        "Drop Bears, Australia and an Enduring Prank on Non-Aussies",
        "The 'Not Deer' Cryptid Is Exactly What It Sounds Like",
        "Is the Bloop Real? Well, Yes and No"
    ],
    "http://www.npr.org/rss/rss.php?id=5": [
        "The Science in Science FIction",
        "After 11 Years Behind The Host Mic, Neal Conan Signs Off",
        "Hopes And Fears For The Future Of The World, With Ted Koppel",
        "What's The Talk Of Your Nation?",
        "So Hard To Say Goodbye: Advice For Farewell Notes"
    ],
    "http://www.abc.net.au/news/feed/46182/rss.xml": [
        "Rival housing policies to dominate debate between Chalmers and Taylor",
        "Former PMs turn out, senator has MAGA moment and housing debate heats up",
        "Dutton says he wants house prices to 'steadily increase' in Australia"
    ],
    "http://www.femina.in/feeds/feeds-lifestyle.xml": [
        "Did you know that rose is 35 million year-old?",
        "How to tell a good loan from a bad one",
        "Safety tips for solo woman traveller",
        "Bollywood posters copied from Hollywood",
        "Tips to make your small house look bigger"
    ],
    "http://rss.cnn.com/rss/cnn_showbiz.rss": [
        "Kirstie Alley, 'Cheers' and 'Veronica's Closet' star, dead at 71",
        "John Travolta and Kirstie Alley: A love story",
        "Chelsea Handler, Leslie Jones and John Leguizamo among guest hosts to step in for Trevor Noah on 'The Daily Show'",
        "Ashton Kutcher and twin Michael talk health, guilt and rift between them",
        "Bong Joon Ho's 'Mickey 17' gets trailer and release date"
    ],
    "http://www.popsugar.co.uk/celebrity/feed": [
        "Bridgerton's Hannah Dodd: Francesca Doesn't Chase Validation Like Her Siblings",
        "Tasha Ghouri: I Lost Friends and Family Due To Instant Fame",
        "The 24 Sexiest Movie Scenes of All Time",
        "How To Date Billy Walsh Charithra Chandran and Sebastian Croft on Rom-Com Diversity",
        "Kate's Cancer Diagnosis: Why Are Women Always Pressured to Show Up?"
    ],
    "http://rss.csmonitor.com/feeds/usa": [
        "Explained: The legal fight to stop Mahmoud Khalil’s deportation",
        "To speed deportations, Trump revives rarely used laws",
        "After Gaza protests, more colleges try out an old-fashioned ideal: Civility",
        "Markets got a tariff pause. But damage to global confidence in US could last.",
        "Meet ‘the loud majority.’ College conservatives are silent no longer."
    ],
    "http://www.dynamicbusiness.com.au/feed": [
        "BirdEatsBug: Bug reporting tool",
        "Canva’s latest launch brings AI creativity to every Aussie business",
        "HubSpot introduces AI-powered workspaces for sales, support teams",
        "World Quantum Day: Meet 4 Australian startups driving the quantum leap",
        "St. Basil’s first female CEO Diana Horvatovic’s heartfelt leadership lessons"
    ],
    "http://feeds.feedburner.com/BreakingScienceNews?format=xml": [
        "Bizarre New Species of Therizinosaur Had Two-Fingered Hands",
        "KATRIN Physicists Measure Upper Mass Limit of Neutrino",
        "Pleistocene-Age Denisovan Fossil Found in Taiwan",
        "New Genomic Research Sheds More Light on Evolutionary History of Mammoths",
        "Astronomers Measure Rotation Rate of Uranus with Unprecedented Precision"
    ],
    "http://feeds.feedburner.com/factmag": [
        "Interview: Gabriel Moses",
        "Gabriel Moses announces largest ever exhibition at 180 Studios",
        "Interview: Cecilia Bengolea on her dancehall film for VF: Reverb",
        "The Vinyl Factory: Reverb exhibition extended until 2 March",
        "Es Devlin: Screenshare"
    ],
    "http://www.indodaily.com/indodaily.xml": [
        "At least 69 killed in thunderstorms, avalanches in India, Nepal, China",
        "Nepal fights wildfires and pollution amidst drier winter",
        "India's TCS posts small profits dip in 'challenging' environment",
        "US storms, 'devastating' flooding death toll climbs to 17",
        "India's Modi clinches defence, energy deals in Sri Lanka"
    ],
    "http://www.newrepublic.com/taxonomy/term/17538/feed": [
        "Will the Supreme Court Crash the Global Economy?",
        "Trump’s Horrifying Removal of Man in “Error” Takes an Even Darker Turn",
        "Gretchen Whitmer Fell Into Trump’s Tariff Trap",
        "Measles Is Spreading, and RFK Jr. Is Praising Quacks",
        "Trump Scores Massive Win as Judge Rules He Can Deport Mahmoud Khalil"
    ],
    "http://feeds.abcnews.com/abcnews/usheadlines": [
        "Ecuadorian President Daniel Noboa appears headed to reelection victory",
        "State Department wants staff to report instances of alleged anti-Christian bias during Biden's term",
        "Schumer seeks to halt flights for New York helicopter company after deadly Hudson River crash",
        "No injuries after Pennsylvania Gov. Shapiro's residence set on fire",
        "Winning numbers drawn in Saturday’s Powerball"
    ],
    "http://feeds.feedburner.com/ExclaimCaAllArticles": [
        "Aimee Lou Wood Calls Out 'SNL' for Mean and Unfunny Parody of 'SNL'",
        "Jon Hamm Was in His Happy Place on 'SNL,' While Lizzo Performed Successful Image Rehab",
        "Cœur de pirate Announces New Album 'Cavale,' Shares Title Track",
        "Lana Del Rey's New Album Has a Different Title and Release Date, Actually",
        "Thunder Bay's Wake the Giant Gets Black Eyed Peas, Prozzäk for 2025 Festival"
    ],
    "http://feeds.feedburner.com/ScottishNewsHeraldScotland": [
        "Donald Trump calls Sumy missile strike 'mistake' as death toll rises to 34",
        "Plan for new Christmas lights switch-on revealed as George Square show axed",
        "Police Scotland spend £2,500 on overseas flights during SNP probe",
        "Scottish Government 'considering' scheme to make it easier to return to school",
        "Councils reveal multi-million costs of Storm Éowyn clean-up operation"
    ],
    "http://www.nasa.gov/rss/dyn/breaking_news.rss": [
        "Sols 4507-4508: “Just Keep Driving”",
        "NASA-Developed Tools at Marshall Support Operations to Space Station",
        "GLOBE Mission Earth Supports Career Technical Education",
        "Apollo 13 Launch: 55 Years Ago",
        "NASA’s IMAP Arrives at NASA Marshall For Testing in XRCF"
    ],
    "http://khn.org/feed/": [
        "Journalists Delve Into Effects of Deep Federal Cuts on Public Health",
        "Some Rural Hospitals Ditch Medicare Advantage",
        "More Psych Hospital Beds Are Needed for Kids, but Neighbors Say Not Here",
        "Trump HHS Eliminates Office That Sets Poverty Levels Tied to Benefits for at Least 80 Million People",
        "KFF Health News' 'What the Health?': The Dismantling of HHS"
    ],
    "http://metro.co.uk/entertainment/gaming/feed/": [
        "Games Inbox: How much will GTA 6 cost?",
        "Nintendo Switch 2 games are not too expensive – Reader’s Feature",
        "Rising costs are turning video games into something only for the rich – Reader’s Feature",
        "Nintendo are repeating some very old mistakes with the Switch 2 – Reader’s Feature",
        "Ex-Nintendo fan sells PS5 Pro to buy Switch 2 – Reader’s Feature"
    ],
    "http://globalnews.ca/politics/feed/": [
        "Poilievre targets Carney’s assets, promises tougher ethics rules",
        "Campus voting begins at more than 100 universities and colleges across Canada",
        "Liberals lead dips for 1st time in Canada election as Tories gain: poll",
        "Poilievre gains endorsement from business leaders, ex-bank heads",
        "Carney unveils new ‘Canada Strong Pass.’ What free perks are available?"
    ],
    "http://www.dose.ca/feed": [
        "Here’s how the Canadiens can make the playoffs",
        "The Canadiens are not assured of making the playoffs: the Blue Jackets won tonight",
        "Since his return to the game, Kaiden Guhle is hitting his opponents twice as much",
        "38 photos and key moments of the Canadiens’ last 4 wins",
        "Calvin de Haan : “The way I’ve been treated here, it’s crap”"
    ],
    "http://feeds.bbci.co.uk/sport/0/cricket/rss.xml?edition=uk": [
        "Sibley puts Surrey on course for win against Hants",
        "ICC forms taskforce to help Afghan female players",
        "Bess' maiden century leads Yorkshire to record win",
        "Kent wrap up eight-wicket win against Middlesex",
        "Irish World Cup hopes ended by loss to Bangladesh"
    ],
    "http://rss.cnn.com/rss/cnn_allpolitics.rss": [
        "How Kyrsten Sinema's decision makes Democrats' 2024 Senate map tighter",
        "Meet the woman steering Biden's bipartisan winning streak on Capitol Hill",
        "CNN Political Briefing",
        "The Axe Files with David Axelrod",
        "Margins of Error"
    ],
    "https://sports.yahoo.com/top/rss.xml": [
        "GdS: Milan&8217;s new Sporting Director between two &8211; who Furlani will interview first",
        "Roma fight back to earn draw with Lazio in fierce derby",
        "Between drones and AI, Masters tries to balance past with future",
        "New Bears guard Jonah Jackson sees Chicago as a place where he can win a ring",
        "McIlroy 'proud' as Masters play-off win seals career Grand Slam at last"
    ],
    "http://feeds.bbci.co.uk/news/politics/rss.xml": [
        "MPs reject two-tier policing claims in 2024 riots",
        "MP barred from Hong Kong says it was to 'shut me up'",
        "Bangladesh issues arrest warrant for British MP Tulip Siddiq",
        "Army experts called in over Birmingham bin strike",
        "Record number of migrants cross Channel in 2025 so far"
    ],
    "http://mobilesyrup.com/feed/": [
        "Streaming in Canada on Apple TV+, Crave, Netflix and Prime Video [April 14-20]",
        "I’m very excited for the incredibly thin Samsung Galaxy S25 Edge",
        "Poco M7 Pro 5G review: Reliving the 2010’s Android",
        "Testing lossless audio on AirPods Max in 2025",
        "Apple aiming to launch delayed Apple Intelligence features this fall: report"
    ],
    "http://grantland.com/hollywood-prospectus/feed/": [
        "Brand Echh: Sandra Bullock and Billy Bob Thornton Can’t Save the Lame ‘Our Brand Is Crisis’",
        "50 Scenes That Do Not Appear in the Fox ‘X-Files’ Revival",
        "In Praise of Beach Slang, 2015’s Best, Most Sincere Rock Band",
        "Who Was Missing From Taylor Swift’s Miami Squad?",
        "Happy ‘Halloween’: The Best Horror-Movie Monsters"
    ],
    "http://feeds.feedburner.com/DrudgeReportFeed": [
        "Republicans fear political wipeout...",
        "Governing by gut...",
        "iPhone olive branch is significant trade war retreat...",
        "China well positioned to weather...",
        "BEIJING SECRETLY CHOKING OFF US EXPORTS..."
    ],
    "http://feeds.news.com.au/public/rss/2.0/news_sport_3168.xml": [
        "USADA’s stunning anti-doping swoop on Lesnar",
        "Kangaroos’ extraordinary punishment",
        "Pies board accepts McGuire apology",
        "Why I hated being on Baywatch",
        "Stalker skirt shot divides internet"
    ],
    "http://feeds.webservice.techradar.com/us/rss/news/gaming": [
        "IT: Welcome to Derry – everything you need to know about the new Max horror series",
        "World Quantum Day – is the internet ready for the biggest security threat of all time?",
        "The state of AI in 2025: the road ahead",
        "This curling wand looks like a drill and I'm not sure if it's dumb or genius",
        "The Last of Us season 2 episode 1 is a purposefully paced, slightly dreary return for Pedro Pascal and Bella Ramsey's highly acclaimed HBO TV show"
    ],
    "http://www.washingtontimes.com/rss/headlines/news/politics/": [
        "State Department suggests deported Salvadoran man is beyond U.S. reach",
        "Trump administration officials say tariff reprieve on electronics is temporary",
        "State Department wants staff to report instances of alleged anti-Christian bias during Biden's term",
        "Schumer seeks to halt flights for New York helicopter company after deadly Hudson River crash",
        "White House physician says Trump is in 'excellent health'"
    ],
    "http://www.thehindu.com/news/cities/?service=rss": [
        "KTR says Congress failed to implement SC declaration, demands apology",
        "Man fatally stabbed in Rein Bazaar days before wedding; personal enmity suspected to be the motive",
        "Message on Mumbai police helpline threatens actor Salman Khan; case lodged",
        "Tamil Nadu’s 61-day annual fishing ban begins on April 15",
        "Veteran Kannada comedy actor Bank Janardhan passes away"
    ],
    "http://www.npr.org/rss/rss.php?id=1019": [
        "The biggest trial in Meta's history starts Monday. Here's what to know",
        "Smartphones and computers are now spared from Trump's reciprocal tariffs",
        "What are your rights if border authorities ask for your phone?",
        "This former influencer gave up her smartphone. She says you should, too",
        "Trump administration backs off Nvidia's 'H20' chip crackdown after Mar-a-Lago dinner"
    ],
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_business_2783.xml": [
        "Beach Boy ‘witnessed a Manson murder’",
        "Oil rise fails to lift stocks",
        "Home loan approvals bounce back",
        "Union seeks say in Arrium future",
        "Banks an early drag on stocks"
    ],
    "http://www.manchestereveningnews.co.uk/rss.xml": [
        "LIVE: Manchester trains STOPPED as 'trespassers' cause major disruption - latest updates",
        "Celebrity Big Brother's Mickey Rourke 'ashamed' of himself after 'trying hardest' to leave ITV show",
        "Marcus Rashford's future takes fresh twist as new club 'monitoring' Manchester United star",
        "The Stolen Girl cast: All you need to know about the stars Disney+'s harrowing new drama",
        "Warning as 'unprecedented' number of deadly Asian hornets could 'butcher' UK bees"
    ],
    "http://www.destructoid.com/?mode=atom": [
        "The 10 best UNO editions, ranked",
        "All EA FC 25 Immortality League rewards and tasks",
        "Golazo EA FC 25 Evolution: Best players to use",
        "Wuthering Waves 2.3 livestream date and countdown",
        "How to solve the Secret Garden Puzzle in Blue Prince"
    ],
    "http://dailycaller.com/section/politics/feed/": [
        "‘Companies Will Bring Work Back’: UAW President Defends Trump Tariffs In Verbal Slugfest With Befuddled MSNBC Hosts",
        "EXCLUSIVE: Jon Husted Is Ready To Get To Work — In The Senate And On The Campaign Trail",
        "Pennsylvania Governor’s Mansion Targeted By Arson Attack",
        "‘Fully Fit’: White House Physician Releases Details On President Trump’s ‘Excellent Health’",
        "‘She Has No Choice’: Stephen A. Smith Calls Out ‘Foolish And Immature’ Critics Of Dem Gov Who Met Trump"
    ],
    "http://grist.org/feed/": [
        "New technologies are helping to regrow Arctic sea ice",
        "Millions of Americans don’t speak English. Now they won’t be warned before weather disasters.",
        "Trump said cuts wouldn’t affect public safety. Then he fired hundreds of workers who help fight wildfires.",
        "Massachusetts home-electrification pilot could offer a national model",
        "What do climate protests actually achieve? More than you think."
    ],
    "http://www.techrepublic.com/rssfeeds/blog/australian-technology/": [
        "Will a Useful Quantum Computer Be a Reality Within 10 Years? DARPA, 2 Australian Startups, IBM & More Are Working On It",
        "Top Tech Conferences & Events to Add to Your Calendar in 2025",
        "Boosting R&D Could Lift Australia’s GDP by 3, Report Finds",
        "Australians Hit With One Cyber Attack Every Second in 2024",
        "Australia Divided on DeepSeek Response: Industry Groups Call for Action, Minister Urges Caution"
    ],
    "http://feeds.bbci.co.uk/news/business/rss.xml": [
        "Why did the government take control of British Steel?",
        "Meta antitrust case could force sale of Instagram",
        "Royal Mail: The curious case of why a billionaire wants to buy what looks like a fading relic",
        "Was China the reason Guyana faced higher Trump tariff?",
        "Faisal Islam: Trump's iPhone olive branch is a significant trade war retreat"
    ],
    "http://www.crikey.com.au/politics/feed": [
        "Crikey for PM: All your questions answered",
        "Crikey for PM: Crikey registers a candidate, fights with a fax machine and watches blindfolded bingo",
        "Crikey is running for Parliament. No, actually. Here’s why",
        "A ‘tough’ ex-cop with an ‘emotional gene’: How Liberals plan to sell Dutton",
        "GetUp CEO quietly departs as the group goes missing in action during election campaign"
    ],
    "http://www.npr.org/rss/rss.php?id=1003": [
        "Troops arrive at the border to help with enforcement despite fewer migrant crossings",
        "UKRANIANS IN AUSTIN",
        "One lawyer's big worry about the Abrego Garcia case",
        "Why one deportation case has legal scholars afraid for even U.S. citizens",
        "Suspect arrested after fire at Pennsylvania Gov. Josh Shapiro's residence, police say"
    ],
    "http://feeds.news.com.au/public/rss/2.0/business_top_stories_346.xml": [
        "‘I have a conflict situation as President’",
        "ALDI’s tough stance on alcohol",
        "Creepy Airbnb host reveals ulterior motive",
        "The crazy thing we’re still buying",
        "Why you’re getting poorer right now"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Upshot.xml": [
        "Musk’s Latest Fraud Finding Isn’t What It Seems",
        "Why I.R.S. Audits, Already at Their Lowest Levels, May Fall Further",
        "The Three States That Are Especially Stuck if Congress Cuts Medicaid",
        "How Musk and Trump Are Working to Consolidate Government Data About You",
        "The Pandemic Is Not the Only Reason U.S. Students Are Losing Ground"
    ],
    "http://feeds.feedburner.com/TheAustralianBusAviation?format=xml": [
        "Bali chaos as Tiger row deepens",
        "Passengers in safe hands",
        "Tigerair ban strands Aussies",
        "Tigerair passengers stranded",
        "Commercial flying ‘never safer’"
    ],
    "http://www.buzzfeed.com/tvandmovies.xml": [
        "If You Can Name These Blonde Pink-Loving Characters, You're Basically A Pop Culture Genius",
        "You'll Need Very Good Visual Knowledge To Guess This Movie Quote From The Picture Clues",
        "Aimee Lou Wood Says The SNL Parody Of The White Lotus Was Mean And Unfunny",
        "Eva Mendes Made A Rare Comment About Ryan Gosling, And This Is Why We Need More Them In Our Lives",
        "Here's Why Mickey Rourke Was Asked To Leave Celebrity Big Brother"
    ],
    "http://techau.com.au/feed/": [
        "NVIDIA Studio Update supercharges DaVinci Resolve with RTX AI Acceleration",
        "REVIEW: Dell 27 Plus 4K monitor offers 120Hz, but is it worth the money?",
        "Next Level Racing cooked, F-GT PRO a multi-position racing simulator",
        "Yackandandah adds another Community Battery",
        "Tesla’s 2025 Spring Software Update to add B-Pillar camera access"
    ],
    "http://www.bollywoodhungama.com/rss/news.xml": [
        "SHOCKING: Arjun Kapoor reveals Rahul Bhat snubbed him when Arjun messaged him to praise his Black Warrant performance: He didn't pick up my call. I messaged him, 'Can I call you'. He replied, 'For what?'",
        "Arjun Kapoor on cloud nine as Transformers director Michael Bay starts following him on Instagram; draws parallels between Ed Harris in The Rock and John Abraham in Pathaan",
        "When Mammootty spoke about playing Dr. Babasaheb Ambedkar, This was an entirely imaginary interpretation of the great man",
        "REVEALED for the FIRST time in 38 years: Arjun Kapoor opens up on Mr India's DELETED massage parlour scene: Mr India ends up massaging somebody. You can see the skin moving, cucumber flying",
        "Kareena Kapoor Khan and Prithviraj Sukumaran headline Meghna Gulzar’s Daayra"
    ],
    "http://www.film-news.co.uk/rss/UK/news": [
        "Upstairs, Downstairs actress Jean Marsh dies",
        "David Cronenberg: Diane Kruger 'didn't need directing' on The Shrouds",
        "Tom Hardy doesn't 'suit rom-coms'",
        "Octavia Spencer admits feeling 'plaintive' in lead-up to 55th birthday",
        "Alec Baldwin recalls undertaking strict diet before filming Blue Jasmine"
    ],
    "http://www.theguardian.com/au/rss": [
        "Leaders brush off warnings from economists that duelling housing policies will drive up prices in Australia",
        "Garbage bag giant fined 8.25m for falsely claiming products were recycled plastic",
        "‘The sky won’t fall’: China plays down Trump tariff risks",
        "White Lotus star Aimee Lou Wood condemns SNL’s ‘mean and unfunny’ sketch",
        "EU foreign ministers meet in wake of deadly Russian attack on Sumy as Zelenskyy issues plea for Trump to visit Ukraine – Europe live"
    ],
    "http://www.oxfordmail.co.uk/news/rss/": [
        "Police seize car in Oxfordshire after owner drove 'anti-socially'",
        "Homeless drug dealer caught in his car faces deportation",
        "Judge concerned undercover officers took 'filthy' chats with paedo 'too far'",
        "Oxford University's William Hague makes appearance at Boat Race",
        "City butcher's hit with shocking food hygiene rating after inspection"
    ],
    "http://www.femina.in/feeds/feeds-fitness.xml": [
        "Phone a trainer",
        "Save your hair. Have soy",
        "Chocolates for your heart",
        "Get fitter in just 53 days",
        "9 ways to prevent diabetes"
    ],
    "http://thecaucus.blogs.nytimes.com/feed/": [
        "Teenager Charged With Killing Mother and Stepfather in a Plan to Assassinate Trump",
        "Trump officials renew opposition to ruling on Maryland man wrongly deported to El Salvador",
        "Rubio Says 10 More People Have Been Expelled to El Salvador",
        "Democrats Widely Blast Trump’s Tariffs, but Not Tariffs Overall",
        "White House Releases Results of Trump’s Annual Physical Exam"
    ],
    "http://www.pcworld.com/index.rss": [
        "You waited long enough, so now it’s only 33 to file your taxes",
        "Trump reduces tariffs on PCs, components, smartphones",
        "Best VPN deals: Protect your privacy for the lowest prices",
        "Best PC computer deals: Top picks from desktops to all-in-ones",
        "Take 920 off on Samsung’s 49-inch OLED ultrawide gaming monitor"
    ],
    "http://feeds.theguardian.com/theguardian/uk/business/rss": [
        "Stock markets rise on signs of Trump tariff retreat; British Steel races to keep furnaces burning – business live",
        "British Steel to deploy emergency measures to save Scunthorpe furnaces",
        "Gordon Brown accuses Trump of ‘weaponising’ global trade system",
        "Viagogo failing to prevent potentially unlawful practices, say campaigners",
        "Octopus and its customers ask Treasury to back zonal electricity pricing"
    ],
    "http://feeds.feedburner.com/thedailybeast/articles": [
        "Donald Trump Cancels Second Mainstream Interview in Days",
        "Mitch McConnell Called Donald Trump a ‘Stupid’ and ‘Despicable Human Being’",
        "Witnesses Say Would-Be Organ Donor Started ‘Thrashing’ on the Table",
        "Menendez Family Members: We Had ‘Gut-Level’ Fears Erik and Lyle Were Sexually Abused",
        "Liam Payne 911 Caller Said One Direction Star’s Life Could Be in Danger Minutes Before Death"
    ],
    "http://feeds.news.com.au/public/rss/2.0/wtn_top_3368.xml": [
        "Big picture show catches on",
        "Fund for regions rebranded",
        "Farm production to be ‘worth 58.5b’",
        "CFA volunteers rally in Vic over deal",
        "Farming out skills to land a job"
    ],
    "http://www.techtree.com/rss.xml": [
        "“It’s the all-in-one capabilities that make UST projectors a hit in home entertainment,” says Sushil Motwani",
        "“Laser projectors can drive the green revolution in the home entertainment segment,” says Sushil Motwani",
        "Top home projectors to elevate your F1 racing experience",
        "POCO C71: Segment’s Ultimate Blockbuster is Here",
        "UNIX Launches Solo (UX-900 Pro) Neckband with ENC Technology and up to 62+ Hours of Playtime"
    ],
    "http://feeds.news.com.au/public/rss/2.0/cpost_news_entertainment_3329.xml": [
        "Sounds exhilarating",
        "Eyes on world",
        "Waifs celebrate 25 years with Cairns concert",
        "Big year to play host",
        "Exciting stage of life"
    ],
    "http://feeds.feedburner.com/realclearpolitics/qlMj": [
        "The 'New World Order' Is Being Demolished",
        "If the U.S. Sells Its Soul, We'll Be Nothing",
        "The Voluntary Surrender of U.S. Power",
        "I'm Worried About Something Worse Than Recession",
        "Trump's Economic Team of Rivals Braces for Turbulence"
    ],
    "http://feeds.news.com.au/public/rss/2.0/au_national_affairs_news_13_3296.xml": [
        "Culleton lodges appeal",
        "Turnbull dinner cost 30k",
        "Security focus for Abe visit",
        "Judge anger on 10 art claim",
        "Centrelink data to be ‘refined’"
    ],
    "http://feeds.feedburner.com/uk/gizmodo": [
        "Godzilla Ain’t Just Invading Marvel, He’s Gonna Destroy It",
        "Disney Teases Its Adventurous New Lion King and Up Rides",
        "For the First Time, Artificial Intelligence Is Being Used at a Nuclear Power Plant",
        "Beyond Showerheads: Trump’s Attempts to Kill Appliance Regulations Cause Chaos",
        "Marvel Really Wants You to Know Thunderbolts’ Skyscraper Scene is Real"
    ],
    "http://www.espncricinfo.com/rss/content/story/feeds/6.xml": [
        "RCB extend winning run away from home as Kohli and Salt sink Royals",
        "Samson backs himself to lead Royals youngsters to IPL glory",
        "Fleming: 'We were sloppy in the field, we lacked accuracy under pressure'",
        "Kashvee gets maiden call-up, regulars return for ODI tri-series in Sri Lanka",
        "Hardik says MI bowlers 'didn't have anywhere to hide' on a 'tough track'"
    ],
    "http://www.dnaindia.com/feeds/scitech.xml": [
        "Is your WhatsApp down too? Several users claim they are unable to upload status, send texts",
        "Pink Moon 2025: Check date, time and where to watch this 'Micromoon' from India?",
        "Neelima Chowdary Mulpuri: Engineering the future of agile through the lens of artificial intelligence",
        "Artificial Intelligence Explained: What is AI, how it works, where it is used, can it replace human beings?",
        "Is it Game of Thrones again? Dire wolves back to life after 10,000 years?"
    ],
    "http://www.eurogamer.net/?format=rss": [
        "Sony raises PS5 price yet again in UK and mainland Europe",
        "DMZ: Nuclear Survival is a new open-world survival game with crafting, exploration, and beer-swilling bears",
        "EA reminds Battlefield players, things taking place in Labs may or may not make their way to the final game",
        "Stress-testing DLSS 4's super resolution transformer technology",
        "PCs will be exempt from Trump's tariffs, but consoles will not"
    ],
    "http://globalnews.ca/science/feed/": [
        "Elon Musk says he plans to send his humanoid robots to Mars by 2026",
        "The dire wolf has come out of extinction — kind of",
        "Glowing blue spiral spotted across Europe night sky captivates stargazers",
        "The 5 senses of spring: How climate change is shaping our seasonal experience",
        "NASA astronauts return to Earth after 9 months stuck in space"
    ],
    "http://www.skysports.com/rss/0,20514,20876,00.xml": [
        "McIlroy makes Grand Slam history with dramatic Masters play-off win",
        "Papers: Crystal Palace plot sensational swoop for Man Utd star Rashford",
        "How Liverpool can win the Premier League THIS week",
        "Man Utd keeper HOWLER, Barnes double Newcastle run riot and move fourth",
        "'I'm nowhere near' - Norris opens up on his struggle with McLaren's car"
    ],
    "http://www.theguardian.com/fashion/rss": [
        "Suede to go: leather’s hippy cousin is back for 2025",
        "We love: fashion fixes for the week ahead – in pictures",
        "Balenciaga and orthopaedic brand Scholl team up for ‘Frankenshoe’ hybrid",
        "The perfect ‘new’ handbag? An old one | Jess Cartner-Morley on fashion",
        "Cool condiments: ‘little treat culture’ leading to boom in preserves and sauces"
    ],
    "http://feeds.bbci.co.uk/news/uk/rss.xml": [
        "Two British tourists drown near Great Barrier Reef",
        "We're treated like peasants, say tenants in fight over mouldy homes",
        "MPs reject two-tier policing claims in 2024 riots",
        "Army experts called in over Birmingham bin strike",
        "Probe continues into cause of fatal house explosion"
    ],
    "http://www.deccanchronicle.com/rss.xml": [
        "Andhra Pradesh CM, YSRC Chief Pay Tributes To BR Ambedkar",
        "Dhanush and Rashmika Shooting For Kubera To Wrap Up Work",
        "Prabhas and Sandeep Reddy Vanga's 'Spirit': Ready to Roll",
        "Laws Passed in Parliament Have To Be Followed By All States, Says Chhattisgarh CM",
        "MP: Modi Revived Cooperative Moment By Creating Separate Ministry"
    ],
    "http://feeds.bizjournals.com/industry_7": [
        "Seeding solutions: How one Missouri plant biologist addresses global challenges through the study of plants",
        "Billionaire Stephen Ross seeks to build Florida's next-generation economy",
        "SmartRent CEO steps down after less than two months on the job",
        "Axon-supported bill gains bipartisan lawmaker support. Here's what's next",
        "Netflix eyes first Seattle-area office, filings show"
    ],
    "http://zeenews.india.com/rss/science-technology-news.xml": [
        "ISRO’s POEM-4 Safely Re-Enters Earth’s Atmosphere, Reinforces Space Debris-Free Commitment",
        "India Is Amazing From Space, For Sure Going Back To My Father's Home Country: NASA Astronaut Sunita Williams",
        "Nasa Astronaut Sunita Williams Begins 45-Day Rehabilitation Programme To Tackle Likely Health Challenges After Prolonged Stay In Space",
        "Sunita Williams Begins Return Journey To Earth After 9 Months: NASA SpaceX Crew-9 Departs ISS",
        "3.5-Billion-Year-Old Crater Discovery Sheds Light On Earth's Ancient Impact History"
    ],
    "http://www.theguardian.com/uk/rss": [
        "Ministers scramble to keep Scunthorpe steelworks running – UK politics live",
        "UK MP refused entry to Hong Kong accuses China of ‘hidden blacklist’",
        "Rory McIlroy relieved to finally lift decade-long ‘burden’ with dramatic Masters win",
        "White Lotus star Aimee Lou Wood condemns SNL’s ‘mean and unfunny’ sketch",
        "Claims of two-tier policing during 2024 summer riots ‘baseless’, report finds"
    ],
    "http://feeds.abcnews.com/abcnews/technologyheadlines": [
        "Apple has few incentives to start making iPhones in U.S.",
        "OpenAI countersues Elon Musk in legal dispute over ChatGPT maker's business ambitions",
        "La Nina exits after three weak months, leaving Earth in neutral climate state",
        "A machine using ultrasound and AI can gauge the fattiness of a tuna fish",
        "Trump's 'buy' tip on social media before tariffs pause made money for investors"
    ],
    "http://www.hilltimes.com/feed": [
        "Supply chain strategy must go beyond transportation, says Supply Chain Canada president"
    ],
    "http://feeds.theguardian.com/theguardian/technology/rss": [
        "Trump warns exemptions on smartphones, electronics will be short-lived, promises future tariffs",
        "Hell is other people who won’t wear headphones | Letters",
        "Legal Defense Fund exits Meta civil rights advisory group over DEI changes",
        "‘Amazon slayer’: the Dublin minnow taking on the giants in drone deliveries",
        "Tesla stops taking orders in China for two models imported from US"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Space.xml": [
        "How Lauren Sanchez Helped Design Blue Origin’s Flight Suits",
        "Jonathan McDowell on Retiring From Harvard and Leaving the U.S.",
        "Effort to Get Starlink in South Africa Collides With Tension Over Musk",
        "Jared Isaacman, Trump’s Pick to Lead NASA, Questioned Over Moon Plans and Elon Musk",
        "Chinese Lunar Rocks Suggest a Thirsty Far Side of the Moon"
    ],
    "http://www.journaldemontreal.com/rss.xml": [
        "«C’était vraiment une surprise»: Demidov s’entraîne au Complexe CN de Brossard",
        "Contre Trump: faire comme l’Europe avec la Chine",
        "Le pouvoir terrifiant d’un seul homme à semer le chaos",
        "Un ado de 17 ans aurait tué ses parents et planifié d’assassiner Donald Trump",
        "Fraudés jusqu'à la mort: une dame sauvée par son entourage qui ne l'a jamais lâchée"
    ],
    "http://feeds.feedburner.com/TheAustralianMediaNews": [
        "Advertising adds up to 40bn",
        "Chris Wharton’s starring role",
        "Fairfax-APN fears outlined",
        "Trump dumps ‘phony’ Post",
        "Delta puts Nine back in ratings"
    ],
    "http://metro.co.uk/entertainment/showbiz/feed/": [
        "Only Fools and Horses and Miami Vice star Mario Ernesto Sánchez dies aged 78",
        "Katy Perry reveals she ‘plans to sing in space’ ahead of history-making mission",
        "Michelle Keegan shares tribute to newborn daughter during blissful first weeks of motherhood",
        "Surprise detail in Katy Perry’s history-making spaceflight",
        "The Crown’s Emma Corrin splits from Bohemian Rhapsody’s Rami Malek after two years"
    ],
    "http://feeds.feedburner.com/SportcoukNewsRssFeed": [
        "Liverpool attempted to trademark 'Allez Allez Allez' after famous fan chant",
        "Henderson, Keita and Gomez fit for Fulham says Liverpool boss Klopp",
        "Jordan Nobbs Column: England Have Impressed So Far But Must Be Wary of Tough Japan Challenge",
        "Ashley Cole signs new one-year deal at LA Galaxy&nbsp;",
        "Cilic Expecting First Child In 2020"
    ],
    "http://www.ok.co.uk/rss/health": [
        "Shoppers 'replace all lipstick' with Victoria Beckham's lip balm that 'keeps lips hydrated all day'",
        "M&S shoppers say spring-ready £50 denim dress looks 'triple the price' and 'fits amazingly'",
        "The moisturising SPF behind The White Lotus star Meghann Fahy's glowing skin",
        "'Delicious' chocolate-scented candle that's '10x better than other brands' is ideal for Easter weekend",
        "Wear your chocolates this Easter with the trendiest brown fashion buys from £29"
    ],
    "http://feeds.news.com.au/public/rss/2.0/news_lifestyle_3171.xml": [
        "Hilarious Channel 7 gaffe goes viral",
        "Dave Hughes takes on Sam Kekovich",
        "‘Hang on, aren’t we all boat people?’",
        "Sunscreen leaves kids ‘screaming in pain’",
        "ALDI’s tough stance on alcohol"
    ],
    "http://www.engadget.com/tag/@gaming/rss.xml": [
        "The best wireless headphones for 2025: Bluetooth options for every budget",
        "The Last of Us season two premiere: 'Future Days' highlights the fracture between Ellie and Joel",
        "Bungie shares first looks at gameplay from its new shooter, Marathon, alongside a release date",
        "iPad software will reportedly get more Mac-like with the iPadOS 19 redesign",
        "Electronics exempted from reciprocal tariffs will soon be subject to new semiconductor tariffs instead"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Health.xml": [
        "The Many Ways Kennedy Is Already Undermining Vaccines",
        "Experts Doubt Kennedy’s Timetable for Finding the Cause of Autism",
        "RFK Jr. Accuses FDA of Drug Industry Influence That Barred Alternative Remedies",
        "Pig Kidney Removed From Alabama Woman After Organ Rejection",
        "Trump Administration Delays Plan to Limit Pricey Bandages"
    ],
    "http://www.technologyreview.com/stream/rss/": [
        "The Download: how the military is using AI, and AI’s climate promises",
        "Love or immortality: A short story",
        "How AI is interacting with our creative human processes",
        "Generative AI is learning to spy for the US military",
        "Why the climate promises of AI sound a lot like carbon offsets"
    ],
    "http://globalnews.ca/sports/feed/": [
        "Raptors sign centre Colin Castleton",
        "Demidov fever: New Montreal Canadiens sniper bringing fanfare frenzy",
        "Toronto Raptors waive Robinson and Swider",
        "Mogbo has first triple-double of his career",
        "Raptors dominate Hornets despite resting starters"
    ],
    "http://feeds.feedburner.com/TheAustralianPolitics": [
        "Culleton lodges appeal",
        "Turnbull dinner cost 30k",
        "Security focus for Abe visit",
        "Judge anger on 10 art claim",
        "Centrelink data to be ‘refined’"
    ],
    "http://www.theguardian.com/travel/rss": [
        "10 Lisbon restaurants I’d recommend to a friend visiting the city",
        "The ghostly allure of Dungeness, Kent",
        "What’s new in Portugal? 10 reasons to visit in 2025",
        "Looking for the authentic Algarve? Go in the low season – and to Tavira",
        "Your favourite bars, beaches, swimming spots and more: readers’ top 10 travel tips on Portugal"
    ],
    "http://www.theguardian.com/music/rss": [
        "‘I’ve pulled myself out of a very dark abyss’: Garbage’s Shirley Manson on depression, sexism, dodgy hips and happiness",
        "Post your questions for Bonnie Raitt",
        "‘The Citizen Kane of rock movies’: glam rockers Slade and their bid for cinema greatness",
        "Max Romeo was a great social commentator, railing against inequality and discord",
        "Green Day at Coachella review – fun but muddled set pokes fun at American Idiots"
    ],
    "http://feeds.bbci.co.uk/news/world/us_and_canada/rss.xml": [
        "Man arrested after suspected arson attack at Pennsylvania governor's home",
        "China urges US to 'completely cancel' tariffs",
        "Stars mingle in Coachella audience as Lady Gaga wows festivalgoers",
        "In Canada's car capital, auto workers brace for the worst",
        "Landmark antitrust trial could force Zuckerberg to sell Instagram"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Sports.xml": [
        "Why Steve Kerr Thinks the N.B.A. Regular Season Has Too Many Games",
        "The Most Disappointing N.H.L. Players of the Season",
        "The Allure of Dressing for the Masters Will Never Go Out of Style",
        "Play Connections: Sports Edition. Tackle Today’s Puzzle.",
        "The Best-Case Scenario for Shedeur Sanders in the N.F.L. Draft"
    ],
    "http://musiccanada.com/feed/": [
        "Music Canada celebrates the 50th anniversary of the Gold & Platinum Certification Program at the JUNOS",
        "IFPI’s Global Music Report 2025 reveals tenth consecutive year of growth",
        "Music Canada’s Gold & Platinum program celebrates 50 years",
        "Music Canada and DIMA issue joint letter to CRTC following Canadian content audio workshops",
        "Canada needed a reimagined broadcasting system. The CRTC’s contribution decision offers more of the same while risking the important role played by licensed streaming in building the careers of artists."
    ],
    "http://www.express.co.uk/posts/rss/79/showbiznews": [
        "Full list of BBC stars who have died in 2025 in tragic year for broadcaster",
        "The Last of Us fans convinced they have 'worked out' Joel Miller's fate after premiere",
        "The Last of Us season 2 premiere leaves 'devastated' fans 'crying their hearts out'",
        "BBC Breakfast's Sally Nugent swipes 'never in a million' after co-host's direct question",
        "Pedro Pascal's emotional tribute to Bella Ramsey after major MTV Movie and TV Awards win"
    ],
    "http://www.popsci.com/rss.xml": [
        "Home Depot is blowing out Ryobi tools and batteries during its Spring Black Friday sale",
        "I tried L.A.B. Golf’s zero-torque tech that turns heads, but not putters",
        "One thing you can do to get over Nintendo Switch 2 prices",
        "The Great Pacific Garbage Patch isn’t just a floating trash pile",
        "Don’t get left in the productivity dust—get the latest from MSO Office (and save 20)"
    ],
    "http://www.journaldemontreal.com/sports/rss.xml": [
        "Ivan Demidov pourra compter sur le vétéran Samuel Montembeault",
        "Six éléments à surveiller au Tournoi des Maîtres en ce dimanche: la lutte sans merci entre Rory McIlroy et Bryson DeChambeau",
        "Les Oilers vont encore piger en Europe",
        "Mondiaux féminins: le Canada plie devant son ennemi juré",
        "«C’était vraiment une surprise»: Demidov s’entraîne au Complexe CN de Brossard"
    ],
    "http://globalnews.ca/category/entertainment/feed/": [
        "What I’ve learned from Canadian music fans on my cross-country speaking tour",
        "Mick Jagger engaged to Melanie Hamrick, who says marriage is a ‘maybe’",
        "Eric Dane, ‘Grey’s Anatomy’ star, says he’s been diagnosed with ALS",
        "Captain Canuck comes to save Canadians in trade war-inspired comic",
        "Mickey Rourke gets ‘warning’ for homophobic remarks on ‘Celebrity Big Brother U.K.’"
    ],
    "http://www.engadget.com/rss.xml": [
        "The best wireless headphones for 2025: Bluetooth options for every budget",
        "The Last of Us season two premiere: 'Future Days' highlights the fracture between Ellie and Joel",
        "Bungie shares first looks at gameplay from its new shooter, Marathon, alongside a release date",
        "iPad software will reportedly get more Mac-like with the iPadOS 19 redesign",
        "Electronics exempted from reciprocal tariffs will soon be subject to new semiconductor tariffs instead"
    ],
    "http://feeds.feedburner.com/dailytelegraphnationalnewsndm?format=xml": [
        "‘Being secret doesn’t make sense’",
        "Turnbull calls for electronic voting",
        "‘Thrown under the bus’: Jones unleashes",
        "Shorten blasted for ‘treaty bomb’",
        "Turnbull and Shorten speak of mistakes"
    ],
    "http://feeds.feedburner.com/TheAustralianSportsNews": [
        "Legal big gun to help Blues",
        "Rioli wins place among greats",
        "Rich continue their rebellion",
        "Lealiifano has new focus",
        "Taxman joins gold rush"
    ],
    "http://feeds.abcnews.com/abcnews/healthheadlines": [
        "Measles exploded in Texas after stagnant vaccine funding. New cuts threaten the same across the US",
        "RFK Jr. wants to target chronic disease in US tribes. A key program to do that was gutted",
        "France rugby star Chabal doesn't remember 'single second' of career due to concussion",
        "Australian woman unknowingly gives birth to a stranger's baby after IVF clinic error",
        "States sue over Trump administration's sudden halt of pandemic relief aid for schools"
    ],
    "http://www.gamespot.com/feeds/mashup/": [
        "How To Solve The Castle Cipher Puzzle In Blue Prince",
        "Highest-Grossing Video Game Movies Of All Time",
        "How To Solve Eight Realms In Eight Months In Blue Prince",
        "Bungie's Marathon Releases In September On Same Day As Another Big Game",
        "Marathon Closed Alpha Begins In April, Here's How To Sign Up"
    ],
    "http://feeds.news.com.au/public/rss/2.0/anow_topstories_250.xml": [
        "Parents’ plea for SA man facing death",
        "Young volleyball star gone too soon",
        "Twin baby dies in home birth tragedy",
        "Holden to review Pies sponsorship",
        "Poll shows Kate Ellis heading for shock defeat"
    ],
    "http://www.skysports.com/rss/0,20514,12040,00.xml": [
        "'They are not a very good team' - Neville's verdict on 'desperate situation' at Man Utd",
        "Today on Sky Sports Racing: Hexham and Chantilly feature",
        "Whittaker vs Cameron 2: Everything you need to know",
        "How Rory topped Tiger's 2019 Masters win on 'one of greatest days in golf'",
        "McIlroy: I've made my dreams come true after 'heavy burden'"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Politics.xml": [
        "Teenager Charged With Killing Mother and Stepfather in a Plan to Assassinate Trump",
        "Trump officials renew opposition to ruling on Maryland man wrongly deported to El Salvador",
        "Rubio Says 10 More People Have Been Expelled to El Salvador",
        "Democrats Widely Blast Trump’s Tariffs, but Not Tariffs Overall",
        "White House Releases Results of Trump’s Annual Physical Exam"
    ],
    "http://fivethirtyeight.com/politics/feed/": [
        "What Americans Think Of The Biden Impeachment Inquiry",
        "The Second GOP Debate Could Be Smaller, With Or Without Trump",
        "The Senate Is Losing One Of Its Few Remaining Moderate Republicans",
        "Why ‘Bidenomics’ Isn’t Working For Biden",
        "Why Biden Is Losing Support Among Voters Of Color"
    ],
    "http://cogconnected.com/feed/": [
        "Sony Is Increasing the Price of PS5 in Europe, Australia, and New Zealand",
        "Sipssassin Will Begin Its Mission on Steam Next Month",
        "Teeto Is Hoping Onto Steam in Early 2026",
        "Bureau of Contacts Has Released Its Full Version on Steam",
        "Monster Energy Supercross 25 Review – Muddy and Mediocre"
    ],
    "http://www.winnipegfreepress.com/rss/?path=%2Fsports": [
        "Islamabad urges Tehran’s cooperation over the killing of 8 Pakistani nationals in southeastern Iran",
        "In the news today: Carney, Poilievre campaigning in Montreal today",
        "Wild in action against the Ducks after overtime win",
        "Washington tries to break road losing streak, visits New York",
        "Toronto brings 3-game win streak into matchup with Buffalo"
    ],
    "http://www.theguardian.com/lifeandstyle/health-and-wellbeing/rss": [
        "Go to town The surprise feelgood effects of walking in the city",
        "Put your baby down to nap near a washing machine, expert says",
        "Poppy Okotcha: ‘Plants taught me about myself’",
        "What happens when love tips over into the infatuated state of ‘limerence’?",
        "Young people in the UK: tell us about your gym habits"
    ],
    "http://www.thehindu.com/news/national/?service=rss": [
        "Fifteen foreigners nabbed for illegal stay in India, sent for deportation",
        "KTR says Congress failed to implement SC declaration, demands apology",
        "Former Himachal Pradesh Minister Virendra Kanwar gets ransom call, death threat; case registered",
        "Punjab LoP Bajwa booked after being quizzed by police over '50 bombs' claim",
        "Modi govt only pays lip service to Ambedkar, BJP-RSS his enemies: Kharge"
    ],
    "http://www.standard.co.uk/sport/football/rss": [
        "West Ham: Mohamed Salah examination a 'great education' for Ollie Scarles, says Graham Potter",
        "Manchester United injury update: Joshua Zirkzee, Matthijs de Ligt and Amad Diallo latest news and return dates",
        "Man City injury update: Ederson, Phil Foden and Erling Haaland latest news and return dates",
        "Liverpool injury update: Trent Alexander-Arnold and Joe Gomez latest news and return dates",
        "Tottenham injury update: Heung-min Son, Wilson Odobert and Kevin Danso latest news and return dates"
    ],
    "http://www.hellomagazine.com/rss.xml": [
        "Princess Margaret's granddaughter Lady Margarita Armstrong-Jones on style, jewels and her royal heritage - exclusive",
        "Bargain Hunt's Izzie Balmer delights fans with exciting news",
        "NCIS' Michael Weatherly divides fans with Tony & Ziva update",
        "Princess Kate's 'mothering' instinct and real family dynamic revealed",
        "I’m stronger than ever at 71 - here's my weekly routine"
    ],
    "http://feeds.feedburner.com/TheAustralianTheNationNews": [
        "Agent payouts to shift stock",
        "Commissions driving unit sales",
        "Bitter taste for local chefs",
        "Deep in space, a flicker of life",
        "Culleton lodges appeal"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Science.xml": [
        "A Cautionary Tale of 408 Tentacles",
        "Jonathan McDowell on Retiring From Harvard and Leaving the U.S.",
        "She Worked in a Harvard Lab to Reverse Aging, Until ICE Jailed Her",
        "Denisovans Extend Their Range to Asia’s Pacific Coast",
        "Neutrinos Are Shrinking, and That’s a Good Thing for Physics"
    ],
    "http://www.thehindu.com/sport/?service=rss": [
        "DC skipper Axar fined 12 lakh for maintaining slow over-rate",
        "Archery World Cup Stage 1: Dhiraj Bommadevara bags individual bronze, men's team wins silver",
        "IPL 2025 | Dhoni is not a soothsayer, he hasn't got a magic wand: CSK head coach Fleming",
        "Rory McIlroy wins Masters in dramatic fashion, becomes 6th golfer to complete career Slam",
        "Bahrain GP: Oscar Piastri cruises to win, with Lando Norris third"
    ],
    "http://www.brandonsun.com/rss/?path=%2Fnational%2Fbreaking-news": [
        "In the news today: Carney, Poilievre campaigning in Montreal today",
        "Missing Carberry man found deceased",
        "Get out and create for World Art Day",
        "Is it time for Canada to lower the federal voting age to 16?",
        "Canada federal election 2025: Where the leaders are on Monday, April 14"
    ],
    "http://feeds.foxnews.com/foxnews/latest?format=xml": [
        "Man in car calls his wife 'worst backseat driver,' sparking social media debate",
        "Blue state ‘prioritizing the criminals’ with 239M taxpayer-funded prison project, prosecutor says",
        "Meghan Markle sent her lifestyle products to King Charles in bid to end royal rift: experts",
        "American drivers warned about red flags to avoid ‘predatory towing’ targeting motorists across US",
        "US northern border faces Great Lakes threat from ‘bad actors’ pressing waterfront weaknesses: expert"
    ],
    "http://www.npr.org/rss/rss.php?id=1014": [
        "When adults reject vaccines, children pay the price",
        "Trump mulls semiconductor levies after lifting reciprocal tariffs on electronics",
        "Suspect arrested after fire at Pennsylvania Gov. Josh Shapiro's residence, police say",
        "Bernie Sanders warns of 'extraordinary danger' facing U.S. under Trump at LA rally",
        "White House doctor says Trump is 'fully fit' in medical report"
    ],
    "http://www.dailymail.co.uk/sciencetech/articles.rss": [
        "Minute-by-minute, what would happen if a solar SUPERSTORM hit Earth - as scientists warn one could strike us 'at any moment'",
        "I was once an atheist - these stories have convinced me that heaven AND hell are real",
        "Could the Dubai chocolate give you CANCER? Experts warn cheap versions of the viral sweet treat contain carcinogenic chemicals, palm oil and toxins from MOULD",
        "Scientists reveal what it's really like to receive a vision from God",
        "Terrifying new theory of what's behind Tic Tac UFOs that keep rising from ocean in front of US Navy sailors"
    ],
    "http://feeds.newscientist.com/space": [
        "'Quantum Darwinism' may explain why we live in a shared reality",
        "What the surprising lives of solitary animals reveal about us",
        "How to spot Haumea, one of the solar system's strangest objects",
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind"
    ],
    "http://feeds.arstechnica.com/arstechnica/business": [
        "Genetic testing company 23andMe declares bankruptcy",
        "You’ll be paying extra for ad-free Prime Video come January",
        "EA cracks down on modders selling their custom Sims 4 content",
        "HP wins huge fraud case against Autonomy founder and CEO Mike Lynch",
        "Ars online IT roundtable: What’s the future of the data center?"
    ],
    "http://feeds.feedburner.com/TechCrunch/": [
        "Top 10 AI Tools That Will Transform Your Content Creation in 2025",
        "LimeWire AI Studio Review 2023: Details, Pricing & Features",
        "Top 10 AI Tools in 2023 That Will Make Your Life Easier",
        "Top 10 AI Content Generator & Writer Tools in 2022",
        "Beginner Guide to CJ Affiliate (Commission Junction) in 2022"
    ],
    "http://thewalrus.ca/feed/": [
        "The Secret Language We Share with Our Children",
        "Weekly Quiz: Plastic Pollution, Indian Interference, and Toronto’s Multicultural Accent",
        "The Kids Are Leaning Right: How the Manosphere Is Shaping Voters",
        "The Toronto Accent Is Real",
        "Anti-Trans Narratives Are Creeping into This Election"
    ],
    "http://feeds.foxnews.com/foxnews/sports": [
        "Trump commends Rory McIlroy's 'tremendous courage' fighting for Masters win on Sunday: 'It was amazing'",
        "Tiger Woods congratulates Rory McIlroy for making rare golf history with Masters win: 'Welcome to the club'",
        "NCAA woman of the year among those killed in New York plane crash: 'Lost a lot of very good people'",
        "Kyren Lacy led deputies on police chase before dying of 'self-inflicted gunshot wound,' officials say",
        "Rory McIlroy beats Justin Rose in Masters playoff to win green jacket, complete Grand Slam"
    ],
    "http://feeds.lexblog.com/foodsafetynews/mRcs": [
        "West Virginia governor signs food dye ban into law",
        "Twelve E. coli cases under investigation in Latvia",
        "Australians warned about wild mushroom risk",
        "Nearly 900 cases of Coca-Cola recalled because of plastic contamination",
        "McDonald’s food safety ad: A rare move in a quiet industry"
    ],
    "http://www.theguardian.com/us/environment/rss": [
        "The rise of end times fascism | Naomi Klein and Astra Taylor",
        "Inside the fight to save California’s dying sea lions from toxic algae: ‘We’re like 911 operators’",
        "Mexico to send water to Texas farmers as US treaty threat grows",
        "Noaa fires hundreds of climate workers after court clears way for dismissals",
        "Trump administration cuts 4m to Princeton’s climate research funding"
    ],
    "http://www.sciencemag.org/rss/current.xml": [
        "Rules of engagement for condensins and cohesins guide mitotic chromosome formation | Science",
        "The genetic architecture of and evolutionary constraints on the human pelvic form | Science",
        "A distinct priming phase regulates CD8 T cell immunity by orchestrating paracrine IL-2 signals | Science",
        "A neuroimmune circuit mediates cancer cachexia-associated apathy | Science",
        "These two biologists found purpose—and love—trying to save Nigeria's bats"
    ],
    "http://www.thehindu.com/sci-tech/science/?service=rss": [
        "Studied over 21 years, new frog species ‘Leptobrachium aryatium’ named after Assam college",
        "With GenomeIndia, population-scale genomics comes of age in India",
        "Greenland’s melting ice, unstable fjords vex extraction of oil and minerals Trump covets",
        "BatEchoMon, India’s first automated bat monitoring, detection system",
        "The men who first split the atom"
    ],
    "http://twitchy.com/category/us-politics/feed/": [
        "‘I Love You’ Dem Cory Booker Embraces Transgenderism While Kissing Presidential Hopes Goodbye (WATCH)",
        "From Swigs to Swings: Ex-Marketing Exec Who Put a Bud Light in Dylan Mulvaney's Hand Tees Up at LIV Golf",
        "What Evidence? Cory Booker Plays the 'Orange Man Bad' Card to Justify Hearings on Trump Tariff 'Profits'",
        "British PM Starmer Continues His Assault on Western Culture by Making Downing Street Art Go WOKE",
        "Suspect Arrrested for Arson at PA Governor Josh Shapiro's Residence"
    ],
    "http://feeds.feedburner.com/IeeeSpectrumRoboticsChannel": [
        "Video Friday: Tiny Robot Bug Hops and Jumps",
        "Video Friday: RIVR Delivers Your Package",
        "How Dairy Robots Are Changing Work for Cows (and Farmers)",
        "Protecting Robots in Harsh Environments with Advanced Sealing Systems",
        "The Tiniest Flying Robot Soars Thanks to Magnets"
    ],
    "http://feeds.nbcnews.com/feeds/science": [
        "Celebrity-laden Blue Origin rocket set to launch Monday",
        "Trump signs executive order to boost U.S. coal industry, in part to fuel artificial intelligence",
        "A proposed tax credit could help homeowners hit by climate-fueled natural disasters",
        "Scientists genetically engineer wolves with white hair like the extinct dire wolf",
        "Rare virus that killed Gene Hackman's wife linked to 3 deaths in California town"
    ],
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_sport_2789.xml": [
        "Inspired Wales top group as England falter",
        "Delly’s amazing road to NBA glory",
        "Gal lines up SBW bout - and McGuire too",
        "Joey joins the Pommy campaign",
        "Titans v Sea Eagles: Five things we learned"
    ],
    "http://feeds.theguardian.com/theguardian/uk/sport/rss": [
        "With a little boldness and a lot of luck, McIlroy banishes ghosts of 2011 | Andy Bull",
        "Premier League: 10 talking points from the weekend’s action",
        "McLaren’s Oscar Piastri surges to dominant victory at Bahrain F1 GP",
        "‘Closer to our dreams’: Van Dijk proud as Liverpool move 13 points clear",
        "Cambridge sweep Oxford aside to maintain Boat Race dominance with double"
    ],
    "http://www.gamesindustry.biz/rss/gamesindustry_news_feed.rss": [
        "Sony announces price rises for PS5 consoles in Europe, UK, Australia, and New Zealand",
        "Influencer report highlights gender pay gap in sponsored content earnings",
        "Tariffs are an industry nightmare, but digital games seem safe – for now | Opinion",
        "Tequila Works auctions off game rights and IP following insolvency",
        "Video game M&A activity rises to 6.6 billion in Q1 2025, driven by mobile acquisitions"
    ],
    "http://www.digitaltrends.com/feed/": [
        "Rusty Rabbit review: wacky new platformer could have used a tune-up",
        "Nvidia’s RTX 5060 Ti could be 20 faster than the RTX 4060 Ti",
        "What happened to Amazon’s inaugural Project Kuiper launch?",
        "Trippy time-lapse shows Starlink satellites streak light across space",
        "Acer Swift AI 16 vs. Microsoft Surface Laptop 7: it’s close, but the same laptop remains at the top"
    ],
    "http://www.theguardian.com/sport/us-sport/rss": [
        "Rory McIlroy relieved to finally lift decade-long ‘burden’ with dramatic Masters win",
        "With a little boldness and a lot of luck, McIlroy banishes ghosts of 2011 | Andy Bull",
        "The Masters 2025: Rory McIlroy seals career grand slam after dramatic play-off – as it happened",
        "Clippers beat Warriors on final day of regular season to sink Golden State to play-in",
        "Rory McIlroy secures career grand slam with dramatic Masters playoff win over Justin Rose"
    ],
    "http://feeds.skynews.com/feeds/rss/entertainment.xml": [
        "Upstairs, Downstairs actress Jean Marsh dies",
        "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
        "Erin Brockovich: 'My chiropractor saw mud on my stiletto - I said, I've been collecting dead frogs'",
        "Menendez brothers' resentencing hearing can go ahead next week, says judge",
        "Ex-Abercrombie & Fitch boss 'unfit to stand trial'"
    ],
    "http://www.thehealthsite.com/comments/feed/": [
        "Comment on Sunita Williams Press Conference Live: NASA Astronaut To Share 9 Month Space Experience On March 31 – Where To Watch by Laurine Lowe",
        "Comment on Live News: Sunita Williams Considered Retirement Before Going To ISS – Family Shares NASA Astronaut’s Struggles In Space by jokerbet giriş",
        "Comment on Unexpected Delivery: Pregnant Woman Gives Birth On Bangkok Street Amid Strong Quake – WATCH VIDEO by jokerbet güncel",
        "Comment on Kamakhya Express Derails Near Odisha’s Cuttack: Impact of Train Accidents On Passengers’ Mental Health by jokerbet güncel giriş",
        "Comment on Unexpected Delivery: Pregnant Woman Gives Birth On Bangkok Street Amid Strong Quake – WATCH VIDEO by jokerbet giriş"
    ],
    "http://www.tigsource.com/feed/": [
        "Black Lives Matter",
        "The Wholesome Competition",
        "Dive into Early Access with We Need to go Deeper",
        "A Good Bundle – This is Fine",
        "Fantastic Arcade 2016"
    ],
    "http://feeds.feedburner.com/daily-express-sport-news": [
        "Masters LIVE: Rory McIlroy blanks Bryson DeChambeau as Tiger Woods shows true colours",
        "Rory McIlroy calls out Tiger Woods and three golf legends for their comments about him",
        "Rory McIlroy chokes back tears in Butler Cabin after winning Masters and career slam",
        "Rory McIlroy wins Masters and completes career Grand Slam after epic Justin Rose battle",
        "Rory McIlroy stuns Masters crowd after shot from trees 'falls from golfing heaven'"
    ],
    "http://www.dailymail.co.uk/auhome/index.rss": [
        "Fears for driver who ploughed into a woman and crashed into Sydney Harbour - as search desperate rescue operation unfolds",
        "Trump says there will be NO tariff exemptions in dramatic reversal that'll hit Americans hard",
        "One swimmer killed and another fighting for his life after friends pulled them from the surf",
        "Grim warning every homebuyer needs to hear as Peter Dutton proposes radical new housing plan that's never been tried before in Australia: 'Worst decision'",
        "Celebrity Big Brother's Mickey Rourke, 72, leaves Ella Rae Wise, 24, in tears after making vile sexual comment - before being removed from the house"
    ],
    "http://vitals.lifehacker.com/rss": [
        "Why Siri's AI Upgrades Keep Getting Pushed Back",
        "Hackers Stole Health Records From 1.6 Million Planned Parenthood Patients",
        "Microsoft Edge Recently Got a Speed Boost",
        "My Favorite Amazon Deal of the Day: Samsung's 'The Frame' TV",
        "40 Under-the-Radar Netflix Originals You Should Watch"
    ],
    "http://www.uncut.co.uk/feed": [
        "Hear Lana Del Rey’s new single, “Henry, come on”",
        "Brian Eno and Beatie Wolfe announce two collaborative albums",
        "Nick Drake: a Five Leaves Left box set is coming",
        "Send us your questions for Arthur Baker",
        "Stereolab announce new album, Instant Holograms On Metal Film"
    ],
    "http://feeds.theguardian.com/theguardian/politics/rss": [
        "Ministers scramble to keep Scunthorpe steelworks running – UK politics live",
        "UK MP refused entry to Hong Kong accuses China of ‘hidden blacklist’",
        "British Steel to deploy emergency measures to save Scunthorpe furnaces",
        "Ministers try to encourage Windrush compensation claims with £1.5m fund",
        "Claims of two-tier policing during 2024 summer riots ‘baseless’, report finds"
    ],
    "http://www.mirror.co.uk/tv/tv-news/rss.xml": [
        "Who is Eugene in The Last of Us season two? Character explained as fans left confused",
        "One of Netflix's most popular shows axed for reason that's infuriating fans",
        "The Last of Us fans 'work out' Joel Miller's tragic fate and predict season 2's 'crazy' ending",
        "Inside Disney+'s The Stolen Girl cast from Strike actress to One Day actors",
        "Kate Garraway in hospital dash as son Billy suffers nasty injury"
    ],
    "http://feeds.dailykos.com/dailykos/index.xml": [
        "Tariffs tank Trump. Plus, Booker talks his way to 2028",
        "Cartoon: Lil Chuck",
        "She was tracking post-Roe abortions. The government just pulled her funding",
        "Rural populations near federal lands worry job cuts will hurt their communities",
        "Republicans race to heap praise on Trump's tariffs as economy spirals"
    ],
    "http://www.thehindu.com/news/international/south-asia/?service=rss": [
        "Explained | The BRICS common currency push",
        "When did humans first arrive in Southeast Asia?",
        "Why It Matters | Using disposable diapers to make concrete?",
        "Data | Nearly 40 Indians paid bribes to use public services, highest among most Asian nations",
        "Death sentences of 15 convicts upheld in murder case"
    ],
    "http://www.healthcareitnews.com/home/feed": [
        "Tackling coding workforce shortage in Australia",
        "Google's genAI powers pharmacy, nurse handoff automation at Manipal Hospitals",
        "Seoul to back startups in accessing hospital data and more briefs",
        "Cedars-Sinai CAIO: AI is transforming relationship between caregivers and IT",
        "Dayton VAMC rolls out IT upgrades ahead of EHR transition"
    ]
}