{
    "http://feeds.foxnews.com/foxnews/sports": [
        "Dave Portnoy waves Israel flag in celebration after Holocaust denier Bryce Mitchell gets choked out at UFC 314",
        "Kyren Lacy's death sends shock waves through sports world: 'Check on your people'",
        "Tigers pitching prospect, son of Masters competitor, picks up 1st career MLB win",
        "Kyren Lacy, former LSU star wide receiver and NFL hopeful, dead at 24",
        "NASCAR drivers Sheldon Creed, Brennan Poole involved in serious crash at Bristol"
    ],
    "http://www.theguardian.com/sport/us-sport/rss": [
        "The Masters 2025: final round at Augusta – live",
        "NFL draft prospect Kyren Lacy dies at 24 amid fatal car crash charges",
        "Cubs rout reigning champs 16-0 in Dodgers’ worst-ever home shutout",
        "Unification deal no closer as PGA Tour ponders bid for Ryder Cup stake",
        "Donald Trump feted with standing ovation as he enters UFC 314 in Miami"
    ],
    "http://feeds.feedburner.com/TheAustralianPolitics": [
        "Culleton lodges appeal",
        "Turnbull dinner cost 30k",
        "Security focus for Abe visit",
        "Judge anger on 10 art claim",
        "Centrelink data to be ‘refined’"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Sports.xml": [
        "Why Steve Kerr Thinks the N.B.A. Regular Season Has Too Many Games",
        "The Most Disappointing N.H.L. Players of the Season",
        "The Allure of Dressing for the Masters Will Never Go Out of Style",
        "Play Connections: Sports Edition. Tackle Today’s Puzzle.",
        "The Best-Case Scenario for Shedeur Sanders in the N.F.L. Draft"
    ],
    "http://www.dailymail.co.uk/sport/index.rss": [
        "The Masters 2025 Final Round LIVE: Leaderboard and updates with Rory McIlroy's lead GONE after world No 2 found water on the 13th as Justin Rose goes level at the top amid brilliant run",
        "Robin Goodfellow's racing tips: Best bets for Monday, April 14",
        "Newcastle 4-1 Man United - PLAYER RATINGS: Which Red Devils man was uncomfortable from the start? How did teenager Harry Amass fare? And who produced a brilliant all-round display for the Magpies?",
        "Boat Race collision chaos almost sees team disqualified and leads to delay just minutes in - as cox unleashes X-rated verbal tirade",
        "Wolves 4-2 Tottenham: Ange Postecoglou's side suffer 17th Premier League defeat after being dismantled by Vitor Pereira's men"
    ],
    "http://www.dailymail.co.uk/news/index.rss": [
        "Counter-terror police lead probe after Manchester Arena bomber's brother attacks prison guards with makeshift weapon and scalding oil - stabbing one in the neck, as critics condemn 'spectacular breach of security'",
        "Labour's net zero crusader Ed Miliband has a carbon footprint 12 times higher than the average Briton",
        "Ukraine could be carved up 'like Germany after World War Two' as part of US-backed peace deal in bid to end war - as Trump envoy meets with Putin at the same time Russian drones bring terror to Kyiv",
        "Labour's ex-City Minister likely to have arrest warrant issued against her on 'corruption' charges",
        "Our neighbour from hell groomed us... and then left us on the brink of suicide - he ruined our lives"
    ],
    "http://feeds.feedburner.com/DiscoverTopStories": [
        "5 of the Biggest Extraterrestrial Impacts That Moved Oceans and Made Moons",
        "Watch How Male Fiddler Crabs Beat Sand Like a Drum to Attract Mates",
        "Sleep’s Surprising Role in Strengthening Long-Term Memory",
        "A Black Hole Awakens in a Distant Galaxy, Producing X-Ray Bursts",
        "The Stunning Lyrid Meteor Shower 2025 Peaks This Month — Here's What to Know"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Upshot.xml": [
        "Musk’s Latest Fraud Finding Isn’t What It Seems",
        "Why I.R.S. Audits, Already at Their Lowest Levels, May Fall Further",
        "The Three States That Are Especially Stuck if Congress Cuts Medicaid",
        "How Musk and Trump Are Working to Consolidate Government Data About You",
        "The Pandemic Is Not the Only Reason U.S. Students Are Losing Ground"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Politics.xml": [
        "Rubio Says 10 More People Have Been Expelled to El Salvador",
        "Democrats Widely Blast Trump’s Tariffs, but Not Tariffs Overall",
        "White House Releases Results of Trump’s Annual Physical Exam",
        "Bernie Sanders Attacks Trump’s Policies During Surprise Coachella Appearance",
        "Trump Signals New Tariffs on Chips, Calling Exclusions Temporary"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Business.xml": [
        "China Halts Critical Rare Earth Exports as Trade War Intensifies",
        "Trump’s Tariff War Has Added Risk to U.S. Bonds, Long the Surest Bet in Global Finance",
        "A Devastating Trade Spat With China Shows Few Signs of Abating",
        "The Treasury Secretary Is Wrong About How Most Retirees See the Stock Market",
        "How Should You Invest in 529 College Savings Plans During Market Swings?"
    ],
    "http://feeds.newscientist.com/science-news": [
        "'Quantum Darwinism' may explain why we live in a shared reality",
        "What the surprising lives of solitary animals reveal about us",
        "How to spot Haumea, one of the solar system's strangest objects",
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind"
    ],
    "http://thecaucus.blogs.nytimes.com/feed/": [
        "Rubio Says 10 More People Have Been Expelled to El Salvador",
        "Democrats Widely Blast Trump’s Tariffs, but Not Tariffs Overall",
        "White House Releases Results of Trump’s Annual Physical Exam",
        "Bernie Sanders Attacks Trump’s Policies During Surprise Coachella Appearance",
        "Trump Signals New Tariffs on Chips, Calling Exclusions Temporary"
    ],
    "http://time.com/newsfeed/feed/": [
        "The 20 Best Halloween TV Episodes of All Time",
        "Watch the Biggest Moments From King Charles III’s Coronation",
        "How the World Is Reacting to Shinzo Abe’s Death",
        "Sanctions Won’t Hurt Myanmar’s Brutal Leaders, Activists Say. Here’s What Could",
        "Here Are the Most ‘Attractive’ Global Cities. But Can They Keep Their Edge in the Post-Pandemic World?"
    ],
    "http://www.abc.net.au/news/feed/46182/rss.xml": [
        "Live: ASX set to rise after Wall Street rally on Fed's assurances",
        "It was considered the art heist of the century. But who stole the Mona Lisa?",
        "Live: Albanese campaigns in Adelaide as Dutton moves to shore up Brisbane"
    ],
    "http://feeds.bbci.co.uk/news/world/asia/india/rss.xml": [
        "Indian pot belly: From status symbol to silent killer",
        "ICC forms taskforce to help Afghan female players",
        "Trump exempts smartphones and computers from new tariffs",
        "Will trade-shy India gain edge in tariff-driven slowdown?",
        "Indian man who fed water to cheetahs in viral video restored in job"
    ],
    "http://www.express.co.uk/posts/rss/79/showbiznews": [
        "Full list of BBC stars who have died in 2025 in tragic year for broadcaster",
        "Amanda Owen shares family update as Ravenseat hit with 'hurdles to overcome'",
        "Grace season 5 Dead at First Sight cast explored Unforgotten star and major new actor join",
        "Iconic reggae singer dies aged 80 as fans pay tribute",
        "Great British Bake Off star pregnant with first baby after '9 years of infertility'"
    ],
    "http://www.chron.com/rss/feed/AP-Technology-and-Science-266.php": [
        "Report: Baylor officials did nothing after being notified of assaults",
        "Historic domes of Hagia Sophia are renovated to protect the landmark from earthquakes",
        "Japanese leader says he hopes Osaka expo will help reunite a divided world",
        "Doctors remove pig kidney from an Alabama woman after a record 130 days",
        "Alert: An Alabama woman who lived with a pig kidney for a record 130 days had the organ removed and is back on dialysis"
    ],
    "http://www.theguardian.com/football/rss": [
        "‘Closer to our dreams’: Van Dijk proud as Liverpool move 13 points clear",
        "Manchester United reach Women’s FA Cup final after Bizet and Clinton sink City",
        "Howe remains in hospital but Tindall sure Newcastle win has ‘lifted his spirits’",
        "Peterborough shock Birmingham in final to retain Vertu Trophy",
        "European football: Mbappé sees red but Real Madrid hold on against Alavés"
    ],
    "http://www.nasa.gov/rss/dyn/breaking_news.rss": [
        "Sols 4507-4508: “Just Keep Driving”",
        "NASA-Developed Tools at Marshall Support Operations to Space Station",
        "GLOBE Mission Earth Supports Career Technical Education",
        "Apollo 13 Launch: 55 Years Ago",
        "NASA’s IMAP Arrives at NASA Marshall For Testing in XRCF"
    ],
    "http://www.sikhsiyasat.com/feed/": [
        "Issue of Sri Guru Granth Sahib Ji’s Saroop – Who Are The Real Culprits?",
        "How Gurbani Strengthened Me in Prison Cells: Exclusive Talk with Bhai Lal Singh Akalgarh",
        "Where Are Missing Saroops of Guru Granth Sahib: Analysing SGPC’s Reactions, Response & Actions",
        "Khalsa Jee Ke Bol Baaley : Guru Khalsa Panth – Dr. Gurpreet Singh During Discussion by Samvad",
        "Why Akal Takht Sahib Acting Jathedar Suddenly Announced to Honour 11 Sikh Personalities"
    ],
    "http://feeds.skynews.com/feeds/rss/entertainment.xml": [
        "Upstairs, Downstairs actress Jean Marsh dies",
        "Erin Brockovich: 'My chiropractor saw mud on my stiletto - I said, I've been collecting dead frogs'",
        "Menendez brothers' resentencing hearing can go ahead next week, says judge",
        "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
        "Ex-Abercrombie & Fitch boss 'unfit to stand trial'"
    ],
    "http://economictimes.indiatimes.com/rssfeedsdefault.cms": [
        "How to Calculate Dividend Yield: A key metric for income investors",
        "How to calculate the EV to MCAP Ratio and why it matters for investors",
        "5 of top 10 valued firms add Rs 84,559 crore in valuation last week; HUL major gainer",
        "FPIs withdraw Rs 31,575 cr from equities in Apr on US tariff jitters",
        "ETMarkets PMS Talk: We’re not fighting fund managers—we’re fighting under performance’, says Sankarsh Chanda"
    ],
    "http://www.thehindu.com/news/national/?service=rss": [
        "Northeast’s first robotic surgery facility unveiled in Assam",
        "Over 50 posts on ‘fake and misleading’ content on Kancha Gachibowli land row deleted; BRS, Union Minister’s accounts featured",
        "Tearful farewell to eco-warrior Vanajeevi Ramaiah",
        "Devotion, dhols, and delicious delights mark Baisakhi in Hyderabad",
        "Stalin to chair meeting with V-Cs, Registrars on April 16"
    ],
    "http://feeds.bbci.co.uk/news/health/rss.xml": [
        "Three million child deaths linked to drug resistance, study shows",
        "Cancer pill gave me 'four years of extra time'",
        "Saliva test may turn tide on prostate cancer, claim scientists",
        "What goes on inside toddlers' brains?",
        "Infected blood victims losing faith as inquiry hearings restart"
    ],
    "http://www.standard.co.uk/news/rss": [
        "Upstairs, Downstairs actress and co-creator Jean Marsh dies aged 90",
        "Teenager, 17, shot dead parents as part of Trump assassination plot, says FBI",
        "Man found dead after suspected gas explosion in Nottinghamshire home",
        "Government to review how ‘Manchester bomb plotter could attack prison guards’",
        "Siddiq denies wrongdoing as reports say Bangladesh court issues arrest warrant"
    ],
    "http://zeenews.india.com/rss/india-national-news.xml": [
        "`West Bengal Has Become A Light Version Of Bangladesh`: Sukanta Majumdar Slams Mamata Banerjee Over Murshidabad Violence",
        "Huge Protest In Hyderabad Against Waqf Amendment Act",
        "Mayawati Accepts Nephew Akash Anand`s Public Apology, Re-Inducts Him In BSP",
        "BJP Stages Protest In Kolkata over Murshidabad Violence, SSC Recruitment Scam",
        "Karnataka Horror: Man Accused Of Kidnapping, Murdering 5-Year-Old Girl Killed In Encounter"
    ],
    "http://feeds.feedburner.com/TheAustralianMediaNews": [
        "Advertising adds up to 40bn",
        "Chris Wharton’s starring role",
        "Fairfax-APN fears outlined",
        "Trump dumps ‘phony’ Post",
        "Delta puts Nine back in ratings"
    ],
    "http://metro.co.uk/entertainment/gaming/feed/": [
        "Nintendo Switch 2 games are not too expensive – Reader’s Feature",
        "Rising costs are turning video games into something only for the rich – Reader’s Feature",
        "Nintendo are repeating some very old mistakes with the Switch 2 – Reader’s Feature",
        "Ex-Nintendo fan sells PS5 Pro to buy Switch 2 – Reader’s Feature",
        "UK retailer GAME sells its office furniture as part of shut down"
    ],
    "http://www.techrepublic.com/rssfeeds/blog/european-technology/": [
        "EU AI Rules Delay Tech Rollouts, But Civil Societies Say Safety Comes First",
        "Meta Unveils Llama 4 AI Series Featuring New Expert-Based Architecture",
        "Trump’s Tariffs: Will They Affect Your Tech Prices?",
        "North Korean Hackers Disguised as IT Workers Targeting UK, European Companies, Google Finds",
        "Apple Rolls Out iOS 18.4 With New Languages, Emojis & Apple Intelligence in the EU"
    ],
    "http://feeds.feedburner.com/TheAustralianBusNews?format=xml": [
        "Agent payouts to shift stock",
        "‘ALP’s NBN needs extra 10bn’",
        "Three in race for port sale",
        "Chinese airlines eye Qantas",
        "Fairfax-APN fears outlined"
    ],
    "http://musiccanada.com/feed/": [
        "Music Canada celebrates the 50th anniversary of the Gold & Platinum Certification Program at the JUNOS",
        "IFPI’s Global Music Report 2025 reveals tenth consecutive year of growth",
        "Music Canada’s Gold & Platinum program celebrates 50 years",
        "Music Canada and DIMA issue joint letter to CRTC following Canadian content audio workshops",
        "Canada needed a reimagined broadcasting system. The CRTC’s contribution decision offers more of the same while risking the important role played by licensed streaming in building the careers of artists."
    ],
    "http://feeds.harvardbusiness.org/harvardbusiness?format=xml": [
        "Should You Record That Meeting?",
        "How Contracts Can Help Firms Navigate the Uncertainty of Global Tariffs",
        "What Is the Office for Today?",
        "Understanding the Global Macroeconomic Impacts of Trump’s Tariffs",
        "How People Are Really Using Gen AI in 2025"
    ],
    "http://feeds.feedburner.com/EtsBreakingNews": [
        "Best Shampoo For Colored Hair",
        "Karl Soderlund, Sally Jessy Raphael’s Husband, Dead at 90",
        "The Best Diaper Bag That Is Chic and Functional -- LeSportsac, Herschel, Rebecca Minkoff and More",
        "'AGT': Daredevil Annaliese Nock Terrifies Judges With Wheel of Death Stunt",
        "Justin Hartley's Ex-Wife and Daughter Support Him As Chrishell Stause Split Plays Out on 'Selling Sunset'"
    ],
    "http://www.newyorker.com/feed/news": [
        "What the World Learned from Donald Trump’s Tariff Week",
        "So You Want to Be a Dissident?",
        "Sayaka Murata’s Alien Eye",
        "The Dire Wolf Is Back",
        "Bluesky’s Quest to Build Nontoxic Social Media"
    ],
    "http://www.nytimes.com/services/xml/rss/nyt/Health.xml": [
        "The Many Ways Kennedy Is Already Undermining Vaccines",
        "Experts Doubt Kennedy’s Timetable for Finding the Cause of Autism",
        "RFK Jr. Accuses FDA of Drug Industry Influence That Barred Alternative Remedies",
        "Pig Kidney Removed From Alabama Woman After Organ Rejection",
        "Trump Administration Delays Plan to Limit Pricey Bandages"
    ],
    "http://feeds.feedburner.com/Rpgcast": [
        "RPG Cast – Episode 764: “Cool Ranch Switch Cartridges”",
        "RPG Cast – Episode 763: “Dollar Store King’s Field”",
        "RPG Cast – Episode 762: “Cautiously Pessimistic”",
        "RPG Cast – Episode 761: “It’s Chaos Legion, I Swear”",
        "RPG Cast – Episode 760: “Outdoor Gods”"
    ],
    "http://www.dnaindia.com/rss.xml": [
        "Good Bad Ugly box office collection day 4: Ajith Kumar film remains steady, earns Rs 84 crore in extended weekend",
        "IPL 2025, DC vs MI: Mumbai Indians hands Delhi Capitals first defeat of the season with 12-run win in nail-biting contest",
        "Jaat box office collection day 4: Sunny Deol, Randeep Hooda film earns more than its opening day, earns Rs...",
        "Meet Karun Nair's beautiful wife, the woman behind Delhi Capitals star's success",
        "L2 Empuraan is highest-grossing Malayalam film globally but still lags behind this Malayalam film in India that earned Rs..."
    ],
    "http://thewalrus.ca/feed/": [
        "The Secret Language We Share with Our Children",
        "Weekly Quiz: Plastic Pollution, Indian Interference, and Toronto’s Multicultural Accent",
        "The Kids Are Leaning Right: How the Manosphere Is Shaping Voters",
        "The Toronto Accent Is Real",
        "Anti-Trans Narratives Are Creeping into This Election"
    ],
    "http://feeds.lexblog.com/foodsafetynews/mRcs": [
        "West Virginia governor signs food dye ban into law",
        "Twelve E. coli cases under investigation in Latvia",
        "Australians warned about wild mushroom risk",
        "Nearly 900 cases of Coca-Cola recalled because of plastic contamination",
        "McDonald’s food safety ad: A rare move in a quiet industry"
    ],
    "http://feeds.feedburner.com/IeeeSpectrumFullText": [
        "Video Friday: Tiny Robot Bug Hops and Jumps",
        "Climb the Career Ladder with Focused Expertise",
        "IEEE TryEngineering STEM Grants Fund Over 50 Projects",
        "The Great Chatbot Debate: Do They Really Understand?",
        "First Supercritical CO2 Circuit Breaker Debuts"
    ],
    "http://rss.sciam.com/ScientificAmerican-News": [
        "Stunning Comet Could Photobomb This April's Total Solar Eclipse",
        "The Industrial Designer behind the N95 Mask",
        "An Evolutionary 'Big Bang' Explains Why Snakes Come in So Many Strange Varieties",
        "JWST Is Tracking Down the Cosmic Origins of Earth's Water",
        "Flimsy Antiabortion Studies Cited in Case to Ban Mifepristone Are Retracted"
    ],
    "http://www.dynamicbusiness.com.au/feed": [
        "Aisento: AI agents for digital tasks",
        "VogelMacaw: Financial management tool",
        "WPSmartPay: Modern payment solution for WordPress",
        "WPCommerz: Product recommendation tool for WooCommerce",
        "VideoToBlog: Video to blog convertor"
    ],
    "http://www.dnaindia.com/feeds/entertainment.xml": [
        "Good Bad Ugly box office collection day 4: Ajith Kumar film remains steady, earns Rs 84 crore in extended weekend",
        "Jaat box office collection day 4: Sunny Deol, Randeep Hooda film earns more than its opening day, earns Rs...",
        "L2 Empuraan is highest-grossing Malayalam film globally but still lags behind this Malayalam film in India that earned Rs...",
        "Govinda is 'mentally disturbed', talked to his dead mother for two hours on film set; KRK makes shocking claim: 'Usne apna career khud khatam kiya hai'",
        "Neetu Kapoor remembers Rishi Kapoor on engagement anniversary with priceless throwback photo"
    ],
    "http://www.thenation.com/rss/articles": [
        "This Passover, We Must Examine the Indecent Betrayal by Our Own",
        "Mr. Douglass in the Room",
        "Bond Vigilantes Are Now the Unchallenged Kings Thanks to a Feckless Congress and Reckless Trump",
        "Taking Action",
        "9 Ways You Can Save the Internet Right Now"
    ],
    "http://feeds.feedburner.com/motherjones/Politics": [
        "The Intercept Discloses Top-Secret NSA Document on Russia Hacking Aimed at US Voting System",
        "Trump's Tweets Threaten His Travel Ban's Chances in Court",
        "Republican Congressman on Suspected Islamic Radicals: Kill Them All",
        "How Trump and His Allies Have Run With Russian Propaganda",
        "In 3 Months, 3 Immigrants Have Died at a Private Detention Center in California"
    ],
    "http://feeds.slate.com/slate-101526": [
        "Ever Wonder How Generations Get Their Names? One Man Is to Blame—but Not Everyone’s Happy About It.",
        "My Daughter Finally Gave the Neighbor’s Kid a Taste of His Own Medicine. But She Might’ve Gone Too Far.",
        "Slate Mini Crossword for April 13, 2025",
        "Slate Crossword: Where You Might See Touchdowns in Chicago? (Five Letters)",
        "He Used to Write About Movies. Now He’s America’s Most Prominent Guide to Poetry."
    ],
    "http://feeds.skynews.com/feeds/rss/politics.xml": [
        "Minister says he wouldn't bring China into 'sensitive' steel industry again",
        "Bangladesh issues arrest warrant for Tulip Siddiq - as she denies claims against her",
        "Emergency bill to protect British Steel becomes law",
        "A sticking plaster, not a solution: What next for British Steel?",
        "MP refused entry to Hong Kong to visit newborn grandson"
    ],
    "http://www.tmz.com/rss.xml": [
        "Menendez Family Blames L.A. District Attorney's Office for Terry Baralt's Hospitalization",
        "Kylie Jenner, Travis Scott's Daughter Supports Dad at Late-Night Coachella Set",
        "Aimee Lou Wood Calls 'SNL' Parody of Her 'Mean' and 'Unfunny'",
        "'Willow' Actress and Emmy Winner Jean Marsh Dead at 90",
        "Erik and Lyle Menendez's Aunt, Terry Baralt, Found Unresponsive in Hotel"
    ],
    "http://www.dailymail.co.uk/auhome/index.rss": [
        "Kyren Lacy's father breaks his silence as he issues stark warning after death of his NFL prospect son at 24",
        "LIV Golf makes shock woke hire with exec who tanked Bud Light with controversial trans campaign",
        "'Catastrophic' scenes as Mary Fowler goes down with a knee injury in big match: 'It doesn't look great'",
        "Trump says there will be NO tariff exemptions in dramatic reversal that'll hit Americans hard",
        "Two charged after boy dies was accidentally shot in the neck and died on a Windellama farm"
    ],
    "http://www.espncricinfo.com/rss/content/story/feeds/6.xml": [
        "RCB extend winning run away from home as Kohli and Salt sink Royals",
        "Samson backs himself to lead Royals youngsters to IPL glory",
        "Fleming: 'We were sloppy in the field, we lacked accuracy under pressure'",
        "Kashvee gets maiden call-up, regulars return for ODI tri-series in Sri Lanka",
        "Hardik says MI bowlers 'didn't have anywhere to hide' on a 'tough track'"
    ],
    "http://www.theguardian.com/science/rss": [
        "Lauren Sanchez’s all-female space flight is about to blast off – and will challenge Elon Musk’s SpaceX",
        "What I’ve learned after 40 years as the Observer’s science editor",
        "Jawbone fossil builds richer image of ancient Denisovans",
        "Greek vase ‘looted’ in Italy removed from sale by London gallery",
        "At-home saliva test for prostate cancer better than blood test, study suggests"
    ],
    "http://feeds.nbcnews.com/feeds/science": [
        "Celebrity-laden Blue Origin rocket set to launch Monday",
        "Trump signs executive order to boost U.S. coal industry, in part to fuel artificial intelligence",
        "A proposed tax credit could help homeowners hit by climate-fueled natural disasters",
        "Scientists genetically engineer wolves with white hair like the extinct dire wolf",
        "Rare virus that killed Gene Hackman's wife linked to 3 deaths in California town"
    ],
    "http://www.journaldemontreal.com/spectacles/rss.xml": [
        "«Ta fille est dans Hitster»: le jeu musical qui fait fureur auprès des Québécois et de nos artistes",
        "«Dans quelle job apprends-tu devant tout le monde, à part premier ministre du Canada?»: Rosalie Vaillancourt se confie sur sa co-animation de l'émission «Sortez-moi d'ici»",
        "«Je suis fasciné par le magma humain», confie l'acteur français Daniel Auteuil, qui réalise le film «Le fil»",
        "Hitster: des chansons choisies par et pour le Québec",
        "«Elle avait une ardente volonté de réussir»: la vie tumultueuse de la chanteuse Sylvie Vartan, racontée dans une biographie non autorisée"
    ],
    "http://feeds.bbci.co.uk/news/health/rss.xml?edition=us": [
        "Three million child deaths linked to drug resistance, study shows",
        "Cancer pill gave me 'four years of extra time'",
        "Saliva test may turn tide on prostate cancer, claim scientists",
        "What goes on inside toddlers' brains?",
        "Infected blood victims losing faith as inquiry hearings restart"
    ],
    "http://www.bollywoodhungama.com/rss/news.xml": [
        "Anurag Kashyap REACTS with a sarcastic comment as Phule faces censorship over caste references after Dhadak 2",
        "Shanaya Kapoor to play double role in Student Of The Year 3, shoot to kick off from April 20: Report",
        "Raashii Khanna drops subtle glimpse of her role in the upcoming project",
        "Vikrant Massey growing his beard for the role of Gurudev Sri Sri Ravi Shankar?",
        "Nora Fatehi and Jason Derulo’s ‘Snake’ slithers to rank 1 on UK British Asian Music Charts"
    ],
    "http://feeds.feedburner.com/ScottishNewsHeraldScotland": [
        "'Highly regarded' Scottish company collapses after 40 years with all jobs lost",
        "'Our time is up': Popular Glasgow café announces shock closure",
        "John Swinney faces criticism over £20,000 pay rise to Scottish Government Ministers",
        "The secret of Murray Hall, the Scot whose death scandalised New York",
        "The far-right links behind Facebook scare stories of 'children being filmed in parks'"
    ],
    "http://time.com/health/feed/": [
        "Ex-FDA Official Is Worried About the FDA’s New “Anti-Vaccine Tone”",
        "The Two Words to Say When Someone Comments on Your Hygiene",
        "Title X Freeze Widely Threatens Health Care Access",
        "Invasive Strep Infections Are Rising in the U.S.",
        "Can Eating Certain Foods Really Help You Get Pregnant?"
    ],
    "http://qz.com/feed": [
        "Netflix, Goldman Sachs, Citigroup, and more stocks to watch this week",
        "The 8 most chaotic airports in America",
        "Apple, Nvidia, and Microsoft can 'breathe a huge sigh of relief' after Trump's China tariff exemptions",
        "Apple's 'complete disaster,' Microsoft's tariff uncertainty, and Amazon's vibe: Tech news roundup",
        "Tesla's moment of truth, Trump Media stock spikes, and Warren Buffett wins again: Markets news roundup"
    ],
    "http://cogconnected.com/feed/": [
        "Monster Energy Supercross 25 Review – Muddy and Mediocre",
        "Sizzling Sarah Spectre TikTok Cosplay",
        "A Decade of Adventure: Elder Scrolls Online Enters a Bold New Era",
        "Hook: Complete Edition Is Coming to Xbox and Switch Today",
        "Creepy Redneck Dinosaur Mansion 3 Just Dropped Its Release Date Trailer"
    ],
    "http://www.manchestereveningnews.co.uk/rss.xml": [
        "Man City next transfer priority as Ilkay Gundogan triggers new deal",
        "Katy Perry speaks out ahead of being sent to space in Blue Origin mission",
        "25 places kids can eat for free or from £1 during the Easter holidays",
        "Rory McIlroy's incredible net worth, wife and divorce U-turn",
        "Upstairs, Downstairs icon Jean Marsh dies"
    ],
    "http://www.standard.co.uk/lifestyle/rss": [
        "A ballet retreat in the Maldives changed my outlook — here's why everyone should do a hobby holiday",
        "Mickey Rourke controversy explained — why was he kicked off Celebrity Big Brother?",
        "Patsy Ferran Neko Health scans Cartier tiaras What's hot (and not) this week",
        "Creta Maris: the Greek hotel changing the face of family-friendly all-inclusives"
    ],
    "http://feeds.feedburner.com/TheAustralianSportsNews": [
        "Legal big gun to help Blues",
        "Rioli wins place among greats",
        "Rich continue their rebellion",
        "Lealiifano has new focus",
        "Taxman joins gold rush"
    ],
    "http://www.theguardian.com/world/usa/rss": [
        "US deports 10 more alleged gang members to El Salvador, says Rubio",
        "Four injured in reported house explosion in Texas, authorities say",
        "Trump is ‘fully fit’ and manages high cholesterol, says White House physician",
        "Gordon Brown accuses Trump of ‘weaponising’ global trade system",
        "Democrat Gretchen Whitmer tries to distance herself from Oval Office visit"
    ],
    "http://www.giantbomb.com/feeds/mashup/": [
        "The Community Spotlight 2025.04.12",
        "265 - Mr. Lasagna",
        "Unprofessional Fridays: Supermarket Together",
        "Marvel Rivals Season 2",
        "GameBreaking News 04/11/25"
    ],
    "http://toucharcade.com/feed/": [
        "The Reports of Our Death Have Been Mildly Exaggerated – The TouchArcade Show 612",
        "Nintendo Switch Part Deux – The TouchArcade Show 611",
        "Where Have We Been? – The TouchArcade Show 610",
        "Polar Express is SCARY – The TouchArcade Show 609",
        "Remember Payphones? – The TouchArcade Show 608"
    ],
    "http://www.cnet.com/rss/gaming/": [
        "Today's NYT Strands Hints, Answers and Help for April 14, 407",
        "Today's NYT Connections Hints, Answers and Help for April 14, 673",
        "Today's Wordle Hints, Answer and Help for April 14, 1395",
        "Still Need to File Your Taxes? See If You Qualify to File Head of Household",
        "I Slashed My Streaming Costs Without Missing a Single Show"
    ],
    "http://feeds.bbci.co.uk/sport/0/rss.xml?edition=uk": [
        "Watch: Match of the Day 2",
        "'We had to put a smile on his face' - Newcastle dedicate win to Howe",
        "'A fascinating contrast between team-mates and title contenders'",
        "Bayindir's failed Man Utd audition offers Onana dilemma",
        "Salah laps up contract acclaim - now Van Dijk may follow 'next week'"
    ],
    "http://feeds.feedburner.com/BreakingScienceNews?format=xml": [
        "Bizarre New Species of Therizinosaur Had Two-Fingered Hands",
        "KATRIN Physicists Measure Upper Mass Limit of Neutrino",
        "Pleistocene-Age Denisovan Fossil Found in Taiwan",
        "New Genomic Research Sheds More Light on Evolutionary History of Mammoths",
        "Astronomers Measure Rotation Rate of Uranus with Unprecedented Precision"
    ],
    "http://feeds.foxnews.com/foxnews/politics": [
        "Results of President Trump's physical released, here's what they say",
        "Video of Trump allegedly 'snubbing' actress Cheryl Hines spreads like wildfire but doesn't show full picture",
        "SCOOP: Arizona to begin removing as many as 50K noncitizens from voter rolls following lawsuit",
        "Bernie Sanders takes Coachella stage to rail against Trump, 'billionaire class' at high-dollar music festival",
        "Warren demands SEC investigate Trump for insider trading, accuses him of unleashing 'chaos' with tariffs"
    ],
    "http://www.thehindu.com/entertainment/?service=rss": [
        "‘One Piece’ interview: How Usopp and Sanji became intergenerational role models among the Straw Hats",
        "Maranamass movie review: A few doses of ingenuity and a mix of idiosyncratic characters drive this film",
        "‘Maine Pyar Kiya’ first look poster released",
        "Actor, screenwriter and producer Kalaipuli G Sekaran passes away at 73",
        "Aamir Khan makes first public appearance with Gauri Spratt at Macau International Comedy Festival in China; pictures out"
    ],
    "http://www.npr.org/rss/rss.php?id=5": [
        "The Science in Science FIction",
        "After 11 Years Behind The Host Mic, Neal Conan Signs Off",
        "Hopes And Fears For The Future Of The World, With Ted Koppel",
        "What's The Talk Of Your Nation?",
        "So Hard To Say Goodbye: Advice For Farewell Notes"
    ],
    "http://www.thehindubusinessline.com/news/?service=rss": [
        "17 companies central forces deployed, 150 held so far in trouble-torn Murshidabad district in West Bengal",
        "China's trade hubs show strain as tariff war with US escalates",
        "Macrotech acquires 10 land parcels in FY25 for 24,000-cr housing projects",
        "Virat Kohli invests in aspirational sportswear brand Agilitas as company plans to go global",
        "Parliamentary panel recommends independent survey, revamp of MGNREGS"
    ],
    "http://www.newyorker.com/feed/culture": [
        "Jeff Bridges Is Digging It",
        "Can Reality TV Redeem Jake and Logan Paul?",
        "TikTok and the Retreat from Technological Globalization",
        "Will A.I. Save the News?",
        "The Trump Show Comes to the Kennedy Center"
    ],
    "http://www.thehindu.com/news/cities/?service=rss": [
        "Over 50 posts on ‘fake and misleading’ content on Kancha Gachibowli land row deleted; BRS, Union Minister’s accounts featured",
        "Tearful farewell to eco-warrior Vanajeevi Ramaiah",
        "Devotion, dhols, and delicious delights mark Baisakhi in Hyderabad",
        "Will make Delhi a hub of medical tourism: Gupta",
        "DDA scripts a turnaround story after a decade of losses"
    ],
    "http://feeds.theguardian.com/theguardian/science/rss": [
        "Lauren Sanchez’s all-female space flight is about to blast off – and will challenge Elon Musk’s SpaceX",
        "What I’ve learned after 40 years as the Observer’s science editor",
        "Jawbone fossil builds richer image of ancient Denisovans",
        "Greek vase ‘looted’ in Italy removed from sale by London gallery",
        "At-home saliva test for prostate cancer better than blood test, study suggests"
    ],
    "http://www.uncut.co.uk/feed": [
        "Hear Lana Del Rey’s new single, “Henry, come on”",
        "Brian Eno and Beatie Wolfe announce two collaborative albums",
        "Nick Drake: a Five Leaves Left box set is coming",
        "Send us your questions for Arthur Baker",
        "Stereolab announce new album, Instant Holograms On Metal Film"
    ],
    "http://www.thehindu.com/news/international/south-asia/?service=rss": [
        "Explained | The BRICS common currency push",
        "When did humans first arrive in Southeast Asia?",
        "Why It Matters | Using disposable diapers to make concrete?",
        "Data | Nearly 40 Indians paid bribes to use public services, highest among most Asian nations",
        "Death sentences of 15 convicts upheld in murder case"
    ],
    "http://www.destructoid.com/?mode=atom": [
        "The 10 best UNO editions, ranked",
        "All EA FC 25 Immortality League rewards and tasks",
        "Golazo EA FC 25 Evolution: Best players to use",
        "Wuthering Waves 2.3 livestream date and countdown",
        "How to solve the Secret Garden Puzzle in Blue Prince"
    ],
    "http://www.dnaindia.com/feeds/scitech.xml": [
        "Is your WhatsApp down too? Several users claim they are unable to upload status, send texts",
        "Pink Moon 2025: Check date, time and where to watch this 'Micromoon' from India?",
        "Neelima Chowdary Mulpuri: Engineering the future of agile through the lens of artificial intelligence",
        "Artificial Intelligence Explained: What is AI, how it works, where it is used, can it replace human beings?",
        "Is it Game of Thrones again? Dire wolves back to life after 10,000 years?"
    ],
    "http://feeds.feedburner.com/TheAustralianTheNationNews": [
        "Agent payouts to shift stock",
        "Commissions driving unit sales",
        "Bitter taste for local chefs",
        "Deep in space, a flicker of life",
        "Culleton lodges appeal"
    ],
    "http://feeds.feedburner.com/AtlanticNational": [
        "Trump’s Trade War Unleashes Global Uncertainty",
        "Trump’s Preoccupation With Tariffs",
        "The Consequences of the Signal Breach",
        "What Does ‘Constitutional Crisis’ Mean?",
        "Trump’s Unpredictability With Allies and Adversaries"
    ],
    "http://www.popsci.com/rss.xml": [
        "Home Depot is blowing out Ryobi tools and batteries during its Spring Black Friday sale",
        "I tried L.A.B. Golf’s zero-torque tech that turns heads, but not putters",
        "One thing you can do to get over Nintendo Switch 2 prices",
        "The Great Pacific Garbage Patch isn’t a just a floating trash pile",
        "Don’t get left in the productivity dust—get the latest from MSO Office (and save 20)"
    ],
    "http://timesofindia.indiatimes.com/rssfeeds/1081479906.cms": [
        "Randeep Hooda: Makers of Kesari acted in bad taste",
        "Ratna Pathak Shah on marriage with Naseeruddin Shah",
        "Randeep Hooda on Kangana Ranaut targeting Alia Bhatt",
        "Loved Adolescence? Watch these slow-burn Bollywood thrillers",
        "Suniel Shetty shares his joy of becoming a grandfather"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Technology.xml": [
        "U.S. Prepares to Challenge Meta’s Social Media Dominance",
        "What to Know About Trump’s Antitrust Efforts Against Tech Giants",
        "Trump Adds Tariff Exemptions for Smartphones, Computers and Other Electronics",
        "How the Crypto Industry’s Political Spending Is Paying Off",
        "Big Tech’s Tariff Chaos + A.I. 2027 + Llama Drama"
    ],
    "http://khn.org/feed/": [
        "Journalists Delve Into Effects of Deep Federal Cuts on Public Health",
        "Some Rural Hospitals Ditch Medicare Advantage",
        "More Psych Hospital Beds Are Needed for Kids, but Neighbors Say Not Here",
        "Trump HHS Eliminates Office That Sets Poverty Levels Tied to Benefits for at Least 80 Million People",
        "KFF Health News' 'What the Health?': The Dismantling of HHS"
    ],
    "http://globalnews.ca/category/entertainment/feed/": [
        "What I’ve learned from Canadian music fans on my cross-country speaking tour",
        "Mick Jagger engaged to Melanie Hamrick, who says marriage is a ‘maybe’",
        "Eric Dane, ‘Grey’s Anatomy’ star, says he’s been diagnosed with ALS",
        "Captain Canuck comes to save Canadians in trade war-inspired comic",
        "Mickey Rourke gets ‘warning’ for homophobic remarks on ‘Celebrity Big Brother U.K.’"
    ],
    "http://www.popsugar.co.uk/celebrity/feed": [
        "Bridgerton's Hannah Dodd: Francesca Doesn't Chase Validation Like Her Siblings",
        "Tasha Ghouri: I Lost Friends and Family Due To Instant Fame",
        "The 24 Sexiest Movie Scenes of All Time",
        "How To Date Billy Walsh Charithra Chandran and Sebastian Croft on Rom-Com Diversity",
        "Kate's Cancer Diagnosis: Why Are Women Always Pressured to Show Up?"
    ],
    "http://www.manchestereveningnews.co.uk/news/showbiz-news/rss.xml": [
        "Katy Perry speaks out ahead of being sent to space in Blue Origin mission",
        "Rory McIlroy's incredible net worth, wife and divorce U-turn",
        "Upstairs, Downstairs icon Jean Marsh dies",
        "Strictly's Kai Widdrington devastated following death of woman celebrated on BBC show",
        "Richard Madeley opens up on quitting London with Judy Finnigan after emotional realisation"
    ],
    "http://fivethirtyeight.com/politics/feed/": [
        "What Americans Think Of The Biden Impeachment Inquiry",
        "The Second GOP Debate Could Be Smaller, With Or Without Trump",
        "The Senate Is Losing One Of Its Few Remaining Moderate Republicans",
        "Why ‘Bidenomics’ Isn’t Working For Biden",
        "Why Biden Is Losing Support Among Voters Of Color"
    ],
    "http://feeds.feedburner.com/rabble-news?format=xml": [
        "Don’t buy-in to climate science denialism",
        "UCP set to announce plan to bust up AHS",
        "Deepfakes and gender based violence",
        "City of Vancouver to lowest paid workers: Let them eat cuts",
        "Hundreds of thousands of Quebec public sector workers vow further strike action"
    ],
    "http://www.medscape.com/cx/rssfeeds/2700.xml": [
        "Sparsentan Provides Better Proteinuria Reduction in FSGS",
        "Chlorthalidone Increases Kidney Stone Recurrence",
        "Breastfeeding: USPSTF Finds Poor Support in Primary Care",
        "Malnutrition-Related Diabetes Officially Named ‘Type 5’",
        "Iron Overload: What Hematologists Should Know"
    ],
    "http://feeds.news.com.au/public/rss/2.0/anow_topstories_250.xml": [
        "Parents’ plea for SA man facing death",
        "Young volleyball star gone too soon",
        "Twin baby dies in home birth tragedy",
        "Holden to review Pies sponsorship",
        "Poll shows Kate Ellis heading for shock defeat"
    ],
    "http://www.skysports.com/rss/0,20514,20876,00.xml": [
        "The Masters: Latest leaderboard from Augusta National",
        "'I'm nowhere near' - Norris opens up on his struggle with McLaren's car",
        "Man Utd set up Women's FA Cup final with Chelsea after beating Man City",
        "Man Utd latest: Fernandes calls for team-mates to step up",
        "Hamilton: I think I've figured out Ferrari car"
    ],
    "http://feeds.feedburner.com/VGChartz": [
        "Atomfall Tops 2 Million Players",
        "Action RPG Rise of Rebellion Launches April 21 for PC",
        "Action Pixel RPG HYKE: Northern Light(s) Launches This Summer for PS5, Switch, and PC",
        "Marathon Launches September 23 for PS5, Xbox Series X|S, and PC",
        "Zenless Zone Zero Launches in June for Xbox Series X|S"
    ],
    "http://zeenews.india.com/rss/world-news.xml": [
        "Trump Govt To Announce Separate Tariffs For Electronics And Semiconductors Soon?",
        "Zelenskyy Says Putin Is ‘Filthy Scum’ After Russian Ballistic Missile Strikes Sumy, Kills Dozens",
        "Bangladesh Court Issues Arrest Warrant Against Hasina, Her Sister Rehana, British MP Rizwana In Graft Cases",
        "'Leave Now...': 30-Day Warning Issued To Foreign Nationals In US",
        "2 In New York, 1 In Florida: US Sees 3 Aircraft Crashes In 72 Hours"
    ],
    "http://feeds.news.com.au/public/rss/2.0/news_tech_506.xml": [
        "Galaxies collide in stunning picture",
        "Apple’s biggest product since the iPhone",
        "Rare ‘Morning Glory’ cloud dazzles Virgin flyers",
        "Towns ‘too hot to wear shorts’",
        "The gadget for the perfect coffee"
    ],
    "http://feeds.bbci.co.uk/news/technology/rss.xml#": [
        "Everyone's jumping on the AI doll trend - but what are the concerns?",
        "Microsoft rolls out AI screenshot tool dubbed 'privacy nightmare'",
        "OpenAI sues Elon Musk claiming 'bad-faith tactics'",
        "Will iPhones cost more because of Trump's tariffs on China?",
        "Leave school phone bans to head teachers, children's commissioner says"
    ],
    "http://www.livescience.com/home/feed/site.xml": [
        "Scientific consensus shows race is a human invention, not biological reality",
        "The Earth's oceans used to be green — and could one day turn purple, scientists say",
        "What is the 'Eye of Horus' and why is it found in so many ancient Egyptian burials?",
        "Study reveals 'flawed argument' in debate over when plate tectonics began",
        "Elite Celtic warrior had healed arrowhead injury in his pelvis, 3D bone analysis reveals"
    ],
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_business_2783.xml": [
        "Beach Boy ‘witnessed a Manson murder’",
        "Oil rise fails to lift stocks",
        "Home loan approvals bounce back",
        "Union seeks say in Arrium future",
        "Banks an early drag on stocks"
    ],
    "http://metro.co.uk/sport/feed/": [
        "Altay Bayindir sends message to Man Utd fans after embarrassing Newcastle blunder",
        "‘He did really well’ – Ruben Amorim praises Man Utd defender after Newcastle defeat",
        "Why George Russell avoided penalty for DRS infringement in Bahrain",
        "‘I can’t believe it’ – Roy Keane slams two Man Utd stars after Newcastle defeat",
        "Joshua Zirkzee injury update from Ruben Amorim after Man Utd defeat at Newcastle"
    ],
    "http://www.winnipegfreepress.com/rss/?path=%2Fsports": [
        "Matt Mervis hits a 3-run homer as the Marlins beat the Nationals 11-4",
        "Lithuanian and Cal Bears star Mykolas Alekna sets world record with a 247-plus feet throw",
        "Pat Connaughton joins exclusive fraternity by collecting 43 points, 11 rebounds, 5 assists for Bucks",
        "Myles Straw drives in go-ahead run in 10th, Blue Jays beat Orioles 7-6",
        "Royals’ Cole Ragans overcomes hamstring cramping to strike out 10 and get his first win of the year"
    ],
    "http://feeds.webservice.techradar.com/us/rss/new": [
        "I build PCs for a living – here are the 6 worst things you’re doing to your PC (and how to fix them)",
        "Amazon has a ton of cheap tech gadgets on sale: here are 19 deals I'd buy from 19.99",
        "I tested this 300 mesh chair with a headrest, and it's way better than I expected",
        "Life360 helped me keep track of my loved ones in ways I never knew possible",
        "'Catastrophic overtraining' could harm large language AI models that are trained on more data for the sake of training"
    ],
    "http://feeds.feedburner.com/daily-express-finance-news": [
        "Join our free WhatsApp Money community to get the latest tips and advice to your phone",
        "Every UK worker sent letter with code to check if you're owed cash",
        "HMRC cuts tax-free Personal Allowance to £11,000 with one tax code change",
        "HMRC makes £3,000 limit change as households face £600 tax bill",
        "Expert shares five 'smart moves' you can make right now to boost your finances"
    ],
    "http://feeds.arstechnica.com/arstechnica/science": [
        "A guide to the “platonic ideal” of a Negroni and other handy tips",
        "Quantum hardware may be a good match for AI",
        "Rocket Report: “No man’s land” in rocket wars; Isaacman lukewarm on SLS",
        "New simulation of Titanic’s sinking confirms historical testimony",
        "Painted altar in Maya city of Tikal reveals aftermath of ancient coup"
    ],
    "http://www.theguardian.com/travel/rss": [
        "The ghostly allure of Dungeness, Kent",
        "What’s new in Portugal? 10 reasons to visit in 2025",
        "Looking for the authentic Algarve? Go in the low season – and to Tavira",
        "Your favourite bars, beaches, swimming spots and more: readers’ top 10 travel tips on Portugal",
        "Prague’s Vietnamese food revolution"
    ],
    "http://mobilesyrup.com/feed/": [
        "Streaming in Canada on Apple TV+, Crave, Netflix and Prime Video [April 14-20]",
        "I’m very excited for the incredibly thin Samsung Galaxy S25 Edge",
        "Poco M7 Pro 5G review: Reliving the 2010’s Android",
        "Testing lossless audio on AirPods Max in 2025",
        "Apple aiming to launch delayed Apple Intelligence features this fall: report"
    ],
    "http://feeds.feedburner.com/DrudgeReportFeed": [
        "Republicans fear political wipeout...",
        "Governing by gut...",
        "iPhone olive branch is significant trade war retreat...",
        "China well positioned to weather...",
        "BEIJING SECRETLY CHOKING OFF US EXPORTS..."
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Science.xml": [
        "A Cautionary Tale of 408 Tentacles",
        "Jonathan McDowell on Retiring From Harvard and Leaving the U.S.",
        "She Worked in a Harvard Lab to Reverse Aging, Until ICE Jailed Her",
        "Denisovans Extend Their Range to Asia’s Pacific Coast",
        "Neutrinos Are Shrinking, and That’s a Good Thing for Physics"
    ],
    "http://feeds.feedburner.com/nymag/vulture": [
        "Saturday Night Live Recap: Jon Hamm Knows What To Do",
        "The Last of Us Grows Up",
        "Cinematrix No. 383: April 13, 2025",
        "Find Your Happy Gilmore 2 Place",
        "Everything That’s Happened to the Menendez Brothers Since Monsters"
    ],
    "http://feeds.feedburner.com/factmag": [
        "Interview: Gabriel Moses",
        "Gabriel Moses announces largest ever exhibition at 180 Studios",
        "Interview: Cecilia Bengolea on her dancehall film for VF: Reverb",
        "The Vinyl Factory: Reverb exhibition extended until 2 March",
        "Es Devlin: Screenshare"
    ],
    "http://www.technologyreview.com/stream/rss/": [
        "The Download: how the military is using AI, and AI’s climate promises",
        "Love or immortality: A short story",
        "How AI is interacting with our creative human processes",
        "Generative AI is learning to spy for the US military",
        "Why the climate promises of AI sound a lot like carbon offsets"
    ],
    "http://feeds.bbci.co.uk/news/world/asia/rss.xml": [
        "Hundreds of flights cancelled in China as strong winds hit capital",
        "Why Beijing is not backing down on tariffs",
        "Australia's looming election brings housing crisis into focus",
        "Remains of dozens of Indigenous ancestors returned to Australia",
        "Will trade-shy India gain edge in tariff-driven slowdown?"
    ],
    "http://feeds.news.com.au/public/rss/2.0/news_sport_3168.xml": [
        "USADA’s stunning anti-doping swoop on Lesnar",
        "Kangaroos’ extraordinary punishment",
        "Pies board accepts McGuire apology",
        "Why I hated being on Baywatch",
        "Stalker skirt shot divides internet"
    ],
    "http://www.livemint.com/rss/industry": [
        "Banks seek RBI nod for getting authority to freeze accounts making illegal transactions. Here's why",
        "‘10-minute deliveries inhumane’: BJP MP opposes quick commerce, flags ‘mental, physical pressure’ on riders",
        "Trade minister Goyal bats for sustainable, earthquake-resistant infrastructure",
        "Summer travel season: Visa application volumes up 15-20",
        "Electric vehicles also cause air pollution"
    ],
    "http://grantland.com/hollywood-prospectus/feed/": [
        "Brand Echh: Sandra Bullock and Billy Bob Thornton Can’t Save the Lame ‘Our Brand Is Crisis’",
        "50 Scenes That Do Not Appear in the Fox ‘X-Files’ Revival",
        "In Praise of Beach Slang, 2015’s Best, Most Sincere Rock Band",
        "Who Was Missing From Taylor Swift’s Miami Squad?",
        "Happy ‘Halloween’: The Best Horror-Movie Monsters"
    ],
    "http://www.journaldemontreal.com/jm/sante/rss.xml": [
        "Voici pourquoi il faut manger des champignons pour vivre plus longtemps",
        "Testés: voici les meilleurs biscuits à l’érable sur les tablettes de votre épicerie",
        "Voici les meilleurs aliments à consommer pour éviter les crampes musculaires",
        "Elle quitte les réseaux sociaux pour réfléchir... et perd 47 livres",
        "Voici pourquoi une bonne nuit de sommeil prévient l'obésité et favorise la perte de poids"
    ],
    "http://www.mirror.co.uk/tv/tv-news/rss.xml": [
        "Celebrity Bake Off's Alison Hammond pauses show as Gloria Hunniford makes sudden exit",
        "Where The Piano winner Brad Kella is now as star shares major career update",
        "Former Celebrity Big Brother housemate returns in surprise twist after Mickey Rourke exit",
        "Celebrity Big Brother reveal Mickey Rourke's vile comment to Ella Rae Wise that prompted exit",
        "Love Island star Chris Hughes new favourite to win Celebrity Big Brother amid Mickey Rourke drama"
    ],
    "http://feeds.feedburner.com/ExclaimCaAllArticles": [
        "Jon Hamm Was in His Happy Place on 'SNL,' While Lizzo Performed Successful Image Rehab",
        "Cœur de pirate Announces New Album 'Cavale,' Shares Title Track",
        "Lana Del Rey's New Album Has a Different Title and Release Date, Actually",
        "Thunder Bay's Wake the Giant Gets Black Eyed Peas, Prozzäk for 2025 Festival",
        "Brian Eno and Beatie Wolfe Announce Two Joint Albums"
    ],
    "http://www.npr.org/rss/rss.php?id=1019": [
        "The biggest trial in Meta's history starts Monday. Here's what to know",
        "Smartphones and computers are now spared from Trump's reciprocal tariffs",
        "What are your rights if border authorities ask for your phone?",
        "This former influencer gave up her smartphone. She says you should, too",
        "Trump administration backs off Nvidia's 'H20' chip crackdown after Mar-a-Lago dinner"
    ],
    "http://feeds.bbci.co.uk/news/uk/rss.xml": [
        "Reynolds refuses to say if British Steel furnaces can keep running",
        "Bangladesh issues arrest warrant for British MP Tulip Siddiq",
        "MP barred from Hong Kong says it was to 'shut me up'",
        "Man killed in house explosion as multiple properties ruined",
        "Body found in search for girl, 11, in River Thames"
    ],
    "http://www.dailymail.co.uk/sciencetech/articles.rss": [
        "Minute-by-minute, what would happen if a solar SUPERSTORM hit Earth - as scientists warn one could strike us 'at any moment'",
        "I was once an atheist - these stories have convinced me that heaven AND hell are real",
        "Could the Dubai chocolate give you CANCER? Experts warn cheap versions of the viral sweet treat contain carcinogenic chemicals, palm oil and toxins from MOULD",
        "Scientists reveal what it's really like to receive a vision from God",
        "Terrifying new theory of what's behind Tic Tac UFOs that keep rising from ocean in front of US Navy sailors"
    ],
    "http://feeds.arstechnica.com/arstechnica/gadgets": [
        "Turbulent global economy could drive up prices for Netflix and rivals",
        "Chrome’s new dynamic bottom bar gives websites a little more room to breathe",
        "Powerful programming: BBC-controlled electric meters are coming to an end",
        "OnePlus releases Watch 3 with inflated 500 price tag, won’t say why",
        "Google takes advantage of federal cost-cutting with steep Workspace discount"
    ],
    "http://www.indodaily.com/indodaily.xml": [
        "At least 69 killed in thunderstorms, avalanches in India, Nepal, China",
        "Nepal fights wildfires and pollution amidst drier winter",
        "India's TCS posts small profits dip in 'challenging' environment",
        "US storms, 'devastating' flooding death toll climbs to 17",
        "India's Modi clinches defence, energy deals in Sri Lanka"
    ],
    "http://feeds.news.com.au/public/rss/2.0/au_national_affairs_news_13_3296.xml": [
        "Culleton lodges appeal",
        "Turnbull dinner cost 30k",
        "Security focus for Abe visit",
        "Judge anger on 10 art claim",
        "Centrelink data to be ‘refined’"
    ],
    "http://feeds.howtogeek.com/howtogeek": [
        "ChatGPT's Image Gen Still Hasn't Fixed My Favorite Scheduled Task",
        "A Wearable That Measures Gases Can Forever Change Skin Care",
        "Think You Can't Game on a Work Laptop? Think Again",
        "You Don't Need ChatGPT Plus to Use Custom GPTs, Just to Make Them",
        "What Is GoboLinux? A Unique Distro Explained"
    ],
    "http://www.newrepublic.com/taxonomy/term/17538/feed": [
        "Will the Supreme Court Crash the Global Economy?",
        "Trump’s Horrifying Removal of Man in “Error” Takes an Even Darker Turn",
        "Gretchen Whitmer Fell Into Trump’s Tariff Trap",
        "Measles Is Spreading, and RFK Jr. Is Praising Quacks",
        "Trump Scores Massive Win as Judge Rules He Can Deport Mahmoud Khalil"
    ],
    "http://www.digitaltrends.com/feed/": [
        "I ditched Chrome for the Vivaldi browser, and it’s awesome",
        "10 films that deserve an Oscar for Best Stunt Design",
        "Apple Intelligence is coming to the Apple Watch in a limited capacity",
        "Nintendo’s upcoming Zelda Notes have an overlooked perk: item durability repair",
        "5 ways to protect your router from hackers, according to TP-Link experts"
    ],
    "http://feeds.nbcnews.com/feeds/todayentertainment": [
        "Aimee Lou Wood reacts to ‘SNL’ impression of her ‘White Lotus’ character: ‘mean and unfunny’",
        "Jon Hamm is that one employee that always overshares in 'Icebreaker' 'SNL' sketch",
        "Jon Hamm has some 'crazy ideas' in spot-on 'The White Lotus' 'SNL' sketch",
        "Bowen Yang sums up the reality of working at ‘SNL’ in 9 words",
        "What time is ‘The Last of Us’ on? How to watch the Season 2 premiere"
    ],
    "http://rss.cnn.com/rss/cnn_health.rss": [
        "RSV hospitalization rate for seniors is 10 times higher than usual for this point in the season",
        "Covid-19 boosters could keep thousands of kids out of hospitals, but uptake remains low",
        "Experimental therapy gantenerumab fails to slow or improve Alzheimer's memory loss in clinical trials",
        "US gets D+ grade for rising preterm birth rates, new report finds",
        "Desperate for heart surgery for their baby, a family feels the effects of pediatric hospital shortages"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Space.xml": [
        "How Lauren Sanchez Helped Design Blue Origin’s Flight Suits",
        "Jonathan McDowell on Retiring From Harvard and Leaving the U.S.",
        "Effort to Get Starlink in South Africa Collides With Tension Over Musk",
        "Jared Isaacman, Trump’s Pick to Lead NASA, Questioned Over Moon Plans and Elon Musk",
        "Chinese Lunar Rocks Suggest a Thirsty Far Side of the Moon"
    ],
    "http://rss.nzherald.co.nz/rss/xml/nzhrsscid_000000002.xml": [
        "China halts critical exports as trade war intensifies",
        "Russian missile strike in Sumy kills 34, draws global condemnation",
        "Trump insists tariff policy works despite market turmoil, China retaliation",
        "Donald Trump exempts smartphones, laptops, chips in China tariff backdown",
        "Iran seeks ‘real and fair’ nuclear deal as US signals compromise"
    ],
    "http://www.ok.co.uk/rss/health": [
        "Shoppers 'replace all lipstick' with Victoria Beckham's lip balm that 'keeps lips hydrated all day'",
        "M&S shoppers say spring-ready £50 denim dress looks 'triple the price' and 'fits amazingly'",
        "The moisturising SPF behind The White Lotus star Meghann Fahy's glowing skin",
        "'Delicious' chocolate-scented candle that's '10x better than other brands' is ideal for Easter weekend",
        "Wear your chocolates this Easter with the trendiest brown fashion buys from £29"
    ],
    "http://feeds2.feedburner.com/time/scienceandhealth": [
        "Breaking the Gender Barrier May Be New For Space Tourism, But Not For NASA Missions",
        "What to Know About April’s ‘Micromoon’",
        "Yes, Climate Change Really is Making Your Hay Fever Worse",
        "The Science Behind the Return of the Dire Wolf",
        "The Return of the Dire Wolf"
    ],
    "http://www.washingtontimes.com/rss/headlines/news/politics/": [
        "Trump administration officials say tariff reprieve on electronics is temporary",
        "State Department wants staff to report instances of alleged anti-Christian bias during Biden's term",
        "Schumer seeks to halt flights for New York helicopter company after deadly Hudson River crash",
        "White House physician says Trump is in 'excellent health'",
        "Sportscaster Stephen A. Smith looks to the heavens as he weighs 2028 presidential run"
    ],
    "http://metro.co.uk/entertainment/showbiz/feed/": [
        "Michelle Keegan shares tribute to newborn daughter during blissful first weeks of motherhood",
        "Surprise detail in Katy Perry’s history-making spaceflight",
        "The Crown’s Emma Corrin splits from Bohemian Rhapsody’s Rami Malek after two years",
        "Inside Celebrity Big Brother’s Patsy Palmer’s incredible Malibu mansion with jaw-dropping sea views",
        "Dazed and Confused and School of Rock star Nicky Katt dies aged 54"
    ],
    "http://feeds.abcnews.com/abcnews/technologyheadlines": [
        "Apple has few incentives to start making iPhones in U.S.",
        "OpenAI countersues Elon Musk in legal dispute over ChatGPT maker's business ambitions",
        "La Nina exits after three weak months, leaving Earth in neutral climate state",
        "A machine using ultrasound and AI can gauge the fattiness of a tuna fish",
        "Trump's 'buy' tip on social media before tariffs pause made money for investors"
    ],
    "http://rss.csmonitor.com/feeds/usa": [
        "Explained: The Legal Fight to Stop Mahmoud Khalil’s Deportation",
        "To speed deportations, Trump revives rarely used laws",
        "After Gaza protests, more colleges try out an old-fashioned ideal: Civility",
        "Markets got a tariff pause. But damage to global confidence in US could last.",
        "Meet ‘the loud majority.’ College conservatives are silent no longer."
    ],
    "http://feeds.bbci.co.uk/news/science_and_environment/rss.xml": [
        "Global breakthrough to tackle shipping emissions",
        "What goes on inside toddlers' brains? A pioneering project is trying to find out",
        "Starlings disappearing from gardens, says RSPB",
        "UK investigating claims green fuel contains virgin palm oil",
        "Royal Society of Biology mourns murdered scientist"
    ],
    "http://www.livemint.com/rss/companies": [
        "As Donald Trump wants Apple to make iPhones in US, focus on Steve Jobs' 2012 reply to Barack Obama: ‘Those jobs’",
        "HDFC Capital to invest 1.5K cr in platform with Eldeco to build 11K-cr homes in small towns",
        "Spending 988 crore to earn 97 crore—20 years on, Cleartrip still has no flight plan",
        "GAIL completes laying over 97.6 pipeline of Pradhan Mantri Urja Ganga",
        "DRI seizes 52.67 kg crystal meth narcotic in Mizoram"
    ],
    "http://www.mirror.co.uk/news/technology-science/rss.xml": [
        "'I was born without a uterus - now I'm pregnant with my second child after life-changing op'",
        "What happens when you donate your body after death - as Coronation Street star has 'no funeral'"
    ],
    "http://www.eurogamer.net/?format=rss": [
        "DMZ: Nuclear Survival is a new open-world survival game with crafting, exploration, and beer-swilling bears",
        "EA reminds Battlefield players, things taking place in Labs may or may not make their way to the final game",
        "Stress-testing DLSS 4's super resolution transformer technology",
        "PCs will be exempt from Trump's tariffs, but consoles will not",
        "Pokémon Go will not undergo any major changes, developer Niantic tells staff following Scopely acquisition"
    ],
    "http://www.redstate.com/feed/": [
        "More Winning: Gulf of America Oil and Gas Production Set to Explode",
        "Winning: Arizona to Purge Voter Rolls, Possibly 50K Non-Citizens to be Removed",
        "'Blowin' in the Wind?' Bernie and the Bros Trot Out Folk-Singing Dinos to Influence Gen Z Voters",
        "Hakeem Jeffries Tries to Embarrass Hegseth With Lame NSFW 'DEI' Joke—SecDef Flattens Him With Receipts",
        "DOGE Has a New Portal for the Airing of Grievances"
    ],
    "http://www.theguardian.com/lifeandstyle/health-and-wellbeing/rss": [
        "Go to town The surprise feelgood effects of walking in the city",
        "Put your baby down to nap near a washing machine, expert says",
        "Poppy Okotcha: ‘Plants taught me about myself’",
        "What happens when love tips over into the infatuated state of ‘limerence’?",
        "Young people in the UK: tell us about your gym habits"
    ],
    "http://www.cbsnews.com/latest/rss/entertainment": [
        "Price of Admission: The battle over concert tickets",
        "F. Scott Fitzgerald's novel The Great Gatsby turns 100",
        "Grey's Anatomy star Eric Dane reveals he's been diagnosed with ALS",
        "Sony wins distribution rights to Wheel of Fortune, Jeopardy",
        "Cannes Film Festival unveils full list of 2025 competition titles"
    ],
    "http://feeds.feedburner.com/dailytelegraphnationalnewsndm?format=xml": [
        "‘Being secret doesn’t make sense’",
        "Turnbull calls for electronic voting",
        "‘Thrown under the bus’: Jones unleashes",
        "Shorten blasted for ‘treaty bomb’",
        "Turnbull and Shorten speak of mistakes"
    ],
    "http://backofthebook.ca/feed/rss/": [
        "Fort McMurray: Shopping time",
        "From “Our Rape Blog”: Shooting the Moon",
        "Electoral reform: Hashtag fresh thinking",
        "The fish hotel",
        "Hatred on an Alberta golf course"
    ],
    "http://www.abc.net.au/news/feed/45924/rss.xml": [
        "Mary Fowler suffers knee injury in FA Cup semifinal defeat",
        "Olyslagers adopts 'bold' approach to claim sixth national high jump title",
        "Fan accused of 'attempted manslaughter' after throwing water bottle at cyclist",
        "Live: Horror error from Rory McIlroy opens door for Justin Rose",
        "US Masters live: McIlroy chases elusive green jacket, Day in the hunt"
    ],
    "http://feeds.feedburner.com/thedailybeast/articles": [
        "Donald Trump Cancels Second Mainstream Interview in Days",
        "Mitch McConnell Called Donald Trump a ‘Stupid’ and ‘Despicable Human Being’",
        "Witnesses Say Would-Be Organ Donor Started ‘Thrashing’ on the Table",
        "Menendez Family Members: We Had ‘Gut-Level’ Fears Erik and Lyle Were Sexually Abused",
        "Liam Payne 911 Caller Said One Direction Star’s Life Could Be in Danger Minutes Before Death"
    ],
    "http://feeds.feedburner.com/SportcoukNewsRssFeed": [
        "Liverpool attempted to trademark 'Allez Allez Allez' after famous fan chant",
        "Henderson, Keita and Gomez fit for Fulham says Liverpool boss Klopp",
        "Jordan Nobbs Column: England Have Impressed So Far But Must Be Wary of Tough Japan Challenge",
        "Ashley Cole signs new one-year deal at LA Galaxy&nbsp;",
        "Cilic Expecting First Child In 2020"
    ],
    "http://feeds.feedburner.com/NewshourWorld": [
        "Xi Jinping celebrates China’s rising power — and his own",
        "The battle for Mosul is over, but this hidden ISIS danger could lurk for years",
        "As Rohingya refugees continue to flee from persecution, here’s how you can help",
        "Tillerson: ‘Heartbreaking’ reports of suffering in Myanmar",
        "Far-right groups gain ground in Sweden and Germany amid migrant influx"
    ],
    "http://www.reddit.com/r/politics/.rss": [
        "DOGE Goons Physically Drag Social Security Worker From Desk",
        "Trump Officials Growing Tired of ‘Unfunny’ and ‘Irritating’ Musk | “He’s just the most irritating person I’ve ever had to deal with, and that is saying something,” one official reportedly said.",
        "Some members of Congress are starting to talk about impeachment. They’re right.",
        "‘These barbarians are now in the sole custody of El Salvador’: Trump official insists dad deported in error is ‘alive and secure’ — but POTUS says his ‘future’ not up to US",
        "‘The U.S. economy is the next business Trump will bankrupt’: Analysts on 'dangerous’ tariff fallout"
    ],
    "http://www.theguardian.com/world/rss": [
        "More than 200 civilians killed as Sudan’s RSF attacks Darfur displacement camps",
        "Coup leader favourite in presidential race as Gabon goes to the polls",
        "Zimbabwe starts compensating white farmers 25 years after land seizures",
        "Weather tracker: early heatwave sweeps northern India",
        "Bobi Wine to run for president in Uganda’s 2026 election ‘if I am still alive and not in jail’"
    ],
    "http://www.theguardian.com/us/lifeandstyle/rss": [
        "The kindness of strangers: I was ready to leave the theatre in disgrace when a gentle usher made me an offer",
        "Do all wind turbines rotate in the same direction? If so, why?",
        "From Gwyneth Paltrow to the Duchess of Sussex, the girlboss is back. In this economy, who can blame them?",
        "Readers reply: Why do sunglasses make you look cool?",
        "Go to town The surprise feelgood effects of walking in the city"
    ],
    "http://www.abc.net.au/news/feed/51892/rss.xml": [
        "Kalgoorlie rail realignment hinges on 'complex' freight network negotiations",
        "Live: ASX set to rise after Wall Street rally on Fed's assurances",
        "SafeWork finds dozens of safety breaches at plant where silos collapsed",
        "Neo-Nazis say this site is their 'biggest weapon' and candidates are spreading it",
        "Athleisure wear designer says Aussie wool industry 'worth fighting for'"
    ],
    "http://www.bollywoodnewsworld.com/feed": [
        "Global Getaways: Explore the World and Have the Time of Your Life",
        "How a Family Calendar Can Simplify Your Life and Keep Everyone Organized",
        "Assessment of Land Condition: A Critical Step in Identifying Contaminated Sites",
        "Paris Pleasures: Leisurely Explorations",
        "Fashion Tips for Styling Legs and Hiding Cankles Effectively"
    ],
    "https://sports.yahoo.com/top/rss.xml": [
        "The last 10 years of 5th-round draft picks for the Arizona Cardinals",
        "Matt Mervis hits a 3-run homer as the Marlins beat the Nationals 11-4",
        "Wyndham Clark leaves the Masters wondering 'what if' with his putting",
        "Lithuanian and Cal Bears star Mykolas Alekna sets world record with a 247-plus feet throw",
        "Myles Straw drives in go-ahead run in 10th, Blue Jays beat Orioles 7-6"
    ],
    "http://www.express.co.uk/posts/rss/11/health": [
        "The lesser-known symptoms on the face that could be a sign of high cholesterol",
        "Crisis in India as country warned 450m will soon be too fat - 'only China is worse'",
        "I was so fat I got stuck in football turnstiles - now I've lost 17 stone",
        "Combat hay fever symptoms with four little-known strategies - not medication",
        "Lose body fat without giving up your favourite foods with 5 easy food swaps"
    ],
    "http://feeds.bbci.co.uk/news/world/us_and_canada/rss.xml": [
        "Pennsylvania governor and family evacuated from suspected arson attack on home",
        "China urges US to 'completely cancel' tariffs",
        "Trump in excellent health, says White House doctor",
        "Teen killed parents as part of Trump assassination plot, says FBI",
        "Deadly measles outbreak does little to counter vaccine scepticism in Texas"
    ],
    "http://feeds.feedburner.com/TheAustralianBusAviation?format=xml": [
        "Bali chaos as Tiger row deepens",
        "Passengers in safe hands",
        "Tigerair ban strands Aussies",
        "Tigerair passengers stranded",
        "Commercial flying ‘never safer’"
    ],
    "http://feeds.theguardian.com/theguardian/technology/rss": [
        "Tesla stops taking orders in China for two models imported from US",
        "OpenAI countersues Elon Musk over ‘unlawful harassment’ of company",
        "Amazon’s satellite launch designed to compete with Musk’s Starlink cancelled",
        "Sledgehammer-wielding Musk critics smash up Tesla in London art project",
        "Apple said to be flying iPhones from India to US to avoid Trump tariffs"
    ],
    "http://rss.sciam.com/ScientificAmerican-Global": [
        "This Butterfly’s Epic Migration Is Written into Its Chemistry",
        "This Robot Copies Life—By Decomposing",
        "HIV, Trans Health, and Covid Research Targeted by Trump Cuts to NIH",
        "Crows Are Surprisingly Good at Geometry",
        "JWST Spots Remains of Alien Planet That Fell into a Star"
    ],
    "http://vitals.lifehacker.com/rss": [
        "Why Siri's AI Upgrades Keep Getting Pushed Back",
        "Hackers Stole Health Records From 1.6 Million Planned Parenthood Patients",
        "Microsoft Edge Recently Got a Speed Boost",
        "My Favorite Amazon Deal of the Day: Samsung's 'The Frame' TV",
        "40 Under-the-Radar Netflix Originals You Should Watch"
    ],
    "http://rss.cnn.com/rss/cnn_topstories.rss": [
        "Some on-air claims about Dominion Voting Systems were false, Fox News acknowledges in statement after deal is announced",
        "Dominion still has pending lawsuits against election deniers such as Rudy Giuliani and Sidney Powell",
        "Here are the 20 specific Fox broadcasts and tweets Dominion says were defamatory",
        "Judge in Fox News-Dominion defamation trial: 'The parties have resolved their case'",
        "'Difficult to say with a straight face': Tapper reacts to Fox News' statement on settlement"
    ],
    "http://www.journaldemontreal.com/sports/rss.xml": [
        "Ivan Demidov pourra compter sur le vétéran Samuel Montembeault",
        "Six éléments à surveiller au Tournoi des Maîtres en ce dimanche: la lutte sans merci entre Rory McIlroy et Bryson DeChambeau",
        "Tournoi des Maîtres: une promenade du dimanche sans égal au Augusta National",
        "Les Oilers vont encore piger en Europe",
        "Mondiaux féminins: le Canada plie devant son ennemi juré"
    ],
    "http://www.crikey.com.au/politics/feed": [
        "Our politicians are selling pixels not policy. It’s a threat to democracy in the TikTok election",
        "Coalition ducks and weaves on how universities should make up for lost foreign student income",
        "Trump wants allies in his war on China. Albanese and Marles will bend the knee — as will Dutton",
        "Seven stories you will read roughly 100 times between now and election day",
        "Labor’s attack on Dutton ‘cuts’ isn’t the full picture"
    ],
    "http://www.thehindu.com/sci-tech/science/?service=rss": [
        "The men who first split the atom",
        "Zoo in Spain helps elderly elephants age gracefully",
        "How will genetic mapping of Indians help? | Explained",
        "Can fruit fly larvae sense electric fields?",
        "Indigenous TB test can enhance accuracy, speed up testing"
    ],
    "http://www.thehindu.com/sport/?service=rss": [
        "Bahrain GP: Oscar Piastri cruises to win, with Lando Norris third",
        "Malaysian duo stun home crowd at Badminton Asia Championships",
        "Alcaraz beats injured Musetti to win in Monte Carlo for his 6th Masters 1000 title",
        "Sai Sudharsan — the perfect sync between consistency and authority",
        "Adding a French touch to India’s Olympic dream"
    ],
    "http://rss.cnn.com/rss/cnn_showbiz.rss": [
        "Kirstie Alley, 'Cheers' and 'Veronica's Closet' star, dead at 71",
        "John Travolta and Kirstie Alley: A love story",
        "Chelsea Handler, Leslie Jones and John Leguizamo among guest hosts to step in for Trevor Noah on 'The Daily Show'",
        "Ashton Kutcher and twin Michael talk health, guilt and rift between them",
        "Bong Joon Ho's 'Mickey 17' gets trailer and release date"
    ],
    "http://www.esquire.com/blogs/culture/culture-rss": [
        "‘The Last of Us’ Season 2 Schedule: When Do New Episodes Come Out?",
        "How to Watch Warfare",
        "Your Friends and Neighbors Release Schedule: When Do New Episodes Come Out?",
        "One to One: John & Yoko Returns to an Often Forgotten Lennon Era",
        "The Pitt Episode 15 Finale Recap"
    ],
    "http://feeds.feedburner.com/TheAustralianBusinessWorldBusNews?format=xml": [
        "China ends floats logjam",
        "Traders suspended in forex probe",
        "FBI probes possible J.P. Morgan hacking",
        "Snapchat valued at 10bn",
        "Rosneft poised for Arctic LNG stake"
    ],
    "http://www.economist.com/blogs/blighty/index.xml": [
        "Fingerspitzengefühl",
        "Pay takes a pounding",
        "The real taboo",
        "Current concern",
        "No reservations"
    ],
    "http://feeds.news.com.au/public/rss/2.0/cpost_news_entertainment_3329.xml": [
        "Sounds exhilarating",
        "Eyes on world",
        "Waifs celebrate 25 years with Cairns concert",
        "Big year to play host",
        "Exciting stage of life"
    ],
    "http://www.theguardian.com/world/australian-politics/rss": [
        "Australia election 2025 live: Greens to launch 45bn plan to scrap university fees; major parties spruik new housing policies",
        "What do Labor and the Coalition’s new housing polices mean for first home buyers?",
        "Labor announces 10m to provide ‘inclusive, culturally safe’ healthcare for LGBTQ+ Australians",
        "Ten things we learned from Anthony Albanese’s speech at the Labor party campaign launch",
        "Ten things we learned from Peter Dutton’s speech at the Liberal party campaign launch"
    ],
    "http://www.techrepublic.com/rssfeeds/blog/australian-technology/": [
        "Will a Useful Quantum Computer Be a Reality Within 10 Years? DARPA, 2 Australian Startups, IBM & More Are Working On It",
        "Top Tech Conferences & Events to Add to Your Calendar in 2025",
        "Boosting R&D Could Lift Australia’s GDP by 3, Report Finds",
        "Australians Hit With One Cyber Attack Every Second in 2024",
        "Australia Divided on DeepSeek Response: Industry Groups Call for Action, Minister Urges Caution"
    ],
    "http://feeds.feedburner.com/RockPaperShotgun": [
        "What's on your bookshelf?: Mouthwashing's Johanna Kasurinen",
        "The Sunday Papers",
        "V Rising's first big post 1.0 update brings a bevy of additions, combat reworks, and Steam Deck support later this month",
        "Elden Ring Nightreign? The Duskbloods? Who needs them, now that Dark Souls' seamless co-op mod is here",
        "Marathon is real, looks ridiculously stylish, has a release date, and is getting a closed alpha test this month"
    ],
    "http://grist.org/feed/": [
        "Trump said cuts wouldn’t affect public safety. Then he fired hundreds of workers who help fight wildfires.",
        "Massachusetts home-electrification pilot could offer a national model",
        "What do climate protests actually achieve? More than you think.",
        "‘People would die’: As summer approaches, Trump is jeopardizing funding for AC",
        "The fix for parched western states: Recycled toilet water"
    ],
    "http://www.standard.co.uk/showbiz/rss": [
        "‘Sexual language’ among reasons Mickey Rourke booted from Celebrity Big Brother",
        "Dazed and Confused actor Nicky Katt dies aged 54",
        "Bessie Carter says working with mother Dame Imelda Staunton was ‘dream’ of hers",
        "Mickey Rourke wanted to leave Celebrity Big Brother, says Sir Michael Fabricant",
        "Fresh Strictly scandal as Wynne Evans and Jamie Borthwick 'warned over sex toy clip'"
    ],
    "http://feeds.nbcnews.com/feeds/worldnews": [
        "Mountains of trash and 'cat-size' rats as garbage workers strike in U.K.'s second-largest city",
        "At least 31 killed, 80 injured in Russian attack on Ukrainian city",
        "Israeli military strikes Gaza City's last functioning hospital",
        "Palestinians struggle to find water as clean sources become increasingly scarce in Gaza",
        "American teen was killed by Israeli soldiers in the West Bank. The U.S. has said little about it."
    ],
    "http://feeds.bbci.co.uk/news/business/rss.xml": [
        "Faisal Islam: Trump's iPhone olive branch is a significant trade war retreat",
        "Reynolds refuses to say if steel furnaces can keep running",
        "UK takes control of British Steel under emergency powers",
        "Chris Mason: British Steel law rushed through Parliament but it is just a stop gap",
        "'I can't keep up': Trump's changing tariffs leave shoppers feeling paralysed"
    ],
    "http://www.engadget.com/tag/@gaming/rss.xml": [
        "Bungie shares first looks at gameplay from its new shooter, Marathon, alongside a release date",
        "iPad software will reportedly get more Mac-like with the iPadOS 19 redesign",
        "Electronics exempted from reciprocal tariffs will soon be subject to new semiconductor tariffs instead",
        "Apple is reportedly working on two new versions of the Vision Pro",
        "Doctor Who ‘The Robot Revolution’ review: Meet Belinda Chandra"
    ],
    "http://www.ft.com/rss/world/uk": [
        "UK races to secure coal needed to keep British Steel furnaces burning",
        "UK suspends import tariffs to ease strain for British businesses",
        "Why did the UK rush to save British Steel and what happens next?",
        "British MP denied entry to Hong Kong",
        "England’s busiest A&E department grapples with soaring demand for elderly care"
    ],
    "http://zeenews.india.com/rss/sports-news.xml": [
        "IPL 2025: Karn Sharma Overshadows Karun Nair As Mumbai Indians Beat Delhi Capitals By 12 Runs",
        "IPL 2025: Phil Salt, Virat Kohli Power RCB To Nine-Wicket Win Over Rajasthan Royals",
        "CSK vs LSG: Can MS Dhoni's Men Regain Momentum In IPL 2025?",
        "IPL 2025: Hardik Pandya Gifts His Bat To Kashvee Gautam Ahead Of MI vs DC Clash - WATCH",
        "DC vs MI - Head-to-Head, IPL 2025: Axar’s Delhi Capitals Face Off Against Hardik’s Mumbai - Check Stats And More"
    ],
    "http://feeds.sbnation.com/rss/streams": [
        "These NCAA teammates might be the most intriguing prospects of the 2025 WNBA Draft",
        "What to watch for in the Bahrain Grand Prix",
        "The Masters leaderboard is a great potential preview of the Ryder Cup",
        "This is why so many people want to see Rory McIlroy win The Masters",
        "Max Verstappen laments Red Bull’s ‘inconsistency’ ahead of Bahrain Grand Prix"
    ],
    "http://feeds.foxnews.com/foxnews/latest?format=xml": [
        "Daughter of German-American dissident whose body was mutilated by Iran calls on Trump to nix nuke talks",
        "Artificial intelligence transforms patient care and reduces burnout, physician says",
        "'Bubbling' teriyaki sauce recalled after shelf-stable bottles began to swell: FDA",
        "Peter Navarro laughs off Elon Musk 'moron' remark, tells NBC host 'everything is fine'",
        "Results of President Trump's physical released, here's what they say"
    ],
    "http://www.theguardian.com/au/rss": [
        "Australian academics refuse to attend US conferences for fear of being detained",
        "NSW’s sole women’s-only clinic dedicated to trauma ends ‘gamechanging’ focus",
        "How rich is Gina Rinehart, and how much will she earn in the time it takes to read this article?",
        "Australia election 2025 live: Greens to launch 45bn plan to scrap university fees; major parties spruik new housing policies",
        "US stock markets expected to recover after Trump drops tariffs on mobiles"
    ],
    "http://feeds.nbcnews.com/feeds/topstories": [
        "Suspect in custody after overnight fire at Pennsylvania Gov. Josh Shapiro's residence",
        "One of the country's leading Alzheimer's projects is in jeopardy",
        "Mountains of trash and 'cat-size' rats as garbage workers strike in U.K.'s second-largest city",
        "This Washington border county is desperate for Canadians",
        "Billionaire investor Ray Dalio is worried about 'something worse than recession’: Full interview"
    ],
    "http://www.techspot.com/backend.xml": [
        "Four years in, Meta has burned through 45 billion chasing its metaverse dream",
        "DaVinci Resolve offers a free pro-grade video editing platform",
        "Apple Maps web app is now available on all devices, including Android",
        "Use OBS Studio to livestream your gaming sessions",
        "Microsoft research shows AI coding tools fall short in key debugging tasks"
    ],
    "http://feeds.news.com.au/rss/newslocal/dt_nlocal_sport_3214.xml": [
        "Finding the next football star",
        "Future stars bring home trophy",
        "Jesse James represents Australia",
        "Ironman legend Barry Rodgers dead at 74",
        "‘Everyone wants to be Suarez’"
    ],
    "http://www.polygon.com/rss/index.xml": [
        "League’s current main plot moves forward toward Ionia and the deadly Darkin",
        "These 7 video games have amazing ASMR",
        "5 movies about revolution to watch while you wait for Andor season 2",
        "The era of the bad video game movie is over, if Hollywood lets these guys do their job",
        "Witch Watch’s Ms. Makuwa is my kindred spirit in anime fandom"
    ],
    "http://feeds.theguardian.com/theguardian/uk/sport/rss": [
        "The Masters 2025: final round at Augusta – live",
        "McLaren’s Oscar Piastri surges to dominant victory at Bahrain F1 GP",
        "Howe remains in hospital but Tindall sure Newcastle win has ‘lifted his spirits’",
        "Cambridge sweep Oxford aside to maintain Boat Race dominance with double",
        "Barbeary double helps nine-try Bath crush Gloucester in Challenge Cup"
    ],
    "http://globalnews.ca/politics/feed/": [
        "Poilievre targets Carney’s assets, promises tougher ethics rules",
        "Campus voting begins at more than 100 universities and colleges across Canada",
        "Liberals lead dips for 1st time in Canada election as Tories gain: poll",
        "Poilievre gains endorsement from business leaders, ex-bank heads",
        "Carney unveils new ‘Canada Strong Pass.’ What free perks are available?"
    ],
    "http://feeds.nature.com/nbt/rss/current": [
        "Hyperspectral reporters for long-distance and wide-area detection of gene expression in living bacteria",
        "Severus detects somatic structural variation and complex rearrangements in cancer genomes using long-read sequencing",
        "Improved RNA base editing with guide RNAs mimicking highly edited endogenous ADAR substrates",
        "Scalable spatial transcriptomics through computational array reconstruction",
        "Openness guides discovery"
    ],
    "http://www.thehindu.com/sci-tech/technology/?service=rss": [
        "Trump spares smartphones, computers, other electronics from his 125 China tariffs",
        "UPI outage: Several users say transactions failing; NPCI says working to resolve ‘intermittent technical issues’",
        "Government sites start trying Hindi web addresses",
        "Asus Vivobook S 14 OLED Review | For users needing portability and decent power, it’s a reasonable pick",
        "Meta to add Dina Powell McCormick, Patrick Collison to board"
    ],
    "http://globalnews.ca/science/feed/": [
        "Elon Musk says he plans to send his humanoid robots to Mars by 2026",
        "The dire wolf has come out of extinction — kind of",
        "Glowing blue spiral spotted across Europe night sky captivates stargazers",
        "The 5 senses of spring: How climate change is shaping our seasonal experience",
        "NASA astronauts return to Earth after 9 months stuck in space"
    ],
    "http://techau.com.au/feed/": [
        "NVIDIA Studio Update supercharges DaVinci Resolve with RTX AI Acceleration",
        "REVIEW: Dell 27 Plus 4K monitor offers 120Hz, but is it worth the money?",
        "Next Level Racing cooked, F-GT PRO a multi-position racing simulator",
        "Yackandandah adds another Community Battery",
        "Tesla’s 2025 Spring Software Update to add B-Pillar camera access"
    ],
    "http://www.computerweekly.com/rss/All-Computer-Weekly-content.xml": [
        "Work-life balance biggest barrier for women in tech, says survey",
        "AI surveillance towers place migrants in ‘even greater jeopardy’",
        "More than 100 Horizon victims are challenging Post Office offers on complex claims",
        "IT strategy implications of US tariffs",
        "Met Police to deploy permanent facial recognition tech in Croydon"
    ],
    "https://www.newscientist.com/feed/home": [
        "'Quantum Darwinism' may explain why we live in a shared reality",
        "What the surprising lives of solitary animals reveal about us",
        "How to spot Haumea, one of the solar system's strangest objects",
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind"
    ],
    "http://feeds.feedburner.com/daily-express-uk-news": [
        "British Army officers step in to manage Birmingham bin strike crisis",
        "Fruit juice, hoovers, pasta and 89 items cheaper from today in boost for UK households",
        "Cold weather forecast as -2C ice blast hits UK - check your area",
        "The UK town 'torn apart by drugs shipped in from China' - kids as young as 12 addicted",
        "Air fryer owners with these model numbers warned to stop using them immediately"
    ],
    "http://feeds.theguardian.com/theguardian/uk/business/rss": [
        "US stock markets expected to recover after Trump drops tariffs on mobiles",
        "Gordon Brown accuses Trump of ‘weaponising’ global trade system",
        "Terrible timing and huge uncertainty: how ports and shipping are handling tariff turmoil",
        "British Steel to deploy emergency measures to save Scunthorpe furnaces",
        "UK and G7 allies look at lowering ‘meaningless’ cap on Russian oil exports"
    ],
    "http://www.npr.org/rss/rss.php?id=1128": [
        "Here's how to retrain your brain to crave movement more than screen time",
        "Soccer-loving 'grannies' go for the GOOOOAAAALLLL in their version of the World Cup",
        "How climate change is making hay fever more miserable",
        "Mental health workers go on hunger strike, demanding better pay and benefits",
        "Dozens of USAID contracts were canceled last weekend. Here's what happened"
    ],
    "http://www.theguardian.com/uk/rss": [
        "British Steel to deploy emergency measures to save Scunthorpe furnaces",
        "UK could target parts of Chinese state under new foreign influence rules",
        "Russian missile strike kills dozens in Ukrainian city of Sumy",
        "The Masters 2025: final round at Augusta – live",
        "Army planners sent in to help clear Birmingham’s rubbish"
    ],
    "http://feeds.webservice.techradar.com/us/rss/news/gaming": [
        "I build PCs for a living – here are the 6 worst things you’re doing to your PC (and how to fix them)",
        "Amazon has a ton of cheap tech gadgets on sale: here are 19 deals I'd buy from 19.99",
        "I tested this 300 mesh chair with a headrest, and it's way better than I expected",
        "Life360 helped me keep track of my loved ones in ways I never knew possible",
        "'Catastrophic overtraining' could harm large language AI models that are trained on more data for the sake of training"
    ],
    "http://www.cnet.com/rss/android-update/": [
        "Today's NYT Strands Hints, Answers and Help for April 14, 407",
        "Today's NYT Connections Hints, Answers and Help for April 14, 673",
        "Today's Wordle Hints, Answer and Help for April 14, 1395",
        "Still Need to File Your Taxes? See If You Qualify to File Head of Household",
        "I Slashed My Streaming Costs Without Missing a Single Show"
    ],
    "http://www.livemint.com/rss/money": [
        "When does taking money from HUF account become a partial partition?",
        "ITR filing: Can you buy two residential house properties to claim exemption on LTGC from sale of one house?",
        "Market moves are unpredictable. Your portfolio doesn’t have to be.",
        "Investment word of the day: Fund of funds —what is FoF and how does it work? Types, advantages and more",
        "These 5 credit cards give free access to domestic and international airport lounges. Check list here"
    ],
    "http://www.dailyrecord.co.uk/lifestyle/health-fitness/rss.xml": [
        "Kale and fish among foods that could boost brain health and reduce risk of dementia",
        "Poor hearing increases early death risk due to 'significant' link to heart failure",
        "Five easy lifestyle changes to get fitter - even if you're too busy for the gym",
        "Maximise your weight loss workouts with the expert-recommended ‘3-3-3 rule'",
        "When is the best time to exercise - morning, midday or evening?"
    ],
    "http://feeds.feedburner.com/daily-express-sport-news": [
        "Masters LIVE: Hole-by-hole score updates as Rory McIlroy battles Bryson DeChambeau",
        "Rory McIlroy stuns Masters crowd after shot from trees 'falls from golfing heaven'",
        "Bahrain Grand Prix results changed as F1 star disqualified for replicating Hamilton breach",
        "Mercedes discover George Russell's Bahrain GP penalty fate as Lando Norris wait ends",
        "F1 LIVE: Max Verstappen calls for investigation as Lewis Hamilton sends frank message"
    ],
    "https://ca.sports.yahoo.com/top/rss.xml": [
        "Former AL Rookie of the Year Michael Fulmer brought up by Red Sox in return from Tommy John surgery",
        "Masters 2025 final round live updates, leaderboard: Rory McIlroy, Justin Rose set for exciting finish at Augusta National",
        "The dead in upstate NY plane crash included NCAA woman of the year and family members",
        "Is Spotify Technology S.A. (SPOT) the Best Kid-Friendly Stock to Buy According to Billionaires?",
        "Myles Straw drives in go-ahead run in 10th, Blue Jays beat Orioles 7-6"
    ],
    "http://www.theregister.co.uk/science/headlines.atom": [
        "AI is making hyperscalers' sustainability pledges look more and more like a Hail Mary",
        "UK's answer to DARPA sprouts new ideas, like programmable plants",
        "Laser-cooled chips: Maybe coming soon-ish to a datacenter near you",
        "Canada OKs construction of first licensed teeny atomic reactor",
        "Boffins turn Moon dirt into glass for solar panels, eye future lunar base power"
    ],
    "http://www.npr.org/rss/rss.php?id=1004": [
        "Convalescing Pope Francis opens Holy Week with greeting in St. Peter's Square",
        "More than 30 people killed in Russian missile attack on Ukrainian city of Sumy",
        "Israel strikes a hospital in Gaza, forcing evacuation as strikes intensify",
        "U.S. and Iran conduct first round of nuclear talks",
        "Facing drug-related violence, Ecuador goes to the polls Sunday"
    ],
    "http://feeds.bizjournals.com/industry_7": [
        "Billionaire Stephen Ross seeks to build Florida's next-generation economy",
        "SmartRent CEO steps down after less than two months on the job",
        "Axon-supported bill gains bipartisan lawmaker support. Here's what's next",
        "Netflix eyes first Seattle-area office, filings show",
        "Japa raises 1.3 million to grow its smart-parking market nationwide"
    ],
    "http://www.brandonsun.com/rss/?path=%2Fnational%2Fbreaking-news": [
        "Senators’ Cousins happy to return after extended time off due to injury",
        "Oilers sign defenceman Atro Leppanen to one-year entry-level contract",
        "Stutzle caps two-goal showing with OT winner to lift Sens past Flyers 4-3",
        "United States doubles Canada 2-1 in women’s world hockey championship",
        "Canada’s Homan falls 5-4 to Tirinzoni at AMJ Players’ Championship curling final"
    ],
    "http://rss.csmonitor.com/feeds/science": [
        "The world’s bananas are at risk. A volcanic island might protect them.",
        "NASA astronauts’ return is near. Their long, unlikely trip puts focus on resilience.",
        "US science funding was a bipartisan priority. Now it’s a target of federal cuts.",
        "China’s DeepSeek impresses. But is a ‘fast follow’ good enough in AI?",
        "Nvidia unveils new products from supercharged graphics chip to AI that trains robots"
    ],
    "http://www.pcworld.com/index.rss": [
        "Best PC computer deals: Top picks from desktops to all-in-ones",
        "Trump withdraws tariffs from PCs, components, smartphones",
        "Take 920 off on Samsung’s 49-inch OLED ultrawide gaming monitor",
        "Is your phone secretly listening to you? Here’s a simple way to find out",
        "Microsoft’s worst software flop was secretly lurking in Windows for years"
    ],
    "http://www.theguardian.com/technology/games/rss": [
        "Blue Prince review – exploring this game may become your new obsession",
        "Rematch packs five-a-side football with sweaty thrills",
        "‘Parents left picking popcorn out of their hair’: the meme-soaked magic of A Minecraft Movie",
        "Bafta games awards 2025: full list of winners",
        "South of Midnight review – beautiful surfaces can’t hide thin gameplay"
    ],
    "http://feeds.feedburner.com/daily-star-Gaming": [
        "Copa City boss talks moving from career in football to building his dream game",
        "GTA 6 release window narrows as Mafia: The Old Country date leaks",
        "'I've played the new Nintendo Switch 2 – here's why you should pre-order it'",
        "How Elder Scrolls Online is shaking up a ten-year-old game in 2025",
        "How EA F1 25's My Team 2.0 brings the best of 'Drive To Survive' to the video game"
    ],
    "http://feeds.foxnews.com/foxnews/tech": [
        "5 mobile privacy terms you need to know to protect yourself",
        "AI humanoid robot learns to mimic human emotions and behavior",
        "Hackers find a way around built-in Windows protections",
        "Fox News AI Newsletter: White House record-keeping revamp",
        "Is this robot after our hospitality, retail and healthcare jobs?"
    ],
    "http://www.smh.com.au/rssheadlines/technology-news/article/rss.xml": [
        "There’s one way you can make your super more secure",
        "Introducing NEO Gamma - Another Step Closer to Home",
        "New Elder Scrolls Online expansion unveiled",
        "Did an AI chatbot help draft the US tariff policy?",
        "Have we reached the point of ‘peak connectivity’? We’re just getting started"
    ],
    "http://indianexpress.com/section/technology/feed/": [
        "Binance seeks to curb US oversight during deal talks with Trump’s crypto company: Report",
        "Irish regulator investigates X over use of EU personal data to train Grok AI",
        "Google teases AR glasses at TED 2025, but don’t expect them to come out anytime soon",
        "Apple gets major relief as Trump exempts smartphones and computers from new tariffs",
        "Apple Maps on the web is no longer in beta, now available on Android devices"
    ],
    "http://feeds.webservice.techradar.com/rss/new": [
        "I build PCs for a living – here are the 6 worst things you’re doing to your PC (and how to fix them)",
        "Amazon has a ton of cheap tech gadgets on sale: here are 19 deals I'd buy from 19.99",
        "I tested this 300 mesh chair with a headrest, and it's way better than I expected",
        "Life360 helped me keep track of my loved ones in ways I never knew possible",
        "'Catastrophic overtraining' could harm large language AI models that are trained on more data for the sake of training"
    ],
    "http://www.livemint.com/rss/consumer": [
        "Star, Zee join hands for TV distribution venture",
        "Deep-voiced Scotty McCreery wins &amp;8220;American Idol&amp;8221;",
        "Mumbai knock KKR out of IPL, set up qualifier-II against RCB",
        "A new spin to the spin theory",
        "IPL reschedule due to assembly elections"
    ],
    "http://www.hellomagazine.com/rss.xml": [
        "Tamron Hall shares rare glimpse inside private family life with son Moses",
        "Meet Penélope Cruz's two famous siblings — the lookalike family in photos",
        "Today's Dylan Dreyer reveals frightening parenting experience with son Rusty during recent NYC outing",
        "Tracee Ellis Ross rocks liquid leather black dress — then gives it a complete makeover for NYC outing",
        "Kelly Clarkson has the wow factor in skinny jeans as she references her 'stronger' era"
    ],
    "http://www.menshealth.com/events-promotions/washpofeed": [
        "The Last Of Us Brings Pedro Pascal and Bella Ramsey Back for 7 Episodes of Post-Apocalyptic Drama",
        "The Evolution of Ab Training",
        "The Brutal True Story Behind Warfare",
        "OOFOS Ooaah Sport Slide Vs. Hoka Restore TC: Which Recovery Shoe Is Better For You?",
        "The 6 Best Toothpastes for Men in 2025, According to a Dentist"
    ],
    "http://www.nytimes.com/services/xml/rss/nyt/Business.xml": [
        "China Halts Critical Rare Earth Exports as Trade War Intensifies",
        "Trump’s Tariff War Has Added Risk to U.S. Bonds, Long the Surest Bet in Global Finance",
        "A Devastating Trade Spat With China Shows Few Signs of Abating",
        "The Treasury Secretary Is Wrong About How Most Retirees See the Stock Market",
        "How Should You Invest in 529 College Savings Plans During Market Swings?"
    ],
    "http://feeds.bbci.co.uk/sport/0/cricket/rss.xml?edition=uk": [
        "Sibley puts Surrey on course for win against Hants",
        "ICC forms taskforce to help Afghan female players",
        "Bess' maiden century leads Yorkshire to record win",
        "Kent wrap up eight-wicket win against Middlesex",
        "Irish World Cup hopes ended by loss to Bangladesh"
    ],
    "http://www.mirror.co.uk/sport/rss.xml": [
        "Brentford star issues apology to Arsenal's Gabriel Martinelli for 'leg breaking' tackle",
        "Thomas Partey makes Real Madrid admission ahead of crucial moment in Gunners 'project'",
        "Roy Keane's brutal Man Utd rant IN FULL after Newcastle loss: 'They're not good at anything'",
        "F1 news: Bahrain Grand Prix stewards confirm George Russell broke rules as driver disqualified",
        "Justin Thomas hoping to avoid Ryder Cup controversies after showing at the Masters"
    ],
    "http://feeds.feedburner.com/TheAtlanticWire": [
        "The 'Only' Profession to 'Celebrate What It Means to Live a Life'",
        "Corinne Found the Perfect Way to Rebel Against The Bachelor",
        "Viola Davis's Urgent Call to 'Exhume the Ordinary'",
        "What Moonlight’s Win Says About the Oscars’ Future",
        "Five Ways of Seeing Five Minutes of 'Real People' at the Oscars"
    ],
    "http://www.macworld.com/index.rss": [
        "Apple gets a tariff exemption on iPhones and, well, everything else",
        "Shure MV7i review: An all-in-one mic for podcasts and music",
        "Apple Maps on the web expands access to more devices and browsers",
        "Apple TV+ this week: ‘Your Friends and Neighbors’ is now streaming",
        "The delayed Siri Apple Intelligence features are now coming ‘in the fall’"
    ],
    "http://www.femina.in/feeds/feeds-fitness.xml": [
        "Phone a trainer",
        "Save your hair. Have soy",
        "Chocolates for your heart",
        "Get fitter in just 53 days",
        "9 ways to prevent diabetes"
    ],
    "http://feeds.bbci.co.uk/news/world/rss.xml": [
        "At least 34 people killed in Russian ballistic missile attack on Sumy",
        "Israeli air strike destroys part of last fully functional hospital in Gaza City",
        "Stars mingle in Coachella audience as Lady Gaga wows festivalgoers",
        "Teen killed parents as part of Trump assassination plot, says FBI",
        "Severe floods hit Lanzarote after torrential rain"
    ],
    "http://feeds.dailykos.com/dailykos/index.xml": [
        "Republicans race to heap praise on Trump's tariffs as economy spirals",
        "Cartoon: Prove it",
        "Slashed federal funding cancels vaccine clinics amid measles surge",
        "What does every Wall Street crash have in common? Republicans",
        "Black Music Sunday: Exploring scatting and vocalese for Jazz Appreciation Month"
    ],
    "http://feeds.feedburner.com/realclearpolitics/qlMj": [
        "It's Not Easy Being Green",
        "Starmer's Opportunity To Ride Trump Rollercoaster",
        "Trump's Team of Realists",
        "How the U.S.-China Battle Will Change Investing",
        "Democrats Don't Want Harris"
    ],
    "http://www.gamesindustry.biz/rss/gamesindustry_news_feed.rss": [
        "Influencer report highlights gender pay gap in sponsored content earnings",
        "Tariffs are an industry nightmare, but digital games seem safe – for now | Opinion",
        "Tequila Works auctions off game rights and IP following insolvency",
        "Video game M&A activity rises to 6.6 billion in Q1 2025, driven by mobile acquisitions",
        "Agonalea Games secures 2m in funding from Mika Capital"
    ],
    "http://variety.com/feed/": [
        "Supporters Rally to Save the Cinerama Dome as Future of Hollywood Theater Complex Remains Uncertain",
        "Who Killed Amy Winehouse? Asif Kapadia on the Case of the Dead Singer, and the ‘Really Heavy’ Version of ‘Amy’ His Wife Preferred",
        "Gustavo Dudamel on Why He Brought the LA Phil to Coachella, With LL Cool J and Other Guest Artists: ‘Wagner Wrote His Music for a Festival Wagner Had His Own Coachella’",
        "Melanie Lynskey on Doing a Natasha Lyonne Impression for ‘Coyote Ugly’ and Renegotiating Her ‘Two and a Half Men’ Contract: ‘It Was Not What I Was Expecting’",
        "Jean Marsh, Emmy Winner and ‘Upstairs, Downstairs’ Co-Creator, Dies at 90"
    ],
    "http://feeds.abcnews.com/abcnews/healthheadlines": [
        "Measles exploded in Texas after stagnant vaccine funding. New cuts threaten the same across the US",
        "RFK Jr. wants to target chronic disease in US tribes. A key program to do that was gutted",
        "France rugby star Chabal doesn't remember 'single second' of career due to concussion",
        "Australian woman unknowingly gives birth to a stranger's baby after IVF clinic error",
        "States sue over Trump administration's sudden halt of pandemic relief aid for schools"
    ],
    "http://globalnews.ca/tech/feed/": [
        "Filing your taxes? You might run into this CRA website ‘issue’",
        "Elon Musk says he plans to send his humanoid robots to Mars by 2026",
        "TikTok deal deadline extended after China pulled out over tariffs: reports",
        "Will TikTok be banned in U.S. again? Trump signals deal could be found",
        "What to know about Israeli spyware allegedly used by Ontario police"
    ],
    "http://feeds.foxnews.com/foxnews/science": [
        "Wolf made famous in 'Game of Thrones' brought back from 12,500-year extinction, US company claims",
        "'Well-preserved' baby mammoth dating back to Ice Age dissected by scientists: photos",
        "Spectacular blue spiral light brightens up night sky, likely from Space X rocket",
        "Rare ‘Sharktopus’ – an octopus riding a shark – sighting caught on camera shared by scientists",
        "'Alien' encounter: ISS crew member plays joke as SpaceX team arrives"
    ],
    "http://betakit.com/feed/": [
        "Inside Eric Migicovsky’s crazy journey to relaunch Pebble",
        "Wealthsimple’s acquihire, Shopify’s AI policy, and Nintendo’s Switch 2 confusion",
        "150 Canadian tech leaders urge federal parties to deliver plan for economic sovereignty in open letter",
        "Vancouver-based CO280 strikes 12-year carbon removal deal with Microsoft",
        "Corinex secures 42 million CAD to continue its European expansion"
    ],
    "http://feeds.arstechnica.com/arstechnica/technology-lab": [
        "That groan you hear is users’ reaction to Recall going back into Windows",
        "Researcher uncovers dozens of sketchy Chrome extensions with 4 million installs",
        "Researchers concerned to find AI models misrepresenting their “reasoning” processes",
        "OpenAI helps spammers plaster 80,000 sites with messages that bypassed filters",
        "After months of user complaints, Anthropic debuts new 200/month AI plan"
    ],
    "http://feeds.bbci.co.uk/news/entertainment_and_arts/rss.xml": [
        "Stars mingle in Coachella audience as Lady Gaga wows festivalgoers",
        "Upstairs Downstairs actress Jean Marsh dies age 90",
        "The Last of Us is back, and it's The Apprentice final: What's coming up this week",
        "Will Saturday Night Live spin-off make Britain laugh?",
        "Rourke leaves Big Brother after 'unacceptable behaviour'"
    ],
    "http://feeds.abcnews.com/abcnews/usheadlines": [
        "State Department wants staff to report instances of alleged anti-Christian bias during Biden's term",
        "Schumer seeks to halt flights for New York helicopter company after deadly Hudson River crash",
        "No injuries after Pennsylvania Gov. Shapiro's residence set on fire",
        "Winning numbers drawn in Saturday’s Powerball",
        "New gear could keep California crab fishermen on the water longer, and whales safe"
    ],
    "http://www.ft.com/rss/world/uk/politics": [
        "Why did the UK rush to save British Steel and what happens next?",
        "England’s busiest A&E department grapples with soaring demand for elderly care",
        "Share of domestic postgraduate researchers hits record low in England",
        "British Steel nationalisation is ‘likely option’, says business secretary",
        "Starmer vows to pass emergency law ‘in one day’ to save British Steel’s Scunthorpe site"
    ],
    "http://www.huffingtonpost.co.uk/feeds/verticals/uk-tech/index.xml": [
        "Farage Accused of 'Parroting Putin' For Suggesting Ukraine Give Up Crimea For Peace",
        "Volodymyr Zelenskyy Blames 'Filthy Scum' After Dozens Of Civilians Killed In Russian Attack",
        "Tory Splits Erupt Over Kemi Badneoch's Call For Council Coalitions With Reform UK",
        "This Is The Frustrating Truth Behind Why Painkillers Are Less Effective For Women",
        "'Frankly A Bit Weird': Senior Tory Blasted For Claiming Lib Dems Want '4-Day Week And Veganism'"
    ],
    "http://feeds.feedburner.com/BreitbartFeed": [
        "FBI: Wisconsin Teen Murdered Parents in 'Extremist' Plot to Fund Assassination of President Trump",
        "Summer of Rage, Part I: Militant Pro-Abortion Radicals Flourish in Madison, Wisconsin; Violence ‘Meme'd’ on Twitter",
        "WATCH: Stephen A. Smith 'Has No Choice' But to Consider Presidential Run, 'Disgusted' by Both Parties",
        "Cory Booker Does Not Rule Out 2028 Presidential Run",
        "Booker: Congress Should Hold Hearings on Insider Trading During Trump Tariffs"
    ],
    "http://www.bollywoodlife.com/feed/": [
        "Sunita Ahuja gives a shocking reaction when asked about Govinda; netizens react, 'Har jagah...' [Watch]",
        "Kylie Jenner and Timothée Chalamet spotted kissing and getting cosy at Coachella 2025; netizens react, 'There's something...' [Watch]",
        "Are Tara Sutaria and Badshah dating? Shilpa Shetty teases the rapper, netizens react, 'As usual...'",
        "Celebrity MasterChef winner Gaurav Khanna says 'You can't block...'; netizens react, 'Kiski itni himmat'",
        "Mere Humsafar to Zindagi Gulzar Hai: Heartwarming Pakistani dramas to binge with your partner"
    ],
    "http://www.theguardian.com/fashion/rss": [
        "Suede to go: leather’s hippy cousin is back for 2025",
        "We love: fashion fixes for the week ahead – in pictures",
        "Balenciaga and orthopaedic brand Scholl team up for ‘Frankenshoe’ hybrid",
        "The perfect ‘new’ handbag? An old one | Jess Cartner-Morley on fashion",
        "Cool condiments: ‘little treat culture’ leading to boom in preserves and sauces"
    ],
    "http://feeds.news.com.au/public/rss/2.0/ausit_exec_topstories_385.xml": [
        "Things just got personal again",
        "Mercedes steering health drive",
        "Glimpse of the future at Vegas",
        "Mirror tracks your wrinkles",
        "Samsung QLED takes on OLED"
    ],
    "http://feeds.feedburner.com/NationPBSNewsHour": [
        "News Wrap: Sessions insists he didn’t lie about Russian contacts to Senate",
        "Escaping Harvey Weinstein was a ‘cat-and-mouse game,’ says Katherine Kendall",
        "WATCH: NFL commissioner says players ‘should stand for the national anthem’",
        "Column: For black athletes, wealth doesn’t equal freedom",
        "Twitter chat: How the gun control debate mirrors larger issues of partisanship in America"
    ],
    "http://feeds.news.com.au/public/rss/2.0/news_lifestyle_3171.xml": [
        "Hilarious Channel 7 gaffe goes viral",
        "Dave Hughes takes on Sam Kekovich",
        "‘Hang on, aren’t we all boat people?’",
        "Sunscreen leaves kids ‘screaming in pain’",
        "ALDI’s tough stance on alcohol"
    ],
    "http://feeds.glamour.com/glamour/health_fitness": [
        "Dried Fruit and Nuts: When Is the Best Time to Eat Them?",
        "13 Best Whitening Toothpastes 2025, Approved by Dentists",
        "Why Am I Always Tired? Here Are 7 Common Reasons Why You Might Be Feeling Fatigue",
        "Teddi Mellencamp Reveals Multiple Brain Tumors: Here’s Everything the ‘RHOBH’ Star Has Shared About Her Diagnosis",
        "12 Best Teeth-Whitening Products, According to Dentists 2025"
    ],
    "http://www.nytimes.com/services/xml/rss/nyt/InternationalBusiness.xml": [
        "China Halts Critical Rare Earth Exports as Trade War Intensifies",
        "Trump’s Tariff War Has Added Risk to U.S. Bonds, Long the Surest Bet in Global Finance",
        "A Devastating Trade Spat With China Shows Few Signs of Abating",
        "The Treasury Secretary Is Wrong About How Most Retirees See the Stock Market",
        "How Should You Invest in 529 College Savings Plans During Market Swings?"
    ],
    "http://feeds.newscientist.com/health": [
        "'Quantum Darwinism' may explain why we live in a shared reality",
        "What the surprising lives of solitary animals reveal about us",
        "How to spot Haumea, one of the solar system's strangest objects",
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind"
    ],
    "http://www.smh.com.au/rssheadlines/health/article/rss.xml": [
        "DeChambeau finds the water",
        "China halts critical mineral, magnet exports as trade war intensifies",
        "The Masters 2025 final round LIVE: McIlroy hits nightmare shot into water for double bogey as Rose mounts challenge for green jacket",
        "Federal election 2025 LIVE: Albanese, Dutton signature policies revealed; economists warn of house price surge",
        "‘This is wrong’: Russian missiles hit Palm Sunday celebrations"
    ],
    "http://www.cbsnews.com/latest/rss/main": [
        "The Gilgo Beach Serial Killings",
        "4/9: The Daily Report",
        "Apr 9: CBS News 24/7, 1pm ET",
        "Watch Live: Shapiro, police share update fire governor's mansion fire",
        "Trump, Xi don't have any plans to speak, trade representative says"
    ],
    "http://www.abc.net.au/news/feed/1534/rss.xml": [
        "Labor launches campaign in WA, but will it win over wary voters?",
        "Live: Albanese campaigns in Adelaide as Dutton moves to shore up Brisbane",
        "They're two of the most powerful men in Australia, but who are they really?",
        "How Labor and the Coalition's pitches to first home buyers compare",
        "Russian ambassador leaves Canberra amid uncertainty over replacement"
    ],
    "http://feeds.newscientist.com/tech": [
        "'Quantum Darwinism' may explain why we live in a shared reality",
        "What the surprising lives of solitary animals reveal about us",
        "How to spot Haumea, one of the solar system's strangest objects",
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind"
    ],
    "http://www.npr.org/rss/rss.php?id=1003": [
        "Why one deportation case has legal scholars afraid for even U.S. citizens",
        "Fire at Pennsylvania Gov. Josh Shapiro's residence was 'an act of arson,' police say",
        "At least one dead after small plane crashes in upstate New York",
        "Trump administration's call for the death penalty for Luigi Mangione signals a larger shift",
        "Politics chat: Trump to meet with Salvadoran President Nayib Bukele"
    ],
    "http://www.cnet.com/rss/iphone-update/": [
        "Best Phone to Buy for 2025",
        "Think You Need to Delete Stuff to Free Up iPhone Space? Think Again",
        "Map Your Hikes This Spring With This iOS Feature on iPhone",
        "Best Mobile VPN of 2025: Stream on the Go and Avoid Mobile Traffic-Shaping",
        "iPhone 20th-Anniversary Edition Could Bring Major Design Overhaul"
    ],
    "http://www.starobserver.com.au/category/features/healthy-living/feed": [
        "Navigating Non-Binary Fashion In A Binary World",
        "Your Guide To Enjoying Transmasculine Sex",
        "Gender Neutral Blood Donation Comes With Sting In Its Tail",
        "Start 2021 Fresh With These 12 New Year Resolutions",
        "Stay safe online"
    ],
    "http://feeds2.feedburner.com/bit-tech/all": [
        "The end",
        "Intel Core i9-12900K claimed to be the World's Best Gaming Processor",
        "Inscryption Review",
        "PrimeStation Pulsar fanless workstation PC unveiled",
        "Shadow of the Tomb Raider gets Denuvo removal boost"
    ],
    "http://rss.nytimes.com/services/xml/rss/nyt/Health.xml": [
        "The Many Ways Kennedy Is Already Undermining Vaccines",
        "Experts Doubt Kennedy’s Timetable for Finding the Cause of Autism",
        "RFK Jr. Accuses FDA of Drug Industry Influence That Barred Alternative Remedies",
        "Pig Kidney Removed From Alabama Woman After Organ Rejection",
        "Trump Administration Delays Plan to Limit Pricey Bandages"
    ],
    "http://timesofindia.indiatimes.com/rssfeeds/2886714.cms": [
        "8 signs your liver is screaming for healthy diet and consistent workout",
        "Why do Indians have pot belly and what to do about this dangerous area of fat storage",
        "Losing height due to posture? 7 simple exercises that come to your rescue",
        "10 silent cancer dangers sneakily hiding in homes",
        "THESE US cities have the most obese people"
    ],
    "http://www.buzzfeed.com/tvandmovies.xml": [
        "You'll Need Very Good Visual Knowledge To Guess This Movie Quote From The Picture Clues",
        "Aimee Lou Wood Says The SNL Parody Of The White Lotus Was Mean And Unfunny",
        "Eva Mendes Made A Rare Comment About Ryan Gosling, And This Is Why We Need More Them In Our Lives",
        "Here's Why Mickey Rourke Was Asked To Leave Celebrity Big Brother",
        "People Are Sharing The TV Shows From Their Childhood They SWEAR Nobody Else Watched, And It Feels Like One Big Fever Dream"
    ],
    "http://rss.cnn.com/rss/cnn_allpolitics.rss": [
        "How Kyrsten Sinema's decision makes Democrats' 2024 Senate map tighter",
        "Meet the woman steering Biden's bipartisan winning streak on Capitol Hill",
        "CNN Political Briefing",
        "The Axe Files with David Axelrod",
        "Margins of Error"
    ],
    "http://www.standard.co.uk/sport/football/rss": [
        "Arsenal: Brentford captain Christian Norgaard apologises for Gabriel Martinelli ‘leg breaker’",
        "Arsenal star offers first insight into tactics for Real Madrid return leg",
        "Newcastle 4-1 Manchester United: Harvey Barnes stars as Magpies end 94-year wait",
        "Enzo Maresca frustrated with Chelsea fans for 'environment' created in Ipswich draw",
        "Tottenham: Ange Postecoglou blames 'unusual' individual errors for Wolves defeat but backs Guglielmo Vicario"
    ],
    "http://indianexpress.com/section/india/feed/": [
        "Airport, thermal power plant: PM to launch slew of projects in Haryana today",
        "‘50 bombs’ claim: Punjab LoP booked after questioning",
        "Karnataka to launch 33 special police stations to probe atrocities against SC/ST communities on Ambedkar anniversary",
        "Tamil Nadu Governor asks college students to chant ‘Jai Shri Ram’, stokes new row",
        "Lord Rama idol installed in place of Tripura ex-deputy CM Baidyanath Majumder’s vandalised statue"
    ],
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_morenews_2794.xml": [
        "Motorcyclist dead in horror truck smash",
        "Two more agencies admit underquoting",
        "Hilarious TV vox pop gaffe",
        "Factories damaged in huge blaze",
        "How a dating site aids liver transplant success"
    ],
    "http://www.gamesradar.com/all-platforms/news/rss/": [
        "We based our decisions on that selling 100,000 copies over 2 years, it did 200,000 copies in the first month: Indie publisher says planning small is key to its success",
        "Bungie thinks Marathon can coexist with games like Escape from Tarkov and help players get to the survival storytelling a little bit faster",
        "The Legend of Zelda: Breath of the Wild's divisive weapon durability is getting a workaround, but it's locked to the Nintendo Switch 2 Edition app",
        "FromSoft master modder brings their seamless co-op mod to Dark Souls Remastered, easing the wait for Elden Ring Nightreign and The Duskbloods",
        "I looked it up and said ah, f***: As Balatro took over the world, another publisher was sweating over its own card roguelike – which LocalThunk then promoted himself"
    ],
    "http://www.techtree.com/rss.xml": [
        "“It’s the all-in-one capabilities that make UST projectors a hit in home entertainment,” says Sushil Motwani",
        "“Laser projectors can drive the green revolution in the home entertainment segment,” says Sushil Motwani",
        "Top home projectors to elevate your F1 racing experience",
        "POCO C71: Segment’s Ultimate Blockbuster is Here",
        "UNIX Launches Solo (UX-900 Pro) Neckband with ENC Technology and up to 62+ Hours of Playtime"
    ],
    "http://www.gamespot.com/feeds/mashup/": [
        "How To Solve Eight Realms In Eight Months In Blue Prince",
        "Bungie's Marathon Releases In September On Same Day As Another Big Game",
        "Marathon Closed Alpha Begins In April, Here's How To Sign Up",
        "Bungie's Marathon Is A Polished Extraction Shooter, But That Might Not Be Enough",
        "Trails Beyond The Horizon Deluxe And Collector's Edition Preorders Available Now"
    ],
    "http://www.journaldemontreal.com/rss.xml": [
        "«C’était vraiment une surprise»: Demidov s’entraîne au Complexe CN de Brossard",
        "Contre Trump: faire comme l’Europe avec la Chine",
        "Le pouvoir terrifiant d’un seul homme à semer le chaos",
        "Un ado de 17 ans aurait tué ses parents et planifié d’assassiner Donald Trump",
        "Fraudés jusqu'à la mort: une dame sauvée par son entourage qui ne l'a jamais lâchée"
    ],
    "http://dailycaller.com/section/politics/feed/": [
        "EXCLUSIVE: Jon Husted Is Ready To Get To Work — In The Senate And On The Campaign Trail",
        "Pennsylvania Governor’s Mansion Targeted By Arson Attack",
        "‘Fully Fit’: White House Physician Releases Details On President Trump’s ‘Excellent Health’",
        "‘She Has No Choice’: Stephen A. Smith Calls Out ‘Foolish And Immature’ Critics Of Dem Gov Who Met Trump",
        "‘I’ve Been Called Worse’: Peter Navarro Dismisses Rumors Of Musk Feud, Being ‘Sidelined’"
    ],
    "http://feeds.feedburner.com/TechCrunch/": [
        "Top 10 AI Tools That Will Transform Your Content Creation in 2025",
        "LimeWire AI Studio Review 2023: Details, Pricing & Features",
        "Top 10 AI Tools in 2023 That Will Make Your Life Easier",
        "Top 10 AI Content Generator & Writer Tools in 2022",
        "Beginner Guide to CJ Affiliate (Commission Junction) in 2022"
    ],
    "http://feeds.feedburner.com/the-edge-susu": [
        "Why Helen Hardt’s ‘The Blood Bond Saga’ Should Have a TV Adaptation",
        "Review: SUSU Theatre Group’s ‘Macbeth’ @ The Annex",
        "An Interview with Peter Hook"
    ],
    "http://feeds.feedburner.com/FP_TopStories?format=xml": [
        "Making the most of market volatility: FP Video on the latest tariff tangents",
        "Posthaste: Stressed-out bond markets forced Trump into tariff U-turn. Could it happen again?",
        "Bond vigilantes are back raising the spectre of an American face-off",
        "Canada's next government will have to deal with an immigration system that has 'lost its brand'",
        "Energy on the ballot: The key to Canadian prosperity"
    ],
    "http://www.tigsource.com/feed/": [
        "Black Lives Matter",
        "The Wholesome Competition",
        "Dive into Early Access with We Need to go Deeper",
        "A Good Bundle – This is Fine",
        "Fantastic Arcade 2016"
    ],
    "https://news.google.com/news/feeds?cf=all&ned=in&hl=en&topic=b&output=rss": [
        "17 companies of CAPF deployed in Murshidabad, situation under control says West Bengal DGP - The Hindu",
        "5-year-old girl abducted and killed in Karnataka's Hubballi; accused shot dead in police encounter - Times of India",
        "In NIA custody, Tahawwur Rana demands 3 things - Quran, pen and - Hindustan Times",
        "U.S. NSA Waltz puts off India visit amid ‘Signalgate’ controversy - The Hindu",
        "Muslim population in Karnataka increased by 5.16 in 4 years, reveals survey by the state govt - OpIndia"
    ],
    "http://www.npr.org/rss/rss.php?id=1014": [
        "Fire at Pennsylvania Gov. Josh Shapiro's residence was 'an act of arson,' police say",
        "Bernie Sanders warns of 'extraordinary danger' facing U.S. under Trump at LA rally",
        "White House doctor says Trump is 'fully fit' in medical report",
        "A retrial of Sarah Palin's case against 'New York Times' begins Monday",
        "Will the SAVE Act make it harder for married women to vote? We ask legal experts"
    ],
    "http://www.smh.com.au/rssheadlines/business.xml": [
        "China halts critical mineral, magnet exports as trade war intensifies",
        "Stocks set to lift despite consumer worries about rising prices",
        "Memo Dutton: Good economic managers don’t try to panic the punters",
        "‘Not going to stand for this’: The IKEA exec emboldened by Donald Trump",
        "Tariff war could put brakes on post-COVID travel surge"
    ],
    "http://zeenews.india.com/rss/science-technology-news.xml": [
        "ISRO’s POEM-4 Safely Re-Enters Earth’s Atmosphere, Reinforces Space Debris-Free Commitment",
        "India Is Amazing From Space, For Sure Going Back To My Father's Home Country: NASA Astronaut Sunita Williams",
        "Nasa Astronaut Sunita Williams Begins 45-Day Rehabilitation Programme To Tackle Likely Health Challenges After Prolonged Stay In Space",
        "Sunita Williams Begins Return Journey To Earth After 9 Months: NASA SpaceX Crew-9 Departs ISS",
        "3.5-Billion-Year-Old Crater Discovery Sheds Light On Earth's Ancient Impact History"
    ],
    "http://www.cbssports.com/partners/feeds/rss/home_news": [
        "2025 Masters TV schedule, coverage, channel, where to watch online, how to live stream today, golf tee times",
        "76ers coach Nick Nurse, exec Daryl Morey will return next season despite disappointing 2024-25 campaign",
        "Justin Steele injury: Cubs lose valuable starter to season-ending elbow surgery",
        "2025 NBA playoff TV schedule: Postseason dates, game times, matchups, bracket for first round and play-in",
        "Cubs vs. Dodgers odds, prediction, props: Free 2025 MLB picks, Sunday Night Baseball bets by proven model"
    ],
    "http://feeds.newscientist.com/space": [
        "'Quantum Darwinism' may explain why we live in a shared reality",
        "What the surprising lives of solitary animals reveal about us",
        "How to spot Haumea, one of the solar system's strangest objects",
        "Where Schrödinger’s cat came from – and why it’s getting fatter",
        "We're finally uncovering fibre's remarkable benefits for body and mind"
    ],
    "http://rss.cnn.com/rss/edition_business.rss": [
        "Mexico ready to retaliate by hurting US farmers",
        "Will the next iPhone charge wirelessly?",
        "How 'America First' could turn into to 'India First'",
        "Swiss voters reject corporate tax overhaul",
        "Stocks hit record again. Is Trump the reason?"
    ],
    "http://feeds.theguardian.com/theguardian/politics/rss": [
        "British Steel to deploy emergency measures to save Scunthorpe furnaces",
        "Arrest warrant issued in Bangladesh for UK MP Tulip Siddiq",
        "Gordon Brown accuses Trump of ‘weaponising’ global trade system",
        "UK wants explanation after MP refused entry to Hong Kong",
        "UK could target parts of Chinese state under new foreign influence rules"
    ],
    "http://www.pnas.org/rss/Feature_Article.xml": [
        "In This Issue",
        "Validating new limits for human thermoregulation",
        "Meltdown of trust in weakly governed economies",
        "Digital phenotyping using smartphones could help steer mental health treatment",
        "An unusual potassium conductance protects Caenorhabditis elegans pharyngeal muscle rhythms against environmental noise"
    ],
    "http://www.cnet.com/rss/news/": [
        "Today's NYT Strands Hints, Answers and Help for April 14, 407",
        "Today's NYT Connections Hints, Answers and Help for April 14, 673",
        "Today's Wordle Hints, Answer and Help for April 14, 1395",
        "Best Internet Providers in Las Cruces, New Mexico",
        "I'm a Tax Pro. These Tax Breaks Confuse My Clients Every Year"
    ],
    "http://feeds.examiner.ie/ietopstories": [
        "Special school campaigner 'gobsmacked' son still without place for September",
        "Anti-immigration activist Derek Blighe quits Ireland First party",
        "McIlroy goes for glory after rollercoaster start at Augusta",
        "Body of man, 60s, found at residence in Co Donegal",
        "Family of Cork man killed in road collision left 'heartbroken'"
    ],
    "http://www.dailymail.co.uk/tvshowbiz/articles.rss": [
        "Tributes pour in as Kyle and Jackie O Show's ex-producer suddenly dies aged 39 - just months after husband was diagnosed with stage-four cancer",
        "Mickey Rourke cuts a sombre figure as he's seen for the FIRST time since being removed from Celebrity Big Brother following shocking foul mouthed rant",
        "Georgia Kousoulou teases insight into upcoming second wedding to Tommy Mallet from TOWIE guest list to sun-soaked secret location and why the groom has been 'banned' from helping",
        "Bella Hadid looks happy and healthy in black leather look while filming new series The Beauty in Paris - one day after sparking concern with VERY thin frame",
        "'Putting the ASS in astronaut': Katy Perry and Lauren Sanchez debut 'sexy' space suits for all-female Blue Origin rocket launch - as Jeff Bezos' wife reveals she will wear Kim Kardashian's SKIMS underwear for the occasion"
    ],
    "http://www.theage.com.au/rssheadlines/technology-news/article/rss.xml": [
        "There’s one way you can make your super more secure",
        "Introducing NEO Gamma - Another Step Closer to Home",
        "New Elder Scrolls Online expansion unveiled",
        "Did an AI chatbot help draft the US tariff policy?",
        "I paid an athlete 120 to send me a personalised video. You can, too"
    ],
    "http://www.thehealthsite.com/comments/feed/": [
        "Comment on Sunita Williams Press Conference Live: NASA Astronaut To Share 9 Month Space Experience On March 31 – Where To Watch by Laurine Lowe",
        "Comment on Live News: Sunita Williams Considered Retirement Before Going To ISS – Family Shares NASA Astronaut’s Struggles In Space by jokerbet giriş",
        "Comment on Unexpected Delivery: Pregnant Woman Gives Birth On Bangkok Street Amid Strong Quake – WATCH VIDEO by jokerbet güncel",
        "Comment on Kamakhya Express Derails Near Odisha’s Cuttack: Impact of Train Accidents On Passengers’ Mental Health by jokerbet güncel giriş",
        "Comment on Unexpected Delivery: Pregnant Woman Gives Birth On Bangkok Street Amid Strong Quake – WATCH VIDEO by jokerbet giriş"
    ],
    "http://www.watoday.com.au/rssheadlines/technology-news/article/rss.xml": [
        "There’s one way you can make your super more secure",
        "Introducing NEO Gamma - Another Step Closer to Home",
        "New Elder Scrolls Online expansion unveiled",
        "Did an AI chatbot help draft the US tariff policy?",
        "I paid an athlete 120 to send me a personalised video. You can, too"
    ],
    "http://feeds.skynews.com/feeds/rss/technology.xml": [
        "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
        "Company started by 'two blokes in a Cardiff garage' is about to launch a game-changing space factory",
        "Erin Brockovich: 'My chiropractor saw mud on my stiletto - I said, I've been collecting dead frogs'",
        "From AI Barbie to 'Ghiblification' - how ChatGPT's image generator put 'insane' pressure on OpenAI",
        "Nintendo Switch 2 launches straight into Trump's trade war"
    ],
    "http://www.deccanchronicle.com/rss.xml": [
        "Farmers Set to Get Bhudhar: Ponguleti",
        "HC Acquits Two Medical Paper Evaluators",
        "KK's Grandson Caught Driving Drunk, BAC 5 Times Over Limit",
        "Waqf Act Is Now National Issue For Justice: Imran Masood",
        "HMDA Curates Tribute for Ambedkar"
    ],
    "http://www.femina.in/feeds/feeds-lifestyle.xml": [
        "Did you know that rose is 35 million year-old?",
        "How to tell a good loan from a bad one",
        "Safety tips for solo woman traveller",
        "Bollywood posters copied from Hollywood",
        "Tips to make your small house look bigger"
    ],
    "http://feeds.news.com.au/public/rss/2.0/business_top_stories_346.xml": [
        "‘I have a conflict situation as President’",
        "ALDI’s tough stance on alcohol",
        "Creepy Airbnb host reveals ulterior motive",
        "The crazy thing we’re still buying",
        "Why you’re getting poorer right now"
    ],
    "http://globalnews.ca/canada/feed/": [
        "Poilievre targets Carney’s assets, promises tougher ethics rules",
        "Aggie Days marks 40 years of showcasing Canadian agriculture",
        "Liberals lead dips for 1st time in Canada election as Tories gain: poll",
        "The Auto Experience show returns to Edmonton as new vehicle tariff rules begin",
        "Lethbridge Trail Alliance kicks off first coulee trail maintenance day"
    ],
    "http://www.theguardian.com/tv-and-radio/entertainment/rss": [
        "‘We grew up among drugs and violence. Dance kept us focused’: Oti Mabuse on Strictly, survival and self-belief",
        "‘I’m like the TV Lorraine - just more sweary’: at home with the queen of the small screen",
        "Eddie Kadi: ‘People think I’m always ready to crack jokes. If you’re a doctor, I don’t ask you to operate on me’",
        "UK creative industries set behaviour standards after Strictly and MasterChef rows",
        "Wynne Evans to ‘take time out’ from Strictly Come Dancing live tour"
    ],
    "http://twitchy.com/category/us-politics/feed/": [
        "The Economist DRAGGED for Claim Europe (Where They Jail You for MEMES) Is Now Land of the Free",
        "IRONY: Clooney’s 'Goodnight and Good Luck' Ends With Image of Musk That PROVES Media Trust Is DEAD",
        "Did You See That Poll Result Frank Luntz Shared About People Working in 'Manufacturing'?",
        "TDS Turns DEADLY: WI Teen Kills Parents As Part of Plot to Assassinate Trump, Overthrow Government",
        "'35 Years': Newt Gingrich Shares an Anecdote From Grover Norquist About GOP and Taxes"
    ],
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_technology_2790.xml": [
        "Galaxies collide in stunning picture",
        "Apple’s biggest product since the iPhone",
        "Rare ‘Morning Glory’ cloud dazzles Virgin flyers",
        "Towns ‘too hot to wear shorts’",
        "The gadget for the perfect coffee"
    ],
    "http://feeds.bbci.co.uk/news/technology/rss.xml": [
        "Everyone's jumping on the AI doll trend - but what are the concerns?",
        "Microsoft rolls out AI screenshot tool dubbed 'privacy nightmare'",
        "OpenAI sues Elon Musk claiming 'bad-faith tactics'",
        "Will iPhones cost more because of Trump's tariffs on China?",
        "Leave school phone bans to head teachers, children's commissioner says"
    ],
    "http://feeds.feedburner.com/uk/gizmodo": [
        "Godzilla Ain’t Just Invading Marvel, He’s Gonna Destroy It",
        "Disney Teases Its Adventurous New Lion King and Up Rides",
        "For the First Time, Artificial Intelligence Is Being Used at a Nuclear Power Plant",
        "Beyond Showerheads: Trump’s Attempts to Kill Appliance Regulations Cause Chaos",
        "Marvel Really Wants You to Know Thunderbolts’ Skyscraper Scene is Real"
    ],
    "http://www.theguardian.com/uk/environment/rss": [
        "‘They called it black gold’: but should cuttlefish be on our menus?",
        "‘Unprecedented’ sightings of Asian hornets raise fears for UK bees",
        "‘Toxic cocktail’: study finds almost 200 pesticides in European homes",
        "‘People love being here’: London development shows harmony between nature and housing",
        "California’s 59bn agriculture industry reels under Trump’s wavering tariffs"
    ],
    "http://feeds.arstechnica.com/arstechnica/business": [
        "Genetic testing company 23andMe declares bankruptcy",
        "You’ll be paying extra for ad-free Prime Video come January",
        "EA cracks down on modders selling their custom Sims 4 content",
        "HP wins huge fraud case against Autonomy founder and CEO Mike Lynch",
        "Ars online IT roundtable: What’s the future of the data center?"
    ],
    "http://feeds.feedburner.com/IeeeSpectrumRoboticsChannel": [
        "Video Friday: Tiny Robot Bug Hops and Jumps",
        "Video Friday: RIVR Delivers Your Package",
        "How Dairy Robots Are Changing Work for Cows (and Farmers)",
        "Protecting Robots in Harsh Environments with Advanced Sealing Systems",
        "The Tiniest Flying Robot Soars Thanks to Magnets"
    ],
    "http://www.thehindu.com/sci-tech/health/?service=rss": [
        "As malaria cases fall, a look at Tamil Nadu’s strategies for elimination",
        "New working group on malnutrition-induced diabetes formed at recent World Diabetes Congress",
        "Ensuring consistent, year-round blood donation can help overcome seasonal fluctuations, resolve supply challenges: experts",
        "Three docs booked as pregnant woman dies at UP hospital; CMO recommends sealing facility",
        "New fitness metric may predict heart disease risk better than steps or heart rate, finds study"
    ],
    "http://www.healthcareitnews.com/home/feed": [
        "Cedars-Sinai CAIO: AI is transforming relationship between caregivers and IT",
        "Dayton VAMC rolls out IT upgrades ahead of EHR transition",
        "Picture this: Carle Health gains sizable rewards with enterprise imaging system",
        "Vendor notebook: Google and IBM make moves on clinical and business AI",
        "HHS employees fear IT staff reductions could destabilize agency"
    ],
    "http://www.film-news.co.uk/rss/UK/news": [
        "Charlotte Le Bon shares shock sex party story",
        "Finn Wolfhard left 'sad' over Stranger Things ending",
        "Jennifer Aniston admits snacking on harmful products",
        "Sarah Michelle Gellar pays tribute to Shannen Doherty on late star's birthday",
        "Jenna Ortega isn't ready to make her own films yet"
    ],
    "http://www.chartattack.com/feed/": [
        "How to Introduce Adult Toys Into Your Relationship Without Awkwardness",
        "What Men Like During Intimate Moments – The Subtle Moves That Drive Them Wild",
        "Can Adult Toys Help Improve Your Sex Life Without Overstepping Boundaries?",
        "What Happens When Your Blood Sugar Is Too High? Signs and Solutions",
        "How to Keep Your Relationship Exciting and Full of Surprises"
    ],
    "http://feeds.news.com.au/public/rss/2.0/wtn_top_3368.xml": [
        "Big picture show catches on",
        "Fund for regions rebranded",
        "Farm production to be ‘worth 58.5b’",
        "CFA volunteers rally in Vic over deal",
        "Farming out skills to land a job"
    ],
    "http://www.engadget.com/rss.xml": [
        "Bungie shares first looks at gameplay from its new shooter, Marathon, alongside a release date",
        "iPad software will reportedly get more Mac-like with the iPadOS 19 redesign",
        "Electronics exempted from reciprocal tariffs will soon be subject to new semiconductor tariffs instead",
        "Apple is reportedly working on two new versions of the Vision Pro",
        "Doctor Who ‘The Robot Revolution’ review: Meet Belinda Chandra"
    ],
    "http://economictimes.indiatimes.com/News/rssfeeds/1715249553.cms": [
        "Firing is one thing, but physically dragging a Social Security worker from the office goes too far; that's what DOGE workers did to a staff member this week",
        "Tango with a twist: China cold to real India ties",
        "ESG consulting firm Uniqus in talks to raise 20 million in Series C",
        "India's first laser weapon hits aerial targets in trial",
        "Is this the reason why Donald Trump said he doesn't really need Elon Musk; President's officials are now getting irritated with him"
    ],
    "http://www.standard.co.uk/news/politics/rss": [
        "Siddiq denies wrongdoing as reports say Bangladesh court issues arrest warrant",
        "Israel’s latest strike on Gaza hospital is ‘appalling’, says Archbishop of York",
        "Summon Chinese ambassador after MP refused entry to Hong Kong – Davey",
        "Record number of migrants cross English Channel in first four months of year",
        "Harris condemns ‘despicable’ Russian missile attack on Ukrainian city of Sumy"
    ],
    "http://www.theguardian.com/music/rss": [
        "Max Romeo was a great social commentator, railing against inequality and discord",
        "Lady Gaga at Coachella review – a thrilling all-timer of a performance",
        "Green Day at Coachella review – fun but muddled set pokes fun at American Idiots",
        "Olly Alexander review – part night creature, part light entertainer",
        "One to watch: Pozer"
    ],
    "http://www.oxfordmail.co.uk/news/rss/": [
        "Police at scene after multi-vehicle crash on M40 sparks 40-min delays",
        "LOOKING BACK: books and reading in Oxfordshire over the years",
        "LOOKING BACK: world records set in Oxfordshire over time",
        "LOOKING BACK: Oxfordshire's early electric vehicles in archive pictures",
        "Gang of three 'slash man with knife' after trying to take phone"
    ],
    "http://feeds.news.com.au/public/rss/2.0/bcm_top_stories_257.xml": [
        "Secret tape not the only talking point",
        "‘It’s still a prison. I feel like an animal’",
        "Shock toxic water findings",
        "Living in fear for my family",
        "Wild weather: ’It was like a tidal wave’"
    ],
    "http://www.theguardian.com/us/environment/rss": [
        "The rise of end times fascism | Naomi Klein and Astra Taylor",
        "Inside the fight to save California’s dying sea lions from toxic algae: ‘We’re like 911 operators’",
        "Mexico to send water to Texas farmers as US treaty threat grows",
        "Noaa fires hundreds of climate workers after court clears way for dismissals",
        "Trump administration cuts 4m to Princeton’s climate research funding"
    ],
    "http://feeds.bbci.co.uk/news/politics/rss.xml": [
        "MP barred from Hong Kong says it was to 'shut me up'",
        "Reynolds refuses to say if steel furnaces can keep running",
        "Bangladesh issues arrest warrant for British MP Tulip Siddiq",
        "Chris Mason: British Steel law rushed through Parliament but it is just a stop gap",
        "UK takes control of British Steel under emergency powers"
    ],
    "http://time.com/tech/feed/": [
        "Trump Wants Tariffs to Bring Back U.S. Jobs. They Might Speed Up AI Automation Instead",
        "How Rare Earths Are Playing a Pivotal Role in the U.S.-China Trade War",
        "How Trump’s Tariffs Could Make AI Development More Expensive",
        "How Crypto Legislation Could Hand Big Tech the Keys to Banking",
        "What Are Stablecoins?"
    ],
    "http://www.skysports.com/rss/0,20514,12040,00.xml": [
        "Transfer Centre LIVE Guardiola confirms Gundogan contract extension",
        "Ridari and Uther lay down Classic claims",
        "McIlroy makes horror start before roaring clear | Story of Rory's front nine",
        "Rory's shot of the tournament? McIlroy makes incredible approach through the trees",
        "'Welcome back Rory' | McIlroy makes back-to-back birdies to regain control"
    ],
    "http://globalnews.ca/sports/feed/": [
        "Raptors sign centre Colin Castleton",
        "Demidov fever: New Montreal Canadiens sniper bringing fanfare frenzy",
        "Toronto Raptors waive Robinson and Swider",
        "Mogbo has first triple-double of his career",
        "Raptors dominate Hornets despite resting starters"
    ],
    "http://feeds.news.com.au/heraldsun/rss/heraldsun_news_sport_2789.xml": [
        "Inspired Wales top group as England falter",
        "Delly’s amazing road to NBA glory",
        "Gal lines up SBW bout - and McGuire too",
        "Joey joins the Pommy campaign",
        "Titans v Sea Eagles: Five things we learned"
    ],
    "http://www.theguardian.com/us/film/rss": [
        "Iraq veteran and film-maker Ray Mendoza: ‘Writing Warfare with Alex Garland was like going to a therapist’",
        "Ted Kotcheff, director of First Blood, Weekend at Bernie’s and Wake in Fright, dies aged 94",
        "Streaming: The Last Showgirl and the best Las Vegas films",
        "Bella Thorne accuses Mickey Rourke of bruising her genitals on movie set",
        "‘A collective sigh of relief’: how Jesse Eisenberg’s A Real Pain went down in Poland"
    ],
    "http://www.thehindu.com/sci-tech/?service=rss": [
        "The men who first split the atom",
        "Zoo in Spain helps elderly elephants age gracefully",
        "As malaria cases fall, a look at Tamil Nadu’s strategies for elimination",
        "How will genetic mapping of Indians help? | Explained",
        "New working group on malnutrition-induced diabetes formed at recent World Diabetes Congress"
    ],
    "http://syndication.howstuffworks.com/rss/science": [
        "Hodag: From Wisconsin Hoax to Best-selling Beast",
        "Yowie: Animal Kingdom Resident or Hoax Down Under?",
        "Drop Bears, Australia and an Enduring Prank on Non-Aussies",
        "The 'Not Deer' Cryptid Is Exactly What It Sounds Like",
        "Is the Bloop Real? Well, Yes and No"
    ],
    "http://www.dailymail.co.uk/health/index.rss": [
        "Subtle warning signs of deadly motor neurone disease no one should dismiss - as Grey's Anatomy star Eric Dane reveals his diagnosis",
        "Weight loss jab supply risk as Trump's trade war threatens drug industry",
        "Harvard experts pinpoint 'overlooked' risk factors for dementia and they're all preventable",
        "'Most dangerous sex position' in the world is responsible for an unbelievable amount of injuries",
        "'Healthy' woman, 35, died just three days after medics dismissed symptoms of deadly condition"
    ],
    "http://www.channel4.com/news/uk/rss": [
        "National Park bosses warn that funding cuts threaten conservation",
        "UK needs cheap energy to compete in market – expert",
        "‘Without steel this town dies’: Scunthorpe reacts to emergency bill",
        "British Steel nationalisation may be necessary, says David Davis",
        "MPs vote to save British Steel Scunthorpe blast furnaces"
    ],
    "http://www.entertainmentnews.co.uk/feed/": [
        "Digital jukebox network AMI Entertainment signs with 7digital, a Songtradr company, as a client",
        "7digital, a Songtradr Company, Powers the Launch of Popular Music on Canva",
        "7digital and Pex partner to create opportunities for rightsholders and UGC platforms",
        "7digital announces support of Stationhead live commerce feature",
        "Pinterest strikes deals with Warner, Merlin, BMG and 7digital to expand music experience on the platform"
    ],
    "http://www.theverge.com/rss/group/features/index.xml": [
        "The women who made America’s microchips and the children who paid for it",
        "How to disappear completely",
        "How one creator visualized AI by using very little AI",
        "Bad influence",
        "Can Philadelphia’s ballot counters outrun election lies?"
    ],
    "http://deadline.com/feed/": [
        "Bernie Sanders Makes Surprise Coachella Appearance During Clairo’s Set, Urges Crowd To “Stand Up And Fight For Justice”",
        "Faith-Based Films Celestial As ‘The King Of Kings’ Sets Opening Record, ‘The Chosen: Last Supper’ Double Dips In Top 10, Again – Specialty Box Office",
        "Jean Marsh Dies: Emmy-Winning ‘Upstairs, Downstairs’ Actress & Co-Creator Was 90",
        "Aimee Lou Wood Receives “Apologies From ‘SNL'” After “Mean & Unfunny” Impression",
        "Lizzo Takes Aim At Trump With Printed T-Shirts During ‘SNL’ Appearance: “Tariffied”"
    ],
    "http://www.techinsider.io/rss": [
        "A key GOP senator wants to know the 'end game' for Trump's tariff plan: 'What's the strategy?'",
        "I used to hate slow walkers. Then I got sick and I became one of them.",
        "All the A-list appearances and biggest moments from Coachella 2025",
        "Here's what potential 23andMe buyers could do with your genetic data",
        "Trump delights in rapturous welcome at UFC 314: 'It says we're doing a good job'"
    ],
    "http://syndication.eonline.com/syndication/feeds/rssfeeds/": [
        "Influencer Lauren Cummings Johnson Mourns Death of Her Baby Girl",
        "The White Lotus' Aimee Lou Wood Reacts to Mean SNL Parody",
        "Kylie Jenner and Timothée Chalamet Pack on the PDA at Coachella 2025",
        "Weezer’s Scott Shriner Performs at Coachella After Wife's Arrest",
        "Looking Back on Jenna Johnson and Val Chmerkovskiy's Dance-Filled Vows"
    ],
    "http://www.popsugar.com/feed": [
        "27 Festival Season Essentials, From Face Gems to Cowboy Boots",
        "The Wellness Industry Has a Pill Problem",
        "How Much Does Does F45 Cost? Here's the Membership Breakdown",
        "70+ First-Date Questions to Keep the Conversation Moving",
        "The Love on the Spectrum Siblings Open Up About Life With Connor, Abbey, and Tanner"
    ],
    "http://www.theguardian.com/society/health/rss": [
        "Trump is ‘fully fit’ and manages high cholesterol, says White House physician",
        "Who Wants Normal? The Disabled Girls’ Guide to Life by Frances Ryan review – countering the stereotypes",
        "Thank you, Frances Ryan, for speaking up for us disabled women | Letter",
        "Advice for hay fever that’s not to be sniffed at | Brief letters",
        "NSW’s sole women’s-only clinic dedicated to trauma ends ‘gamechanging’ focus"
    ],
    "http://www.dose.ca/feed": [
        "Since the return of the 4 nations, the habs defensemen no longer produce",
        "Heineman: Patrick Friolet suspects concussion symptoms",
        "It’s (really) cool that Lane Hutson made the trip to practice with Ivan Demidov",
        "Ivan Demidov jumped on the ice in Brossard this morning",
        "Visit of the Blackhawks on Monday night at the Bell Centre: a trap game"
    ],
    "http://www.hilltimes.com/feed": [
        "Supply chain strategy must go beyond transportation, says Supply Chain Canada president"
    ],
    "http://www.medpagetoday.com/rss/Headlines.xml": [
        "Pridopidine Shows Promise in Subgroup of Huntington's Patients",
        "'It Will Cost Lives': What We Heard This Week",
        "Trump:'Fully Fit' to serve as Commander in Chief, Doctor Says",
        "Estimated GFR Equation Matters When Dosing Chemotherapy in Cancer Patients",
        "Removing Restraints: Reclaiming Patient Dignity in Delirium Care"
    ],
    "http://feeds.nbcnews.com/feeds/health": [
        "One of the country's leading Alzheimer's projects is in jeopardy",
        "North Carolina flu-related deaths at all-time high",
        "RFK Jr. calls FDA a 'sock puppet' for industries in private speech to agency staff",
        "Map: Track the spread of measles in the U.S.",
        "Teddi Mellencamp posts before-and-after pics of last 4 months of cancer journey"
    ],
    "http://www.sciencemag.org/rss/current.xml": [
        "Rules of engagement for condensins and cohesins guide mitotic chromosome formation | Science",
        "The genetic architecture of and evolutionary constraints on the human pelvic form | Science",
        "A distinct priming phase regulates CD8 T cell immunity by orchestrating paracrine IL-2 signals | Science",
        "A neuroimmune circuit mediates cancer cachexia-associated apathy | Science",
        "These two biologists found purpose—and love—trying to save Nigeria's bats"
    ]
}