{
    "Topic 0": {
        "keywords": [
            "trump",
            "tariffs",
            "ai",
            "trumps",
            "tariff",
            "china",
            "musk",
            "new",
            "health",
            "apple"
        ],
        "titles": [
            "Markets got a tariff pause. But damage to global confidence in US could last.",
            "Protevia: Personal safety app protector",
            "Energy on the ballot: The key to Canadian prosperity",
            "Turnbull and Shorten speak of mistakes",
            "Before election, feds urged classified briefings for opposition leaders",
            "Why ‘Bidenomics’ Isn’t Working For Biden",
            "Could your next surgery be done by a robot? Meet the patient who tried it",
            "Exclusive — Tom Tiffany: China Is an Adversary and a Threat",
            "Breastfeeding: USPSTF Finds Poor Support in Primary Care",
            "Which ITR Form Is Right For Senior Citizens In FY 2024-25? Check Income Tax Slabs Under New Tax Regime",
            "Everyone's jumping on the AI doll trend - but what are the concerns?",
            "‘It’s going to be messy’: Americans on how Trump’s tariffs are shaping their spending",
            "Security focus for Abe visit",
            "CONSUMER SENTIMENT TUMBLES",
            "Labor and Coalition launch big-spending promises as parties try to lure voters with big giveaways on income tax and housing",
            "Canada OKs construction of first licensed teeny atomic reactor",
            "Infected blood victims losing faith as inquiry hearings restart",
            "Debate: What do Brits gain or lose from Trump tariffs?",
            "Lawrence O’Donnell Spreads Lie Trump Can Round Up American Citizens and Fly Them to El Salvador’s Prison",
            "Shocking new study confirms Elon Musk's worst fear about life in the US",
            "Musk Mocked After 'Top Secret' Cabinet Meeting Notes Go Viral: 'They Wrote That to Make Him Feel Included'",
            "Judge rules Mahmoud Khalil can be deported",
            "Artificial Intelligence Explained: What is AI, how it works, where it is used, can it replace human beings?",
            "Trump Tariffs Add to Apple’s Long-Standing Innovation Woes",
            "Canada's next government will have to deal with an immigration system that has 'lost its brand'",
            "Trump's Tweets Threaten His Travel Ban's Chances in Court",
            "Ecuador's next president faces rampant drug violence and few resources to combat it",
            "Mexico ready to retaliate by hurting US farmers",
            "Why the climate promises of AI sound a lot like carbon offsets",
            "Xi Jinping celebrates China’s rising power — and his own",
            "Trump exempts smartphones and computers from new tariffs",
            "US exempts smartphones and computers from Trump's reciprocal tariffs",
            "From AI Barbie to 'Ghiblification' - how ChatGPT's image generator put 'insane' pressure on OpenAI",
            "Even Trump officials think Elon Musk is a loser",
            "Ex-FDA Official Is Worried About the FDA’s New “Anti-Vaccine Tone”",
            "Iran, U.S. start negotiations over Tehran's rapidly advancing nuclear program",
            "Trump HHS Eliminates Office That Sets Poverty Levels Tied to Benefits for at Least 80 Million People",
            "Huge Trump tariff U-turn will exempt iPhone and laptops",
            "The Senate Is Losing One Of Its Few Remaining Moderate Republicans",
            "'Dream news' for tech sector as US announces tariff exemptions",
            "Sen. Michael Bennet Announces 2026 Bid For Governor, Would Get To Pick Successor If Successful",
            "Apify: AI web scraper",
            "Tanya Plibersek discusses uncertainty of the markets from Trump tariffs",
            "Week in politics: Trump's tariff volatility, 'one big beautiful bill,' Supreme Court",
            "Canada federal election 2025: Where the leaders are on Saturday, April 12",
            "Trump Makes Big Tariff Move on China Overnight, Signals Where Things May Be Headed",
            "KFF Health News' 'What the Health?': The Dismantling of HHS",
            "CNN Political Briefing",
            "Investors dump US govt bonds as faith in America falters...",
            "How Trump's immigration policy changes who gets arrested and detained",
            "North Korean Hackers Disguised as IT Workers Targeting UK, European Companies, Google Finds",
            "How Musk and Trump Are Working to Consolidate Government Data About You",
            "Five months after being injured in the West Bank, Ranem is still waiting for answers",
            "Judiciary Dems' Month-Old Tweet About Mahmoud Khalil Is Aging Worse by the Minute",
            "Is this robot after our hospitality, retail and healthcare jobs?",
            "It’s not just a tariff war, a meme war has broken out between the U.S. and China; here’s how Americans are responding to Chinese videos",
            "Microsoft rolls out AI screenshot tool dubbed 'privacy nightmare'",
            "How the WA Greens plan to use its crossbench power in the state's new parliament",
            "Trump's tariffs will make things so damn expensive for everyone",
            "Judge allows Columbia graduate Mahmoud Khalil's deportation",
            "The Kids Are Leaning Right: How the Manosphere Is Shaping Voters",
            "Trump dumps ‘phony’ Post",
            "What the World Learned from Donald Trump’s Tariff Week",
            "Why Beijing is not backing down on tariffs",
            "Ignore the Tariffs, Apple Is Slashing the Price of Its iPad 10 to a Record Low (50 Off)",
            "Artificial intelligence, wearable tech can improve safety in stroke rehab: study",
            "Tesla stops taking orders in China for two models imported from US",
            "Stay safe online",
            "Whitmer ditches Dem playbook on Trump's tariffs amid 2028 speculation",
            "How Canadian investors are reacting to Trump's tariffs",
            "RFK Jr. wants to target chronic disease in US tribes. A key program to do that was gutted",
            "Trump Urges Putin to End 'Senseless' War in Ukraine",
            "UK to co-host global conference with aim of resolving Sudan’s civil war",
            "'Moron premium' after tariff chaos...",
            "Apple Maps on the web expands access to more devices and browsers",
            "After months of user complaints, Anthropic debuts new 200/month AI plan",
            "Iran seeks ‘real and fair’ nuclear deal as US signals compromise",
            "Americans panic when their phone battery hits 38 on average, study says",
            "US special envoy meets Putin as Trump urges Russia to 'get moving' on Ukraine ceasefire",
            "Elon Musk’s xAI powering its facility in Memphis with ‘illegal’ generators",
            "As Rohingya refugees continue to flee from persecution, here’s how you can help",
            "Trump opens door to Iran deal, warns of consequences if talks fail - The Tribune",
            "Resetting a Trade System Rigged Against Americans",
            "LimeWire AI Studio Review 2023: Details, Pricing Features",
            "Conservative Journalist Mocked For Asking The Cringiest Possible Trump Question",
            "BlackRock CEO Larry Fink warns of recession amid Donald Trump's tariffs: ‘I think we’re very close’",
            "Australian exports surge into gap as US-China tariffs beef heats up",
            "States sue over Trump administration's sudden halt of pandemic relief aid for schools",
            "Apple Rolls Out iOS 18.4 With New Languages, Emojis Apple Intelligence in the EU",
            "Ministers pledge to improve voter ID law as research shows it 'significantly reduces' turnout",
            "Trump’s Preoccupation With Tariffs",
            "To speed deportations, Trump revives rarely used laws",
            "How Rare Earths Are Playing a Pivotal Role in the U.S.-China Trade War",
            "FBI probes possible J.P. Morgan hacking",
            "Reddit's AI Answers Are About to Get Faster and More Accurate",
            "Trump administration ordered to unfreeze funding in dispute with Maine over transgender students",
            "Vendor notebook: Google and IBM make moves on clinical and business AI",
            "Trump’s Erratic Economic Policies",
            "Far-right groups gain ground in Sweden and Germany amid migrant influx",
            "What to know about Israeli spyware allegedly used by Ontario police",
            "Judge's ruling allows ICE to make arrests near churches",
            "Musk’s Latest Fraud Finding Isn’t What It Seems",
            "Trump Scores Massive Win as Judge Rules He Can Deport Mahmoud Khalil",
            "Apple aiming to launch delayed Apple Intelligence features this fall: report",
            "Trump Adds Tariff Exemptions for Smartphones, Computers and Other Electronics",
            "Chevron Ordered to U-Turn Venezuela Oil Ahead of Sanctions",
            "The Three States That Are Especially Stuck if Congress Cuts Medicaid",
            "US President Donald Trump undergoes health check amid scrutiny over age and fitness",
            "Quantum hardware may be a good match for AI",
            "HIV, Trans Health, and Covid Research Targeted by Trump Cuts to NIH",
            "Cedars-Sinai CAIO: AI is transforming relationship between caregivers and IT",
            "Top 10 AI Tools in 2023 That Will Make Your Life Easier",
            "Experts Doubt Kennedy’s Timetable for Finding the Cause of Autism",
            "This Robot Copies Life—By Decomposing",
            "Boosting RD Could Lift Australia’s GDP by 3, Report Finds",
            "OpenAI countersues Elon Musk over ‘unlawful harassment’ of company",
            "Amazon’s satellite launch designed to compete with Musk’s Starlink cancelled",
            "RFK Jr. Accuses FDA of Drug Industry Influence That Barred Alternative Remedies",
            "Overdiagnosis debate should not ignore social causes of mental illness | Letters",
            "Report: Baylor officials did nothing after being notified of assaults",
            "Border Patrol Adviser: Military Taking Over Federal Lands on Border Gives Us Extra Charges to File Against Crossers",
            "Mitch McConnell Called Donald Trump a ‘Stupid’ and ‘Despicable Human Being’",
            "Journalists Delve Into Effects of Deep Federal Cuts on Public Health",
            "T.N. government gives nod for Kalaignar biomedical research foundation",
            "OpenAI countersues Elon Musk in legal dispute over ChatGPT maker's business ambitions",
            "EU AI Rules Delay Tech Rollouts, But Civil Societies Say Safety Comes First",
            "Topsy-turvy election campaign sees Liberals eyeing more seats in Tory-blue Alberta",
            "Federal judge refuses to block immigration enforcement operations in houses of worship",
            "Coalition ducks and weaves on how universities should make up for lost foreign student income",
            "US envoy suggests Ukraine can be partitioned ‘like Berlin post-Second World War’",
            "Some Rural Hospitals Ditch Medicare Advantage",
            "Republican Congressman on Suspected Islamic Radicals: Kill Them All",
            "Trump's China tariffs swing a sledgehammer at importers and cheap goods",
            "SEBI Warns Of Securities Market Frauds Via YouTube, Facebook, X And More",
            "China ends floats logjam",
            "Elon Musk says he plans to send his humanoid robots to Mars by 2026",
            "Did an AI chatbot help draft the US tariff policy?",
            "Dutton pledges one-off 1,200 tax offset to half of taxpayers",
            "Liberal candidate co-authored inquiry submission suggesting Hazaras not persecuted for ethnicity in Afghanistan",
            "Meta Unveils Llama 4 AI Series Featuring New Expert-Based Architecture",
            "Millions told to stay indoors as China braces for strong winds",
            "Electoral reform: Hashtag fresh thinking",
            "Put It in an Ad: Democrat Announces Regret for Deporting Criminal Aliens",
            "How Dairy Robots Are Changing Work for Cows (and Farmers)",
            "How one creator visualized AI by using very little AI",
            "Netflix is testing an AI search engine to supercharge your recommendations",
            "Trump Administration Delays Plan to Limit Pricey Bandages",
            "US military launches initiative to find the best quantum computer",
            "'I cannot guarantee complete confidentiality,' VA therapists ordered to tell veterans",
            "New Google Maps AI Tool Could Help Congestion and Fix Roads Near You",
            "The Trump Show Comes to the Kennedy Center",
            "Labor’s attack on Dutton ‘cuts’ isn’t the full picture",
            "Indonesia: Driver survives plunge from unfinished bridge after Google Maps fail",
            "Seven stories you will read roughly 100 times between now and election day",
            "If You Think Incels Are 'Gross, Basement Dwellers', Your Smug Politics Are Part Of The Problem",
            "Trump Wants Tariffs to Bring Back U.S. Jobs. They Might Speed Up AI Automation Instead",
            "'Freezing us': American businesses paralysed in evolving trade war",
            "Apple could keep iPhone prices the same by upselling harder than ever",
            "Iranian directors of My Favourite Cake given suspended jail sentences for ‘spreading lies’",
            "Trump administration says it will exclude some electronics from ‘reciprocal’ tariffs",
            "Bessent Takes Tricky Center Stage as Trade Wars Roil U.S. Economy",
            "Trump tariffs live updates: Cell phones, chips and laptops get a reprieve from tariffs; China hikes tariffs on US goods to 125",
            "'Difficult to say with a straight face': Tapper reacts to Fox News' statement on settlement",
            "Trump says he’s in ‘good shape’ after annual physical, but results still pending",
            "Flimsy Antiabortion Studies Cited in Case to Ban Mifepristone Are Retracted",
            "China’s DeepSeek impresses. But is a ‘fast follow’ good enough in AI?",
            "DAVID MARCUS: Sorry Dems, literally nobody believes married women can’t get IDs",
            "Top 10 AI Tools That Will Transform Your Content Creation in 2025",
            "Meltdown of trust in weakly governed economies",
            "If You’ve Ever Had a Google Alert for a Hacked Password, This Nearly Free Tool Is Your Best Defense",
            "Washington Times Weekly: Tariff whiplash",
            "OpenAI sues Elon Musk claiming 'bad-faith tactics'",
            "Title X Freeze Widely Threatens Health Care Access",
            "Iran and US agree to more talks over Tehran’s nuclear program after 1st round in Oman",
            "Will iPhones cost more because of Trump's tariffs on China?",
            "Trump’s Horrifying Removal of Man in “Error” Takes an Even Darker Turn",
            "Sledgehammer-wielding Musk critics smash up Tesla in London art project",
            "Researchers concerned to find AI models misrepresenting their “reasoning” processes",
            "Kennedy tells FDA employees that 'the Deep State is real': report",
            "Six second AI video requires eight times more more electricity than it takes to charge mobile phone",
            "Supreme Court avoids confronting Trump so far, even when it rules against him",
            "Why Biden Is Losing Support Among Voters Of Color",
            "The Second GOP Debate Could Be Smaller, With Or Without Trump",
            "'Just need to start killing': Man arrested for threats to Trump, ICE",
            "Why Siri's AI Upgrades Keep Getting Pushed Back",
            "West Virginia governor signs food dye ban into law",
            "A new vacuum can alert you to incoming text messages. Why?",
            "Donald Trump Cancels Second Mainstream Interview in Days",
            "Russia and Ukraine accuse each other of failing to pause strikes after US envoy leaves Moscow",
            "Understanding the Global Macroeconomic Impacts of Trump’s Tariffs",
            "Medicare Bleeds Billions on Pricey Bandages, and Doctors Get a Cut",
            "Protecting Robots in Harsh Environments with Advanced Sealing Systems",
            "‘Every response is curated to be personalised’: Co-founders share how Mivi is reimagining AI interaction",
            "Stay local, stay resilient: Aditya Khemka recommends healthcare, consumption plays",
            "Trump’s tariff buffer: Phones, PCs, chips spared from 'reciprocal' tariffs - The Economic Times",
            "Federal judge blocks new deportations under Alien Enemies Act",
            "Fox News AI Newsletter: White House record-keeping revamp",
            "Turnbull calls for electronic voting",
            "Iran says it wants 'fair agreement' as nuclear talks with US begin in Oman",
            "California’s 59bn agriculture industry reels under Trump’s wavering tariffs",
            "How Trump and His Allies Have Run With Russian Propaganda",
            "U.S. says it needs more time to provide information on mistakenly deported Maryland man",
            "Trump exempts phones, computers and other electronics from his tariffs on Chinese goods",
            "There’s one way you can make your super more secure",
            "Before-and-after photos show changes Trump has made to the White House decor, so far",
            "For Republicans, Tariffs Pose a Risk Like No Other",
            "U.S. measles battle hindered by confusion over health secretary response",
            "Measles Is Spreading, and RFK Jr. Is Praising Quacks",
            "AI vs. human connection: Which do schools most need to thwart threats?",
            "Making the most of market volatility: FP Video on the latest tariff tangents",
            "Tuberculosis could end if there’s more US public health funding, experts say",
            "Trump’s Tariffs: Will They Affect Your Tech Prices?",
            "Trump's nuclear talks with Iran come at a crossroads between a deal and all-out war, experts fear",
            "Apple said to be flying iPhones from India to US to avoid Trump tariffs",
            "Inscryption Review",
            "Here’s a PDF editor that won’t make you cry",
            "Muslim leader's shocking message and threat to 'filthy human' Peter Dutton",
            "Greens oust Labour in north London by-election as party's losing streak in capital continues",
            "GBBO's Prue Leith says 'it's ridiculous' as she issues 'alarming' health update",
            "Apple Maps on the web is no longer in beta, now available on Android devices",
            "Neelima Chowdary Mulpuri: Engineering the future of agile through the lens of artificial intelligence",
            "Hackers find a way around built-in Windows protections",
            "A day in the life of a migrant seeking asylum under the Trump administration",
            "Gretchen Whitmer Fell Into Trump’s Tariff Trap",
            "PR campaign may have fuelled food study backlash, leaked document shows",
            "At least 26 American hostages released since Trump took office",
            "iPhone 20th-Anniversary Edition Could Bring Major Design Overhaul",
            "Spinal muscular atrophy patients welcome development of generic drug; call for government intervention to ensure access",
            "Shorten blasted for ‘treaty bomb’",
            "Supreme Court puts President on a deadline, says prudent to consult apex court before taking a call on State Bills - The Hindu",
            "The Download: how the military is using AI, and AI’s climate promises",
            "Trump administration backs off Nvidia's 'H20' chip crackdown after Mar-a-Lago dinner",
            "Nvidia unveils new products from supercharged graphics chip to AI that trains robots",
            "Best smart garage door opener controllers",
            "Trump administration to exempt smartphones and computers from China tariffs",
            "Trump Cracks Down On Left’s Favorite Way To Discriminate",
            "Donald Trump Supporters Are Losing Their Minds Over The New Trump Tariffs, And It's Exactly The Meltdown We All Saw Coming - The 34 tariffs threaten our survival. We voted for you, believing in America First. Please consider us.",
            "LNP senator vows to 'make Australia great again', dismisses Trump link",
            "RFK Jr. falsely claims measles vaccine protection 'wanes very quickly'",
            "NVIDIA Studio Update supercharges DaVinci Resolve with RTX AI Acceleration",
            "Rampant 'shrimp fraud' deals another blow to devastated U.S. shrimpers but tariffs offer new hope",
            "ASX closes in the red after Wall Street tumbles on US-China tensions",
            "Trump’s Wild Card: EPA Chief Lee Zeldin to Go Full MAGA in Fight Club Live Event",
            "Sen. Tim Scott outlines first 100 days of Congress, crypto, tariffs",
            "Generative AI is learning to spy for the US military",
            "A remarkable step by the government - and Trump, China and Reform UK have all played their part",
            "Twelve E. coli cases under investigation in Latvia",
            "Global breakthrough to tackle shipping emissions",
            "Microsoft PowerPoint Keyboard Shortcuts: Printable Cheat Sheet",
            "The Great Chatbot Debate: Do They Really Understand?",
            "Cartoon: Republican economic innovations",
            "Australia's looming election brings housing crisis into focus",
            "Map: Track the spread of measles in the U.S.",
            "Trump threatens to end pharmaceuticals tariff exemption",
            "Don't Buy an iPhone Until You See How Tariffs Could Double the Price. We Do the Math",
            "Trump’s biggest U-turns before tariffs: Flip-flopper in chief?",
            "'Dismal, pathetic, horrific': Older Australians brace to pay more for home care",
            "RFK Jr pledges to find the cause of autism by September",
            "Invasive Strep Infections Are Rising in the U.S.",
            "How Contracts Can Help Firms Navigate the Uncertainty of Global Tariffs",
            "Hackers Stole Health Records From 1.6 Million Planned Parenthood Patients",
            "The AI action figure trend is taking over social media - here's how you can transform into a collector's toy",
            "China put steep tariffs on U.S. exports. Farmers are worried",
            "WATCH: Musk Hater Leaves Swastika-Marked Brick On Tesla In NYC Jewish Community",
            "Tesla enters Saudi market | Cybertruck in Riyadh as Musk eyes EV revival amid sales slump",
            "Trump exempts phones, computers, chips from new tariffs",
            "Anti-Trans Narratives Are Creeping into This Election",
            "How a false X post about pausing tariffs led to multitrillion-dollar market swings",
            "Trump exempts smartphones, computers, chips from reciprocal tariffs",
            "Trump administration ends temporary protected status for thousands of Afghans",
            "How People Are Really Using Gen AI in 2025",
            "RFK Jr. calls FDA a 'sock puppet' for industries in private speech to agency staff",
            "China slaps 125 tariffs on US goods but will ‘ignore’ further hikes",
            "Top 10 AI Content Generator Writer Tools in 2022",
            "Trump’s Tariffs Shook the Economy. This Website’s Response Might Matter More.",
            "How AI is interacting with our creative human processes"
        ]
    },
    "Topic 1": {
        "keywords": [
            "new",
            "best",
            "switch",
            "tv",
            "music",
            "coachella",
            "release",
            "nintendo",
            "review",
            "7digital"
        ],
        "titles": [
            "Hook: Complete Edition Is Coming to Xbox and Switch Today",
            "Elton celebrates 'extraordinary' 10th number one album",
            "Justin Hartley's Ex-Wife and Daughter Support Him As Chrishell Stause Split Plays Out on 'Selling Sunset'",
            "Nintendo Switch Part Deux – The TouchArcade Show 611",
            "The Two Words to Say When Someone Comments on Your Hygiene",
            "In another universe, Steve Martin voiced Goofy in A Goofy Movie",
            "The Chase expert reveals 'lost' celebrity special episode which ITV 'won't broadcast'",
            "40 Under-the-Radar Netflix Originals You Should Watch",
            "Nora Fatehi and Jason Derulo’s ‘Snake’ slithers to rank 1 on UK British Asian Music Charts",
            "How to Introduce Adult Toys Into Your Relationship Without Awkwardness",
            "Ashley Cole signs new one-year deal at LA Galaxynbsp;",
            "Canada needed a reimagined broadcasting system. The CRTC’s contribution decision offers more of the same while risking the important role played by licensed streaming in building the careers of artists.",
            "Cheaper than Black Friday: Samsung has a massive clearance sale on best-rated TVs - save up to 1,300",
            "Mel B Gives Biggest Hint Yet That Spice Girls Will Reunite For 30th Anniversary",
            "Creepy Redneck Dinosaur Mansion 3 Just Dropped Its Release Date Trailer",
            "7digital, a Songtradr Company, Powers the Launch of Popular Music on Canva",
            "Nintendo Switch 2 recent updates: Release date, price, new games and everything else you need to know",
            "Wynne Evans to ‘take time out’ from Strictly Come Dancing live tour",
            "A brilliant Google app fixed my problem with the Pixel 9a’s camera",
            "How to Keep Your Relationship Exciting and Full of Surprises",
            "The best thrillers to watch on Netflix this April",
            "Your Guide To Enjoying Transmasculine Sex",
            "Corinne Found the Perfect Way to Rebel Against The Bachelor",
            "We love: fashion fixes for the week ahead – in pictures",
            "'I was on 99 To Beat - this is what really happens on ITV's new game show'",
            "Trails Beyond The Horizon Deluxe And Collector's Edition Preorders Available Now",
            "Sony stops making 8K TVs, but ultra high-def cameras remain key to future",
            "Prada buys Versace in 1.25bn deal uniting Italy’s biggest fashion brands",
            "The 24 Sexiest Movie Scenes of All Time",
            "'F*ck Off' – Brits React To News Of A UK Saturday Night Live",
            "Ooh Bedroom lucky charms and jinx talk",
            "Ashton Kutcher and twin Michael talk health, guilt and rift between them",
            "Faun Town Reveals Its New Release Date",
            "Beverages, packaged food, dairy products garner double-digit growth in March quarter : Bizom",
            "Cameron Diaz's many X-rated confessions about her steamy love life resurface",
            "Blur fans are only just realising band had a different name 35 years ago",
            "Aimee Lou Wood 'didn't understand' co-star Lisa's level of fame",
            "Mickey 17, Novocaine, G20 on Prime Video, and every movie new to streaming this weekend",
            "Assassin's Creed Shadows Tops the German Charts for March 2025, Split Fiction Takes 2nd",
            "Everything you need to know about Katy Perry’s all-female space mission",
            "The Best Diaper Bag That Is Chic and Functional -- LeSportsac, Herschel, Rebecca Minkoff and More",
            "Five Ways of Seeing Five Minutes of 'Real People' at the Oscars",
            "Celebrity Big Brother fans spot major show change during first live eviction",
            "‘When Life Gives You Tangerines’ K-Drama Review: This emotionally rich, profound show is a must watch",
            "The Vinyl Factory: Reverb exhibition extended until 2 March",
            "The Fashion Police Have Arrived at the Masters",
            "Inside Eddie Murphy's Sprawling Family Tree: Get to Know His 10 Kids",
            "'It Treats Us Like Children' – What 5 Autistic People Think Of Netflix's Love On The Spectrum",
            "Music Canada’s Gold Platinum program celebrates 50 years",
            "7digital announces support of Stationhead live commerce feature",
            "Cool condiments: ‘little treat culture’ leading to boom in preserves and sauces",
            "What Moonlight’s Win Says About the Oscars’ Future",
            "Lana Del Rey's New Album Has a Different Title and Release Date, Actually",
            "Perfume brands fighting a ‘lost cause’ against cheap dupes, say lawyers",
            "Ex-Abercrombie Fitch boss 'unfit to stand trial'",
            "Balenciaga and orthopaedic brand Scholl team up for ‘Frankenshoe’ hybrid",
            "The 15 Best Movies and TV Shows to Watch This Weekend",
            "Cartoon: For adults only",
            "Savannah Miller on why her perfect place will always be Positano",
            "The 6 Best Toothpastes for Men in 2025, According to a Dentist",
            "Fort McMurray: Shopping time",
            "A guide to the “platonic ideal” of a Negroni and other handy tips",
            "Microdosing spirituality: How our everyday attachments connect us to the divine",
            "Stars At Coachella -- Day 1 And Tons Of Fun",
            "Can Reality TV Redeem Jake and Logan Paul?",
            "Victrix's Premium Arcade Sticks Are Over 50 Off For A Limited Time",
            "Cœur de pirate Announces New Album 'Cavale,' Shares Title Track",
            "Get this Acer gaming laptop with RTX 4070 for a crazy 600 off",
            "Pinterest strikes deals with Warner, Merlin, BMG and 7digital to expand music experience on the platform",
            "Netflix's Black Mirror: Five times the dystopian drama predicted the future",
            "Amazon’s budget-friendly Fire TV Soundbar is an extra 25 off today",
            "The Wheel of Time’s big battle episode is the finest kind of fantasy flex",
            "A trove of artifacts recovered from the black market goes on display in Naples",
            "Metric Drop Off Tour with Bloc Party, Add Canadian Dates",
            "New Elder Scrolls Online expansion unveiled",
            "My Favorite Amazon Deal of the Day: Samsung's 'The Frame' TV",
            "Ardal O’Hanlon on comedy, trigger warnings, and life after Father Ted",
            "Intel Core i9-12900K claimed to be the World's Best Gaming Processor",
            "Samsung QLED takes on OLED",
            "I'm Sorry, But Only Someone Born In The '70s Or '80s Can Pass This 1990s Movie-Themed Pictionary",
            "Who Was Missing From Taylor Swift’s Miami Squad?",
            "Legendary 70s TV star and former supermodel looks unrecognizable on rare outing",
            "PrimeStation Pulsar fanless workstation PC unveiled",
            "UNIX Launches Solo (UX-900 Pro) Neckband with ENC Technology and up to 62+ Hours of Playtime",
            "Bong Joon Ho's 'Mickey 17' gets trailer and release date",
            "Driver charged £100 after stopping to be sick",
            "Voicemail Dump Truck 156 | Edging Pizza.mp3",
            "Wealthsimple’s acquihire, Shopify’s AI policy, and Nintendo’s Switch 2 confusion",
            "12 Best Teeth-Whitening Products, According to Dentists 2025",
            "'I've played the new Nintendo Switch 2 – here's why you should pre-order it'",
            "The Love on the Spectrum Siblings Open Up About Life With Connor, Abbey, and Tanner",
            "OOFOS Ooaah Sport Slide Vs. Hoka Restore TC: Which Recovery Shoe Is Better For You?",
            "Bridgerton's Hannah Dodd: Francesca Doesn't Chase Validation Like Her Siblings",
            "Why Kaitlyn Bristowe, Jason Tartick and More Bachelor Duos Have Split",
            "Brian Eno and Beatie Wolfe Announce Two Joint Albums",
            "'This £29 instant root disguiser has saved me thousands on hair salon appointments'",
            "Saturday Night Live gets British version",
            "Sarah Butler: If you like a Chinese takeaway you'll love this sweet and sticky stir fry",
            "The 20 Best Halloween TV Episodes of All Time",
            "This Passover, We Must Examine the Indecent Betrayal by Our Own",
            "Lauren Sánchez reveals surprising possession she will take to space",
            "The 50 Greatest War Movies Ever Made",
            "‘The Last of Us’ Season 2 Schedule: When Do New Episodes Come Out?",
            "Lady Gaga's 'unsettling' Coachella performance with 'satanic rituals' has fans all saying the same thing after watching pop star's opera-themed set",
            "How to raise kind children: lead by example, talk it over and get a dog",
            "Taylor Swift's Eras Tour movie director to helm Bodyguard remake",
            "Send us your questions for Arthur Baker",
            "Trails In The Sky 1st Chapter Preorders Are Available Now",
            "Looking for the authentic Algarve? Go in the low season – and to Tavira",
            "Zenless Zone Zero Launches in June for Xbox Series X|S",
            "Where to find wild garlic in London (and how to forage responsibly)",
            "Amy Dowden looks 'gorgeous' in high street green dress as she celebrates Strictly return",
            "45 K-Cups Later, These Are the Pods With the Boldest Flavor",
            "IFPI’s Global Music Report 2025 reveals tenth consecutive year of growth",
            "Shure MV7i review: An all-in-one mic for podcasts and music",
            "19 TV Characters Who Absolutely Do Not Deserve The Hate They Get",
            "Katie Kitamura Knows We’re Faking It",
            "Nintendo are repeating some very old mistakes with the Switch 2 – Reader’s Feature",
            "REVIEW: Dell 27 Plus 4K monitor offers 120Hz, but is it worth the money?",
            "A Fun New Thriller Doesn’t Make Any Sense. Good Thing It Doesn’t Need To.",
            "Prague’s Vietnamese food revolution",
            "Asus Vivobook S 14 OLED Review | For users needing portability and decent power, it’s a reasonable pick",
            "Disney Illusion Island PS5 And Xbox Preorders Are Live At Amazon For 30",
            "Mafia: The Old Country release date revealed and it’s a hint at GTA 6",
            "Greek vase ‘looted’ in Italy removed from sale by London gallery",
            "Interview: Gabriel Moses",
            "Missy Elliott Goes Full Transformer Mode at Coachella in Epic Moment",
            "Why Helen Hardt’s ‘The Blood Bond Saga’ Should Have a TV Adaptation",
            "I Went To Prague And Discovered Tartar Sauce On Chips – Here’s What Other Countries Swear By",
            "Apple TV+ this week: ‘Your Friends and Neighbors’ is now streaming",
            "Streaming: The Last Showgirl and the best Las Vegas films",
            "Fans all saying same thing about Michelle Pfeiffer's, 66, new makeup-free selfie",
            "Gabriel Moses announces largest ever exhibition at 180 Studios",
            "The Axe Files with David Axelrod",
            "Bank holiday today: Are banks open or closed on Saturday, April 12? Check here",
            "50 Scenes That Do Not Appear in the Fox ‘X-Files’ Revival",
            "Women Make Movies’ Debra Zimmerman Slams U.S. Grant Cuts at Visions du Réel",
            "Harriet Tubman museum in NJ committed to preserving history after temporary removal from website",
            "Who was evicted from Celebrity Big Brother? First housemate of series axed in bombshell decision",
            "Laser-cooled chips: Maybe coming soon-ish to a datacenter near you",
            "Netflix eyes first Seattle-area office, filings show",
            "Music Canada celebrates the 50th anniversary of the Gold Platinum Certification Program at the JUNOS",
            "Black Panther director says Chadwick Boseman freaked out Disney execs by never breaking character and only speaking in T'Challa's accent",
            "You've been cooking pizza WRONG Experts reveal the secret to achieving restaurant-quality slices at home - and why you should never use the top shelf of the oven",
            "With this simple gadget, you can make great-tasting pour-over coffee with fewer beans",
            "70+ First-Date Questions to Keep the Conversation Moving",
            "EA cracks down on modders selling their custom Sims 4 content",
            "Fashion Tips for Styling Legs and Hiding Cankles Effectively",
            "Hear Lana Del Rey’s new single, “Henry, come on”",
            "Ex-Nintendo fan sells PS5 Pro to buy Switch 2 – Reader’s Feature",
            "Loch Lomond tourist attraction ceases trading after two decades",
            "7digital and Pex partner to create opportunities for rightsholders and UGC platforms",
            "A Good Bundle – This is Fine",
            "Shawn Layden on 80 Switch 2 Games: 'If It's the Only Place You Can Play Mario, You Get Your Wallet Out'",
            "Kirstie Alley, 'Cheers' and 'Veronica's Closet' star, dead at 71",
            "What Men Like During Intimate Moments – The Subtle Moves That Drive Them Wild",
            "Nick Drake: a Five Leaves Left box set is coming",
            "Chelsea Handler, Leslie Jones and John Leguizamo among guest hosts to step in for Trevor Noah on 'The Daily Show'",
            "POCO C71: Segment’s Ultimate Blockbuster is Here",
            "Kate Spade x Target Is the Collab of Our Dreams: Get a Sneak Peek",
            "LOOKING BACK: ice cream in Oxfordshire over the years",
            "Nintendo Switch 2 launches straight into Trump's trade war",
            "CBB's first evictee Michael Fabricant cuts downcast appearance following 'sad' exit",
            "Engadget review recap: The Pixel 9a, smart glasses and AMD's latest CPU",
            "Maura Higgins parties with 'besties' Kendall Jenner and Hailey Bieber at Coachella - as she moves on from Danny Jones 'drunken kiss' scandal",
            "‘I’m like the TV Lorraine - just more sweary’: at home with the queen of the small screen",
            "Digital jukebox network AMI Entertainment signs with 7digital, a Songtradr company, as a client",
            "Best Shampoo For Colored Hair",
            "Lady Gaga Outdoes Herself With a Coachella Spectacular That’s Equal Parts Freaky and Hearty",
            "Louis Tomlinson goes under the radar at Coachella while Zara McDermott is spotted just miles away after confirming romance",
            "WPCommerz: Product recommendation tool for WooCommerce",
            "13 Best Whitening Toothpastes 2025, Approved by Dentists",
            "Death in Paradise star 'wasn't ready' to bid farewell as she opens up on show exit",
            "Lady Gaga Played Chess with a ‘Poker Face’ at Coachella",
            "The future of hand and wrist rehabilitation is fun arcade games",
            "Bitter taste for local chefs",
            "Your Friends and Neighbors Release Schedule: When Do New Episodes Come Out?",
            "How Elder Scrolls Online is shaking up a ten-year-old game in 2025",
            "The 20 Best Amazon Kitchen Products That Will Make Your Life Easier",
            "The crazy thing we’re still buying",
            "Family sells village store at Scottish beauty spot after 40 years",
            "Stereolab announce new album, Instant Holograms On Metal Film",
            "The perfect ‘new’ handbag? An old one | Jess Cartner-Morley on fashion",
            "The real taboo",
            "Brian Eno and Beatie Wolfe announce two collaborative albums",
            "The Best Spring Dresses Are 30 off at Abercrombie Fitch Right Now",
            "'MobLand' is shattering streaming records. Here's when new episodes come out",
            "Nintendo Switch 2 games are £10 off with this free promotion",
            "The 10 Best Amazon Dressers For Every Style and Budget",
            "Ahead of spaceflight, Katy Perry is reading Carl Sagan and channeling her 'feminine divine'",
            "Google Pixel 9a review: A smartphone for uncertain times",
            "Critics Are Saying The Return Of Black Mirror: Will Be Your Next Binge-Watch",
            "11 Times Actors Couldn’t Hide Just How Much They Hated The Endings To Their Own Shows",
            "The Best iPads of 2025",
            "Scarlett Moffatt wears the perfect Next gingham dress that flatters curves",
            "Music Canada and DIMA issue joint letter to CRTC following Canadian content audio workshops",
            "This family-run cafe and pasticceria is an old Italian soul worth visiting",
            "The new Netflix Black Mirror series has another Bandersnatch-like gaming crossover moment, but you might not even notice it",
            "A Decade of Adventure: Elder Scrolls Online Enters a Bold New Era",
            "Waifs celebrate 25 years with Cairns concert",
            "Record Store Day 2025’s Most Wanted: T-Swift, T-Heads, Gracie Abrams, ‘Wicked,’ Wu Tang, Laufey, Oasis, Mingus and More Vinyl Worth the Queue",
            "The Gut-Wrenching True Story Behind Netflix's Con Mum",
            "‘Sacramento’ Review: Michael Cera in a Smart and Fluky Road Comedy About the Agony of Adulting",
            "Adam Levine shares which Maroon 5 song he thought would be a ‘career ender’",
            "2025 National Recording Registry additions: Elton John, Celine Dion, Amy Winehouse and Hamilton"
        ]
    },
    "Topic 2": {
        "keywords": [
            "vs",
            "2025",
            "ipl",
            "masters",
            "city",
            "live",
            "nfl",
            "win",
            "league",
            "crystal"
        ],
        "titles": [
            "De Bruyne leads Manchester City to comeback thrashing of Crystal Palace",
            "Meta to add Dina Powell McCormick, Patrick Collison to board",
            "The Masters tee times: R3 pairings and UK start times",
            "Young volleyball star gone too soon",
            "Future stars bring home trophy",
            "6 offensive players who could be secret superstars in the 2025 NFL Draft",
            "Masters LIVE: Rory McIlroy sends message to Justin Rose as commentators left stunned",
            "Canadian DB Tyrell Ford turned down multiple NFL offers to stay in CFL, sign with Edmonton Elks",
            "'I'm backing a 12/1 to win - Here are my Scottish Grand National tips 1-2-3-4-5'",
            "Masters 2025 live updates: Leaderboard, best pairings from third round at Augusta National",
            "Edinburgh beat Bulls to seal home Euro semi-final",
            "Browning pips favourite Kennedy in 100m thriller to win national title",
            "Raptors dominate Hornets despite resting starters",
            "Former Dolphins QB worked out for Cardinals",
            "Inspired Wales top group as England falter",
            "Beever-Jones breaks Liverpool hearts to send Chelsea into Women’s FA Cup final",
            "John Terry says there's 'no comparison' between Jose Mourinho's Chelsea and Arsenal Invincibles",
            "Wong shines for England A in Sydney",
            "Kashvee gets maiden call-up, regulars return for ODI tri-series in Sri Lanka",
            "Nottingham Forest v Everton, Brighton v Leicester and more: clockwatch – live",
            "Man City 5-2 Crystal Palace: Kevin De Bruyne produces vintage performance as Pep Guardiola's side turn on the style after going behind early at the Etihad",
            "Arsenal: Four big Mikel Arteta selection decisions for Brentford before Real Madrid",
            "Arsenal vs Brentford LIVE: Premier League match stream, latest team news, lineups, TV, prediction",
            "Arsenal XI vs Brentford: Predicted lineup, confirmed team news and injury latest for Premier League today",
            "Pep Guardiola taunts Man City fans as dramatic Crystal Palace clash takes turn",
            "Justin Rose's secret weapon in 2025 Masters battle with Rory McIlroy and Bryson DeChambeau",
            "Arkansas basketball under John Calipari: Insiders unveil transfer portal news, 2025 recruits, roster, targets",
            "LSG vs GT Match Report: Aiden Markram, Nicholas Pooran's rapid-fire 50s end Gujarat Titans' four-match winning streak in IPL 2025",
            "Hatate sparks win over Kilmarnock as Celtic edge closer to title",
            "Paddy Pimblett sends a final message to Michael Chandler ahead of their UFC 314 clash - as the crowd favourite prepares for his toughest test to date",
            "Fireworks from Pooran help Lucknow end Gujarat’s winning streak in IPL",
            "Gal lines up SBW bout - and McGuire too",
            "As it happens: Live updates from Munster's Champions Cup quarter-final against Bordeaux Bègles",
            "The Masters 2025: Rose just in front after day two – as it happened",
            "Can you guess this NFL tight end in today’s in-5 trivia game?",
            "LSG vs GT - Head-to-Head, IPL 2025: Rishabh’s Lucknow Face Off Against Shubman’s Gujarat - Check Stats And More",
            "France overcome spirited Wales to boost Six Nations hopes",
            "Paige Spiranac praises Nick Dunlap for finishing out Masters participation despite poor play",
            "'Not happy' - What Pep Guardiola saw from his Man City players in Crystal Palace comeback",
            "Sunrisers Hyderabad v Punjab Kings - IPL scorecard",
            "IPL 2025, GT vs LSG | Gujarat Titans’ Glenn Phillips ruled out of IPL due to injury",
            "County cricket: Lancashire v Northants, Surrey v Hampshire and more – live",
            "Gather Round's Sicko Saturday treats Adelaide Oval to some gloriously bad football",
            "Matthew Golden NFL Draft 2025 profile: Full scouting report, pro comparison, future outlook and more",
            "Mumbai knock KKR out of IPL, set up qualifier-II against RCB",
            "Ottawa Redblacks’ DB Ty Cranston retires from CFL",
            "Toronto Raptors waive Robinson and Swider",
            "Can you guess this outfielder in today’s in-5 trivia game?",
            "Sheffield United and Plymouth players brawl in tunnel after Chris Wilder loses his cool",
            "The Masters LIVE Early starters chase Rose, DeChambeau and McIlroy",
            "Chelsea reach FA Cup final with late winner against Liverpool",
            "IPL 2025 Updated Points Table, Orange and Purple Cap lists after Lucknow Super Giants beat Gujarat Titans by 6 wickets",
            "NBA legend slams LeBron James for shirtless warmup: 'Put a fine on that'",
            "Ederson DOUBLES old Premier League record in Man City's remarkable win over Crystal Palace",
            "One favorite, one longshot to win the Masters heading into the weekend",
            "Man City star 'could make shock summer exit and return to his former club' - with the player 'willing to take a pay cut on his £300k-a-week salary'",
            "Rory McIlroy’s electric finish ignites Masters bid as Justin Rose leads pack",
            "‘I see it every day’: Bo Levi Mitchell visualizes retiring if Hamilton Tiger-Cats win Grey Cup in 2025",
            "How The Last of Us Fans Turned Against Its Breakout Star",
            "IPL reschedule due to assembly elections",
            "WATCH: NFL commissioner says players ‘should stand for the national anthem’",
            "France beat brave Wales to remain on course for title",
            "Kevin De Bruyne open to Premier League stay after Manchester City exit",
            "Damsgaard: It's crazy how my season has panned out after injuries",
            "SRH vs PBKS - Head-to-Head, IPL 2025: Pat Cummins’ Hyderabad Face Off Against Shreyas Iyer’s Punjab - Check Stats And More",
            "US star McKennie among 13 players being investigated for illegal gambling",
            "Arsenal vs Brentford LIVE: Premier League latest score and confirmed lineups",
            "The M.V.P. of Each N.H.L. Team This Season",
            "KK vs MS PSL FREE Live Streaming Details: When And Where To Watch PSL 2025 Karachi Kings vs Multan Sultans 3rd Match Live Telecast On TV, Mobile APPs online",
            "Donald Trump snubs Rory McIlroy as he reveals who he wants to win The Masters",
            "Impressive Alcaraz reaches Monte-Carlo Masters final",
            "Copa City boss talks moving from career in football to building his dream game",
            "8 defensive players who could be secret superstars in the 2025 NFL Draft",
            "BREAKING: Cardiff vs Stoke City SUSPENDED as medical emergency halts Championship match",
            "Oliver Glasner criticises Jean-Philippe Mateta after Crystal Palace defeat to Manchester City",
            "France rugby star Chabal doesn't remember 'single second' of career due to concussion",
            "EFL: WBA lead; Sunderland level | Leeds win Sheff U lose in early drama LIVE",
            "IPL 2025, PBKS vs SRH: Punjab Kings elects to bat against Sunrisers Hyderabad",
            "Delly’s amazing road to NBA glory",
            "Nikola Jokić becomes third ever NBA player to average triple-double for year",
            "Leeds back on top of Championship after beating Preston",
            "‘Everyone wants to be Suarez’",
            "Peter Crouch and Joe Cole issue verdicts on Premier League top-five race as both pundits agree on MAJOR omission",
            "Kevin De Bruyne offers update on his future after sending Man City reminder",
            "Karachi Kings v Multan Sultans - PSL scorecard",
            "Patidar lauds Krunal's 'courage' after triple-wicket final over",
            "Finding the next football star",
            "Brandon Ingram gets injection for ankle sprain",
            "Here are the qualification scenarios for the playoffs for the Habs today",
            "Pep Guardiola response to Kevin de Bruyne speak volumes after thunderous cheers",
            "Arsenal vs Brentford: Prediction, kick-off time, TV, live stream, team news, h2h results, odds today",
            "Jordan Nobbs Column: England Have Impressed So Far But Must Be Wary of Tough Japan Challenge",
            "NBA final weekend: What's at stake as West playoff spots still up for grabs; Lakers, Knicks lock No. 3 seeds",
            "Guardiola praises 'unbelievable' Ederson after assist",
            "ESPN projects Nets to take Jeremiah Fears in 2025 NBA mock draft",
            "De Bruyne yet to make decision about his post-Man City future",
            "265 - Mr. Lasagna",
            "The Canadiens unable to’ officiate their spot in playoffs",
            "IPL 2025, LSG vs GT | Lucknow Super Giants beat Gujarat Titans by six wickets",
            "2025 NBA Playoff Picture: All the wild West scenarios entering the final day of the regular season",
            "Bogle puts Leeds back on top with crucial winner over Preston",
            "Play Connections: Sports Edition. Tackle Today’s Puzzle.",
            "Oliver Glasner criticises Jean-Philippe Mateta as he explains Crystal Palace half-time sub in Man City defeat",
            "Top-4 : the Flames refuse to die and come back in the playoff race",
            "Karachi Kings vs Multan Sultans Dream11 Team Prediction PSL 2025 3rd Match Preview, Fantasy Picks, Squads, Captain, Vice-Captain, Best Playing 11s, News For KK vs MUL Match Today At 9 PM",
            "The Best-Case Scenario for Shedeur Sanders in the N.F.L. Draft",
            "Rory McIlroy back in the mix after prayers answered around Amen Corner",
            "Premier League Soccer: Stream Arsenal vs. Brentford From Anywhere",
            "'College football is a joke,' NFL star declares amid sport's latest NIL drama",
            "Masters 2025: Meet the gorgeous wives of Rory McIlroy, Justin Rose, Scottie Scheffler, more",
            "'There Was No Intent...': Michael Clarke Questions CSK's Approach After Humiliating Loss Against KKR",
            "USC picks up commitment from Samford transfer Jaden Brownell",
            "Dean Henderson Man United transfer buy-back clause explained as Ruben Amorim 'wants' new goalkeeper"
        ]
    },
    "Topic 3": {
        "keywords": [
            "climate",
            "dire",
            "wolf",
            "fever",
            "water",
            "change",
            "scientists",
            "risk",
            "hay",
            "jwst"
        ],
        "titles": [
            "Crows Are Surprisingly Good at Geometry",
            "Giant rodents cuddle with visitors at the Capybara Cafe in Florida",
            "Sunny spell to cool in coming days - but pollen levels high for many",
            "Bomb Explodes Outside Train Station in Greek Capital Athens",
            "Revealed: nearly 2m hectares of koala habitat bulldozed since 2011 – despite political promises to protect species",
            "Weather tracker: early heatwave sweeps northern India",
            "ATREE researchers rediscover long-lost species after 111 years",
            "The Climate Has Changed on Climate Change",
            "5 of the Biggest Extraterrestrial Impacts That Moved Oceans and Made Moons",
            "Wolf made famous in 'Game of Thrones' brought back from 12,500-year extinction, US company claims",
            "The Return of the Dire Wolf",
            "Record-breaking 'dead' galaxy discovered by JWST lived fast and died young in the early universe",
            "Dinosaurs Weren’t Fading Before the Asteroid—We Just Suck at Finding Their Fossils",
            "Spectacular blue spiral light brightens up night sky, likely from Space X rocket",
            "The Science Behind the Return of the Dire Wolf",
            "Nepal fights wildfires and pollution amidst drier winter",
            "Starlings fall to record low in UK’s 2025 Big Garden Birdwatch",
            "Australians warned about wild mushroom risk",
            "Deep in space, a flicker of life",
            "Nifty bulls in panic mode. Peter Lynch's 4 rules for surviving market mayhem",
            "Rare virus that killed Gene Hackman's wife linked to 3 deaths in California town",
            "Starlings disappearing from gardens, says RSPB",
            "JWST Spots Remains of Alien Planet That Fell into a Star",
            "Shock toxic water findings",
            "Yowie: Animal Kingdom Resident or Hoax Down Under?",
            "Assessment of Land Condition: A Critical Step in Identifying Contaminated Sites",
            "Remains of dozens of Indigenous ancestors returned to Australia",
            "These two biologists found purpose—and love—trying to save Nigeria's bats",
            "The 'Not Deer' Cryptid Is Exactly What It Sounds Like",
            "Proposed Cuts to NOAA Have Lefties Melting Down Faster than Polar Ice Caps in a Climate Hoax",
            "Ancient rocks tie Roman Empire’s collapse to a mini ice age",
            "White House aims to eliminate NOAA climate research in budget plan",
            "JWST Is Tracking Down the Cosmic Origins of Earth's Water",
            "The fix for parched western states: Recycled toilet water",
            "Noaa fires hundreds of climate workers after court clears way for dismissals",
            "Chinese Lunar Rocks Suggest a Thirsty Far Side of the Moon",
            "Is the Bloop Real? Well, Yes and No",
            "RB Minister expresses concern at depleting groundwater levels in Annamayya district",
            "Inspectors warn two Edinburgh schools are 'substantial fire risk'",
            "Indian man who fed water to cheetahs in viral video restored in job",
            "Astronomers Measure Rotation Rate of Uranus with Unprecedented Precision",
            "Neutrinos Are Shrinking, and That’s a Good Thing for Physics",
            "Hay fever making your life a misery? Try these 20 tips from doctors and allergy experts",
            "A Black Hole Awakens in a Distant Galaxy, Producing X-Ray Bursts",
            "Jawbone fossil builds richer image of ancient Denisovans",
            "Dracula parrot: The goth bird whose piercing screams echo through New Guinea forests",
            "Are cats really afraid of cucumbers? We asked the experts.",
            "Pleistocene-Age Denisovan Fossil Found in Taiwan",
            "Don’t buy-in to climate science denialism",
            "A proposed tax credit could help homeowners hit by climate-fueled natural disasters",
            "Bizarre New Species of Therizinosaur Had Two-Fingered Hands",
            "Wild weather: ’It was like a tidal wave’",
            "White House ends funding for key US climate body: ‘No coming back from this’",
            "Ireland at risk of energy crisis without gas reserve, warns environment minister",
            "When did humans first arrive in Southeast Asia?",
            "Forest Department invites public participation to choose ‘Bird of Salem’",
            "Yes, Climate Change Really is Making Your Hay Fever Worse",
            "Ecological disruptions are a risk to national security",
            "An Evolutionary 'Big Bang' Explains Why Snakes Come in So Many Strange Varieties",
            "Galaxies collide in stunning picture",
            "Science news this week: Controversy around the dire wolf 'de-extinctions' and a 3D hologram breakthrough",
            "Valley fever turning into an endemic in California: Scientists find a strong link to dogs",
            "Logging doesn’t prevent wildfires, but Trump is trying it anyway",
            "The Dire Wolf Is Back",
            "The dire wolf has come out of extinction — kind of",
            "Denisovans Extend Their Range to Asia’s Pacific Coast",
            "'Well-preserved' baby mammoth dating back to Ice Age dissected by scientists: photos",
            "Validating new limits for human thermoregulation",
            "Hydro project in 'recycled' gold mine could power 2 million homes",
            "Rare ‘Sharktopus’ – an octopus riding a shark – sighting caught on camera shared by scientists",
            "Stunning Comet Could Photobomb This April's Total Solar Eclipse",
            "La Nina exits after three weak months, leaving Earth in neutral climate state",
            "US storms, 'devastating' flooding death toll climbs to 17",
            "Drop Bears, Australia and an Enduring Prank on Non-Aussies",
            "Is it Game of Thrones again? Dire wolves back to life after 10,000 years?",
            "The 5 senses of spring: How climate change is shaping our seasonal experience",
            "Where Schrödinger’s cat came from – and why it’s getting fatter",
            "‘Don’t let me flip that switch’: Riders’ RB A.J. Ouellette turned carnivore to fuel viral body transformation",
            "‘It’s still a prison. I feel like an animal’",
            "KATRIN Physicists Measure Upper Mass Limit of Neutrino",
            "Boffins turn Moon dirt into glass for solar panels, eye future lunar base power",
            "How to see tonight's Pink Moon as the once-in-a-year lunar event takes place",
            "Jeremiah Ostriker, Who Plumbed Dark Forces That Shape Universe, Dies at 86",
            "Glowing blue spiral spotted across Europe night sky captivates stargazers",
            "Scientists genetically engineer wolves with white hair like the extinct dire wolf",
            "What do climate protests actually achieve? More than you think.",
            "Trump administration cuts 4m to Princeton’s climate research funding",
            "How climate change is making hay fever more miserable",
            "Hodag: From Wisconsin Hoax to Best-selling Beast",
            "‘Toxic cocktail’: study finds almost 200 pesticides in European homes",
            "Introducing NEO Gamma - Another Step Closer to Home",
            "New Genomic Research Sheds More Light on Evolutionary History of Mammoths",
            "​Dire efforts: On de-extinction and conservation",
            "This federal rule helped clear air over America's most beloved parks. Trump's EPA wants to kill it",
            "Here Are the Most ‘Attractive’ Global Cities. But Can They Keep Their Edge in the Post-Pandemic World?"
        ]
    },
    "Topic 4": {
        "keywords": [
            "birth",
            "kakkar",
            "pregnant",
            "waqf",
            "woman",
            "film",
            "act",
            "passengers",
            "sahib",
            "tony"
        ],
        "titles": [
            "Congress Slams Nitish Kumar-Led NDA Govt Over Bihar`s Development, Caste Survey",
            "Poilievre vows not to pass abortion restrictions if elected prime minister",
            "Cilic Expecting First Child In 2020",
            "U.S. Pregnancy-Related Deaths Rise Over 5 Years",
            "Comment on Kamakhya Express Derails Near Odisha’s Cuttack: Impact of Train Accidents On Passengers’ Mental Health by jokerbet güncel giriş",
            "Deadly crash raises new questions about safety of New York’s helicopter tours",
            "Ministers raise concern over NASUWT move for ‘combative’ ex-FBU chief",
            "Sonu Kakkar cuts ties with siblings Tony and Neha Kakkar, says 'Deeply devastated...'",
            "Aaradhya will become a 'dominating lady' in future",
            "Why Akal Takht Sahib Acting Jathedar Suddenly Announced to Honour 11 Sikh Personalities",
            "Delayed ‘Phule’ to clear controversy, already complied with CBFC amendments: Anant Mahadevan",
            "Woman hit at golf club by van being pursued by police ‘critical but stable’",
            "Rise of Telugu cinema at the Indian box office",
            "How Gurbani Strengthened Me in Prison Cells: Exclusive Talk with Bhai Lal Singh Akalgarh",
            "Safety tips for solo woman traveller",
            "JK: Two Students Killed, 22 Injured In Handwara Bus Accident",
            "Tamil Nadu Gets New BJP Chief, Day After Alliance Announced With AIADMK - NDTV",
            "'I didn't know I was pregnant until I gave birth'",
            "Commercial flying ‘never safer’",
            "Police identify victims, including teen, in Boca Raton plane crash",
            "Vikrant Massey growing his beard for the role of Gurudev Sri Sri Ravi Shankar?",
            "Ananya Birla gifts Janhvi Rs 5-cr Lamborghini",
            "Twin baby dies in home birth tragedy",
            "Kartik Aaryan to have a double role in Nagzilla; to be the hero villain like SRK in Jawan?",
            "Charu Asopa hits out at ex-husband Rajeev Sen for ‘drama’ dig, REVEALS why she left Mumbai: 'Nothing is more...'",
            "Tillerson: ‘Heartbreaking’ reports of suffering in Myanmar",
            "Kapil Sharma to star in new comedy film with Riddhima Kapoor Sahni in her debut: Report",
            "Calcutta HC orders deployment of central forces in Murshidabad over clashes against Waqf Act",
            "Aamir Khan shoots special song with Genelia Deshmukh for Sitaare Zameen Par",
            "Bollywood posters copied from Hollywood",
            "Maddarki village accident: Death toll rises to five",
            "US gets D+ grade for rising preterm birth rates, new report finds",
            "'Most dangerous sex position' in the world is responsible for an unbelievable amount of injuries",
            "Temple students surprised after human remains, bone fragments discovered on campus",
            "Nainar Nagenthran elected as Tamil Nadu BJP chief",
            "Waqf Act a complex legislation, result of dialogue and democratic process: Jayant Chaudhary",
            "Behind the Scenes Video Shows Karoline Leavitt Praying Before Heading Out to Drop the Hammer on Reporters",
            "PM Modi to launch development projects in Haryana on Ambedkar birth anniversary",
            "Mamata Banerjee Inciting Anti-Hindu Violence In Name Of Waqf Protests, Alleges BJP",
            "'I was born without a uterus - now I'm pregnant with my second child after life-changing op'",
            "Where Are Missing Saroops of Guru Granth Sahib: Analysing SGPC’s Reactions, Response Actions",
            "Gender Neutral Blood Donation Comes With Sting In Its Tail",
            "Rogue doctors stole one woman’s eggs to get another patient pregnant. What happened next is an unlikely tale of friendship against the odds",
            "Comment on Unexpected Delivery: Pregnant Woman Gives Birth On Bangkok Street Amid Strong Quake – WATCH VIDEO by jokerbet güncel",
            "Nobu Matsuhisa: ‘I’d watch my mentor making sushi and copy him under the table’",
            "Three docs booked as pregnant woman dies at UP hospital; CMO recommends sealing facility",
            "AIADMK-BJP alliance doomed to fail, says TN CM Stalin",
            "Issue of Sri Guru Granth Sahib Ji’s Saroop – Who Are The Real Culprits?",
            "Calcutta HC orders CAPF deployment in Bengal' Murshidabad as Waqf clashes kill 3 - Hindustan Times",
            "What is controversy over statue of DOG near memorial of Shivaji Maharaj at Raigad Fort?",
            "‘Kennedy’ screened at 10th Indie Meme Film Festival; Anurag Kashyap says India release ‘should happen soon’",
            "States Advance Fetal Rights Measures That Critics Warn Could Lead to Abortion Bans",
            "​Can cracking joints lead to arthritis? Fact-check​",
            "Tigerair passengers stranded",
            "Trisha is a titan herself",
            "'Karan Johar only casts people who are like star kids or whatever but...': Kill fame Abhishek Chauhan talks about how industry works| Exclusive",
            "Jaat Vs Good Bad Ugly Box Office Collection Day 3: Sunny Deol film inches close to..., Ajith Kumar starrer records an impressive...",
            "Believers visit Miracle Cross in Nandagad",
            "Kathak legend Kumudini Lakhia passes away",
            "Sonu Kakkar announces split from siblings Neha, Tony",
            "On way to picnic, 2 Kashmir college students dead as bus meets with accident",
            "Australian woman unknowingly gives birth to a stranger's baby after IVF clinic error",
            "Passengers in safe hands",
            "Youth Congress protest march to Suresh Gopi’s office in Thrissur against attack on Christian priest in Jabalpur",
            "Abhishek Chauhan talks about his 'complex' character in Khauf, shares working experience with Monika Panwar, his take on OTT censorship | Exclusive",
            "Beach Boy ‘witnessed a Manson murder’",
            "3 Dead As Clashes Erupt Amidst Waqf Act Protests In West Bengal`s Murshidabad",
            "'Major' ancient Egyptian town discovered — and it has a jug stamped with the name of Nefertiti's daughter",
            "Meet actress who is close friends with Isha Ambani, charges Rs 35 crore for a film, will next be seen in...",
            "Comment on Unexpected Delivery: Pregnant Woman Gives Birth On Bangkok Street Amid Strong Quake – WATCH VIDEO by jokerbet giriş",
            "Salim’s prayer meet: Jackie, Vardhan and more pay respects",
            "Protest against Wakf Amendment Act in Mangaluru",
            "Khalsa Jee Ke Bol Baaley : Guru Khalsa Panth – Dr. Gurpreet Singh During Discussion by Samvad",
            "Statehood is BJP’s promise, no need for Omar Abdullah to seek it: J-K LoP",
            "Sonu Kakkar announces she is 'no longer a sister' to Neha Kakkar, Tony Kakkar: 'This decision comes from...'",
            "Yeh Rishta Kya Kehlata Hai: Samridhii Shukla, Rohit Purohit’s new pictures will leave you excited for the upcoming AbhiMaan romance"
        ]
    },
    "Topic 5": {
        "keywords": [
            "brain",
            "kidney",
            "surgery",
            "eric",
            "mccall",
            "davina",
            "weight",
            "heart",
            "star",
            "greys"
        ],
        "titles": [
            "Pig kidney transplant fails after patient rejection",
            "Kale and fish among foods that could boost brain health and reduce risk of dementia",
            "Who is Rebecca Gayheart? What to know about Eric Dane's wife",
            "Maximise your weight loss workouts with the expert-recommended ‘3-3-3 rule'",
            "Harvard experts pinpoint 'overlooked' risk factors for dementia and they're all preventable",
            "Dried Fruit and Nuts: When Is the Best Time to Eat Them?",
            "Subtle warning signs of deadly motor neurone disease no one should dismiss - as Grey's Anatomy star Eric Dane reveals his diagnosis",
            "Signs your body is begging for vital nutrient that affects 'almost all of you'",
            "What goes on inside toddlers' brains? A pioneering project is trying to find out",
            "Malnutrition-Related Diabetes Officially Named ‘Type 5’",
            "Chocolates for your heart",
            "Phone a trainer",
            "New fitness metric may predict heart disease risk better than steps or heart rate, finds study",
            "Brian May makes huge music comeback on stage months after suffering major stroke",
            "Save your hair. Have soy",
            "What goes on inside toddlers' brains?",
            "Loose Women star Gloria Hunniford's 'awful' health scare that led to emergency surgery",
            "Doctor Who Recap: What’s Schwup, Doc?",
            "Davina McCall issues emotional health update after major brain tumour surgery",
            "'Healthy' woman, 35, died just three days after medics dismissed symptoms of deadly condition",
            "Cancer dietitian reveals controversial snack that wards off cancer",
            "Teddi Mellencamp posts before-and-after pics of last 4 months of cancer journey",
            "A machine using ultrasound and AI can gauge the fattiness of a tuna fish",
            "Get fitter in just 53 days",
            "People using drug Mounjaro sustain weight loss over three years, trial finds",
            "When is the best time to exercise - morning, midday or evening?",
            "What happens when you donate your body after death - as Coronation Street star has 'no funeral'",
            "One Diuretic May Be Better for Hypertensive Patients With Kidney Stone History",
            "Why Am I Always Tired? Here Are 7 Common Reasons Why You Might Be Feeling Fatigue",
            "Can Eating Certain Foods Really Help You Get Pregnant?",
            "Chlorthalidone Increases Kidney Stone Recurrence",
            "Eric Dane, ‘Grey’s Anatomy’ star, says he’s been diagnosed with ALS",
            "US scientists create most comprehensive circuit diagram of mammalian brain",
            "This popular GLP-1 drug helps shed massive amount of weight and keep it off for years, find scientists",
            "A neuroimmune circuit mediates cancer cachexia-associated apathy | Science",
            "Groundbreaking eye test can detect Parkinson's 'seven years before symptoms'",
            "Teen goes from 10 nightly seizures to zero with brain implant",
            "Bengaluru woman reduces 56 kilos; shares diet, workout plan: Here's her little secret to weight loss",
            "Alert: An Alabama woman who lived with a pig kidney for a record 130 days had the organ removed and is back on dialysis",
            "Doctors remove pig kidney from an Alabama woman after a record 130 days",
            "Experimental therapy gantenerumab fails to slow or improve Alzheimer's memory loss in clinical trials",
            "Poor hearing increases early death risk due to 'significant' link to heart failure",
            "Young people in the UK: tell us about your gym habits",
            "Pig Kidney Removed From Alabama Woman After Organ Rejection",
            "Narcolepsy-CVD Link: Stage Is Set as Early as Childhood",
            "9 ways to prevent diabetes",
            "Sparsentan Provides Better Proteinuria Reduction in FSGS",
            "Davina McCall given all-clear after life-saving brain surgery",
            "L’acteur de «Grey’s Anatomy» et «Euphoria» Eric Dane révèle être atteint de la SLA",
            "Scientists Map Miles of Wiring in a Speck of Mouse Brain",
            "Five easy lifestyle changes to get fitter - even if you're too busy for the gym",
            "A tub a day: might eating yoghurt help you live longer?",
            "Antioxidant-rich tea fights inflammation and protects against heart disease and diabetes",
            "Davina McCall confirms she’s got the all clear after brain tumour surgery",
            "Davina McCall shares emotional health update after getting the all-clear following brain tumour surgery",
            "Teddi Mellencamp Reveals Multiple Brain Tumors: Here’s Everything the ‘RHOBH’ Star Has Shared About Her Diagnosis",
            "Grey's Anatomy star Eric Dane reveals he's been diagnosed with ALS",
            "What Happens When Your Blood Sugar Is Too High? Signs and Solutions",
            "This Pork Tenderloin ‘Steak’ Has 33 Grams of Protein Per Serving",
            "How Realistic Is the Severance Procedure? Brain Surgeons Have Some Thoughts",
            "One simple Japanese eating rule that could help you lose weight",
            "Davina McCall says brain tumour is ‘not coming back’ in ‘final’ surgery update",
            "Kate's Cancer Diagnosis: Why Are Women Always Pressured to Show Up?",
            "5 nurses who work on the same floor at Massachusetts hospital have brain tumors"
        ]
    },
    "Topic 6": {
        "keywords": [
            "internet",
            "fund",
            "credit",
            "providers",
            "10bn",
            "whatsapp",
            "card",
            "does",
            "users",
            "gold"
        ],
        "titles": [
            "Best Internet Providers in West Valley City, Utah",
            "Smallcaps stumble but Avanti Feeds, Senco Gold, 8 others shine with weekly gains up to 22",
            "‘ALP’s NBN needs extra 10bn’",
            "Best Internet Providers in Traverse City, Michigan",
            "Fund for regions rebranded",
            "National Herald Probe: ED`s Crackdown On Rs 661 Crores Assets In Rahul, Sonia Gandhi-Linked AJL Case",
            "Centrelink data to be ‘refined’",
            "Tips to make your small house look bigger",
            "Home loan approvals bounce back",
            "Best Internet Providers in Bellingham, Washington",
            "Labor proposes 5 per cent deposits for all first home buyers",
            "Join our free WhatsApp Money community to get the latest tips and advice to your phone",
            "WhatsApp down for several users globally, massive outage reported",
            "Commissions driving unit sales",
            "How to convert large purchases made by SBI credit card into EMIs? A step-by-step guide",
            "Advertising adds up to 40bn",
            "Pay takes a pounding",
            "Taxman joins gold rush",
            "National Herald case: ED moves to seize assets worth Rs 661 cr",
            "How to link your credit card to Google Pay: A step-by-step guide",
            "How To Add Credit Or Debit Card On Google Pay In Android; Follow THESE Steps",
            "Investment word of the day: Fund of funds —what is FoF and how does it work? Types, advantages and more",
            "9 Ways You Can Save the Internet Right Now",
            "Albanese to pledge 10bn to help build 100,000 homes for first-time buyers",
            "Zelle App Is No More. But You Can Still Send Money Digitally With These Banks",
            "ChatGPT got over 52 times more monthly visitors than Copilot",
            "India's TCS posts small profits dip in 'challenging' environment",
            "ATT Assistant VP Shares the Travel Advantages of an In-Car Wi-Fi Hotspot",
            "IEEE TryEngineering STEM Grants Fund Over 50 Projects",
            "How to tell a good loan from a bad one",
            "Farm production to be ‘worth 58.5b’",
            "How Much Does Does F45 Cost? Here's the Membership Breakdown",
            "Monthly SIP of 10K in this mutual fund since its launch would have grown to 3.18 crore now. Check how",
            "UPI outage: Several users say transactions failing; NPCI says working to resolve ‘intermittent technical issues’",
            "What RBI's proposed norms mean for co-lending, gold loans",
            "Snapchat valued at 10bn",
            "India's Modi clinches defence, energy deals in Sri Lanka",
            "These 5 credit cards give free access to domestic and international airport lounges. Check list here",
            "Vijay Kedia trims stake in Global Vectra in March quarter. Here’s how this smallcap stock has performed",
            "Is Your Internet as Fast as It Should Be? Here’s How to Find Out and Fix Lagging Speeds",
            "WPSmartPay: Modern payment solution for WordPress",
            "Is your WhatsApp down too? Several users claim they are unable to upload status, send texts",
            "Best Mobile VPN of 2025: Stream on the Go and Avoid Mobile Traffic-Shaping",
            "Data | Nearly 40 Indians paid bribes to use public services, highest among most Asian nations"
        ]
    },
    "Topic 7": {
        "keywords": [
            "la",
            "les",
            "le",
            "au",
            "une",
            "des",
            "du",
            "et",
            "en",
            "pour"
        ],
        "titles": [
            "Le saumon fumé au banc d’essai",
            "Voici les meilleurs aliments à consommer pour avoir une meilleure mémoire",
            "Voici pourquoi une bonne nuit de sommeil prévient l'obésité et favorise la perte de poids",
            "Quand les syndicats trahissent les Québécois",
            "Les Oilers retrouvent graduellement leurs éclopés",
            "Elle quitte les réseaux sociaux pour réfléchir... et perd 47 livres",
            "50 000 d’amende: une prétendue séparation pour évincer leur locataire de 68 ans",
            "Brock Boeser aurait refusé 40 M des Canucks",
            "La fièvre du hockey au secours des Québécois",
            "«Je me suis dit: Profites-en parce que c’est peut-être la dernière fois que tu le fais», raconte la lectrice de nouvelles Julie Drolet qui révèle être atteinte d'un cancer du sein très agressif",
            "Coup d’éclat de citoyens sur le site de Stablex",
            "Tournoi des Maîtres: la jeune vedette Ludvig Aberg se démarque avec sa mentalité gagnante",
            "Rage au volant mortelle: le Montréalais accusé libéré sous caution",
            "5 trucs à surveiller aujourd’hui au Tournoi des Maîtres à Augusta",
            "Une mauvaise alimentation pendant la grossesse hausse le risque de TDAH et d’autisme chez les enfants",
            "Salon international du livre de Québec: le phénomène Alex A., créateur de la bande dessinée «L’Agent Jean», attire les jeunes lecteurs",
            "«J’ai survécu. J’ai eu beaucoup de chance»: –Anjelica Huston, la vedette du film «La famille Addams», révèle avoir lutté contre un cancer en secret et en être guérie depuis 4 ans",
            "Course au Calder: Lane Hutson serait confortablement en avance"
        ]
    },
    "Topic 8": {
        "keywords": [
            "steel",
            "british",
            "control",
            "nationalisation",
            "scunthorpe",
            "grangemouth",
            "afford",
            "uk",
            "mps",
            "starmer"
        ],
        "titles": [
            "Starmer aiming to ‘pass emergency legislation in one day’ to save British Steel – as it happened",
            "Starmer steps in to seize control of British Steel with nationalisation likely",
            "Laura Kuenssberg: Can UK afford to save British Steel – and can it afford not to?",
            "Are we on a one-way road to nationalising British Steel?",
            "UK seeks emergency powers to take over British Steel",
            "MPs approve British Steel bill after Chinese owners’ ‘excessive’ demands – live",
            "Labour MP calls for ministers to act over Grangemouth as well as at Scunthorpe",
            "Grangemouth closure 'not comparable' to British Steel, MPs told",
            "Debate: Does the UK need British Steel?",
            "Government aims to take control of British Steel",
            "Scunthorpe workers relieved as government considers nationalisation",
            "From retreat to reclamation: Britain eyes State control in steel-making, India forges ahead with private sector in tow",
            "Why is British Steel in trouble and who owns it?"
        ]
    }
}