{
    "Topic 0": {
        "keywords": [
            "space",
            "nasa",
            "katy",
            "blue",
            "perry",
            "dire",
            "wolf",
            "life",
            "rocket",
            "origin"
        ],
        "titles": [
            "Nasa Astronaut Sunita Williams Begins 45-Day Rehabilitation Programme To Tackle Likely Health Challenges After Prolonged Stay In Space",
            "A Black Hole Awakens in a Distant Galaxy, Producing X-Ray Bursts",
            "‘Hang on, aren’t we all boat people?’",
            "A Cautionary Tale of 408 Tentacles",
            "OOFOS Ooaah Sport Slide Vs. Hoka Restore TC: Which Recovery Shoe Is Better For You?",
            "Trippy time-lapse shows Starlink satellites streak light across space",
            "Drop Bears, Australia and an Enduring Prank on Non-Aussies",
            "The Sunday Papers",
            "Tigerair passengers stranded",
            "I was once an atheist - these stories have convinced me that heaven AND hell are real",
            "‘Unprecedented’ sightings of Asian hornets raise fears for UK bees",
            "Chinese airlines eye Qantas",
            "Go to town The surprise feelgood effects of walking in the city",
            "Sounds exhilarating",
            "Sunita Williams Begins Return Journey To Earth After 9 Months: NASA SpaceX Crew-9 Departs ISS",
            "Bizarre New Species of Therizinosaur Had Two-Fingered Hands",
            "Looking for the authentic Algarve? Go in the low season – and to Tavira",
            "Patio Furniture and Outdoor Accessories for Summer on Amazon",
            "One swimmer killed and another fighting for his life after friends pulled them from the surf",
            "Sam Altman has a crib recommendation &mdash; and it's not the Snoo",
            "New Genomic Research Sheds More Light on Evolutionary History of Mammoths",
            "Inside the fight to save California’s dying sea lions from toxic algae: ‘We’re like 911 operators’",
            "Terrifying new theory of what's behind Tic Tac UFOs that keep rising from ocean in front of US Navy sailors",
            "Katy Perry reveals she's 'dreamt of going to space for 15 years' ahead of all-female mission as she gives BTS look inside Blue Origin rocket",
            "Is it Game of Thrones again? Dire wolves back to life after 10,000 years?",
            "Galaxies collide in stunning picture",
            "5 of the Biggest Extraterrestrial Impacts That Moved Oceans and Made Moons",
            "Denisovans Extend Their Range to Asia’s Pacific Coast",
            "'Alien' encounter: ISS crew member plays joke as SpaceX team arrives",
            "DMZ: Nuclear Survival is a new open-world survival game with crafting, exploration, and beer-swilling bears",
            "Morning news brief",
            "These two biologists found purpose—and love—trying to save Nigeria's bats",
            "GLOBE Mission Earth Supports Career Technical Education",
            "Bali chaos as Tiger row deepens",
            "JWST Is Tracking Down the Cosmic Origins of Earth's Water",
            "Indigo flights to shift to T1 from tomorrow: What passengers should know about terminals, departures, schedule, and more",
            "Fears for driver who ploughed into a woman and crashed into Sydney Harbour - as search desperate rescue operation unfolds",
            "Eclipse review – Tom Conti stars in intriguing but elusive tale of a mysterious death",
            "Scientists genetically engineer wolves with white hair like the extinct dire wolf",
            "Katy Perry set for space with all-women crew on Blue Origin rocket",
            "NASA astronauts’ return is near. Their long, unlikely trip puts focus on resilience.",
            "Where Schrödinger’s cat came from – and why it’s getting fatter",
            "World-first certification for once 'severely overfished' Australian tuna",
            "3.5-Billion-Year-Old Crater Discovery Sheds Light On Earth's Ancient Impact History",
            "Oxford University's William Hague makes appearance at Boat Race",
            "Katy Perry reveals she ‘plans to sing in space’ ahead of history-making mission",
            "The 'Not Deer' Cryptid Is Exactly What It Sounds Like",
            "NASA astronauts return to Earth after 9 months stuck in space",
            "What Is the Office for Today?",
            "You'll Love Our The Last of Us Gift Guide for a Long Long Time",
            "Fashion Tips for Styling Legs and Hiding Cankles Effectively",
            "What is the 'Eye of Horus' and why is it found in so many ancient Egyptian burials?",
            "We love: fashion fixes for the week ahead – in pictures",
            "Spectacular blue spiral light brightens up night sky, likely from Space X rocket",
            "Top Tech Conferences & Events to Add to Your Calendar in 2025",
            "A machine using ultrasound and AI can gauge the fattiness of a tuna fish",
            "Lauren Sanchez’s all-female space flight is about to blast off – and will challenge Elon Musk’s SpaceX",
            "What Katy Perry and More Stars Have Said About Going to Space",
            "Wear your chocolates this Easter with the trendiest brown fashion buys from £29",
            "Global Getaways: Explore the World and Have the Time of Your Life",
            "Kangaroos’ extraordinary punishment",
            "Studied over 21 years, new frog species ‘Leptobrachium aryatium’ named after Assam college",
            "The Best Diaper Bag That Is Chic and Functional -- LeSportsac, Herschel, Rebecca Minkoff and More",
            "Rare ‘Sharktopus’ – an octopus riding a shark – sighting caught on camera shared by scientists",
            "What the surprising lives of solitary animals reveal about us",
            "Wolf made famous in 'Game of Thrones' brought back from 12,500-year extinction, US company claims",
            "'Well-preserved' baby mammoth dating back to Ice Age dissected by scientists: photos",
            "The perfect ‘new’ handbag? An old one | Jess Cartner-Morley on fashion",
            "Comment on Live News: Sunita Williams Considered Retirement Before Going To ISS – Family Shares NASA Astronaut’s Struggles In Space by jokerbet giriş",
            "Scientific consensus shows race is a human invention, not biological reality",
            "Commercial flying ‘never safer’",
            "Sayaka Murata’s Alien Eye",
            "Hodag: From Wisconsin Hoax to Best-selling Beast",
            "Meghan Markle sent her lifestyle products to King Charles in bid to end royal rift: experts",
            "Starlings disappearing from gardens, says RSPB",
            "Safety tips for solo woman traveller",
            "'Quantum Darwinism' may explain why we live in a shared reality",
            "ISRO’s POEM-4 Safely Re-Enters Earth’s Atmosphere, Reinforces Space Debris-Free Commitment",
            "A ballet retreat in the Maldives changed my outlook — here's why everyone should do a hobby holiday",
            "Comment on Sunita Williams Press Conference Live: NASA Astronaut To Share 9 Month Space Experience On March 31 – Where To Watch by Laurine Lowe",
            "Rare ‘Morning Glory’ cloud dazzles Virgin flyers",
            "Pleistocene-Age Denisovan Fossil Found in Taiwan",
            "The Dire Wolf Is Back",
            "An Evolutionary 'Big Bang' Explains Why Snakes Come in So Many Strange Varieties",
            "This Butterfly’s Epic Migration Is Written into Its Chemistry",
            "Lab-grown human teeth to 'fill in the gaps' in regenerative dentistry",
            "Yackandandah adds another Community Battery",
            "Surprise detail in Katy Perry’s history-making spaceflight",
            "M&S shoppers say spring-ready £50 denim dress looks 'triple the price' and 'fits amazingly'",
            "Jawbone fossil builds richer image of ancient Denisovans",
            "‘They called it black gold’: but should cuttlefish be on our menus?",
            "Balenciaga and orthopaedic brand Scholl team up for ‘Frankenshoe’ hybrid",
            "‘It’s still a prison. I feel like an animal’",
            "The Return of the Dire Wolf",
            "So You Want to Be a Dissident?",
            "Introducing NEO Gamma - Another Step Closer to Home",
            "The Science Behind the Return of the Dire Wolf",
            "Deep in space, a flicker of life",
            "Divers search Parramatta River for man who drove into water at popular north shore fishing spot",
            "What I’ve learned after 40 years as the Observer’s science editor",
            "Breaking the Gender Barrier May Be New for Space Tourism—but Not for NASA Missions",
            "Astronomers Measure Rotation Rate of Uranus with Unprecedented Precision",
            "Warning as 'unprecedented' number of deadly Asian hornets could 'butcher' UK bees",
            "Worst News Outlet of the Week - a Look at the Latest Deliveries From the Dysfunctional Media",
            "Katy Perry gives fans rare look inside Blue Origin rocket hours before historic space mission",
            "Will A.I. Save the News?",
            "JWST Spots Remains of Alien Planet That Fell into a Star",
            "Jesse James represents Australia",
            "The dire wolf has come out of extinction — kind of",
            "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
            "BatEchoMon, India’s first automated bat monitoring, detection system",
            "Today's NYT Mini Crossword Answers for Monday, April 14",
            "Paris Pleasures: Leisurely Explorations",
            "The Science in Science FIction",
            "Two British tourists drown near Great Barrier Reef",
            "How to spot Haumea, one of the solar system's strangest objects",
            "27 Festival Season Essentials, From Face Gems to Cowboy Boots",
            "Horoscope today: Your daily guide for Monday, April 14, 2025",
            "Apollo 13 Launch: 55 Years Ago",
            "The ghostly allure of Dungeness, Kent",
            "Scientists reveal what it's really like to receive a vision from God",
            "The Stunning Lyrid Meteor Shower 2025 Peaks This Month — Here's What to Know",
            "India Is Amazing From Space, For Sure Going Back To My Father's Home Country: NASA Astronaut Sunita Williams",
            "Comment on Kamakhya Express Derails Near Odisha’s Cuttack: Impact of Train Accidents On Passengers’ Mental Health by jokerbet güncel giriş",
            "Passengers in safe hands",
            "The 'Only' Profession to 'Celebrate What It Means to Live a Life'",
            "Today's NYT Connections Hints, Answers and Help for April 14, 673",
            "New simulation of Titanic’s sinking confirms historical testimony",
            "Towns ‘too hot to wear shorts’",
            "The Allure of Dressing for the Masters Will Never Go Out of Style",
            "London travel news LIVE: IT issues affect Gatwick Express, Great Northern, Southern and Thameslink services",
            "NCAA woman of the year among those killed in New York plane crash: 'Lost a lot of very good people'",
            "Celebrity-laden Blue Origin rocket set to launch Monday",
            "The fish hotel",
            "Shoppers 'replace all lipstick' with Victoria Beckham's lip balm that 'keeps lips hydrated all day'",
            "Glowing blue spiral spotted across Europe night sky captivates stargazers",
            "Yowie: Animal Kingdom Resident or Hoax Down Under?",
            "How a Family Calendar Can Simplify Your Life and Keep Everyone Organized",
            "Your favourite bars, beaches, swimming spots and more: readers’ top 10 travel tips on Portugal",
            "Stunning Comet Could Photobomb This April's Total Solar Eclipse",
            "Is the Bloop Real? Well, Yes and No",
            "Exciting stage of life",
            "St. Basil’s first female CEO Diana Horvatovic’s heartfelt leadership lessons",
            "Tigerair ban strands Aussies",
            "How Lauren Sanchez Helped Design Blue Origin’s Flight Suits",
            "Today's NYT Strands Hints, Answers and Help for April 14, 407",
            "‘Amazon slayer’: the Dublin minnow taking on the giants in drone deliveries",
            "GameBreaking News 04/11/25",
            "Historic domes of Hagia Sophia are renovated to protect the landmark from earthquakes",
            "Would YOU wear this to a music festival? Aussie influencers turn heads in very revealing ensembles including fur skirts and belt bras at Coachella"
        ]
    },
    "Topic 1": {
        "keywords": [
            "rory",
            "masters",
            "mcilroy",
            "win",
            "slam",
            "career",
            "playoff",
            "grand",
            "wins",
            "utd"
        ],
        "titles": [
            "Toronto Raptors waive Robinson and Swider",
            "Kent wrap up eight-wicket win against Middlesex",
            "Rory McIlroy breaks down in tears when defending caddy amid Masters title",
            "Henderson, Keita and Gomez fit for Fulham says Liverpool boss Klopp",
            "Rory McIlroy: 'I’ve literally made my dreams come true'",
            "The Canadiens are not assured of making the playoffs: the Blue Jackets won tonight",
            "Rory McIlroy stuns Masters crowd after shot from trees 'falls from golfing heaven'",
            "Big year to play host",
            "Since his return to the game, Kaiden Guhle is hitting his opponents twice as much",
            "Bayindir's failed Man Utd audition offers Onana dilemma",
            "Why Steve Kerr Thinks the N.B.A. Regular Season Has Too Many Games",
            "Fantasy Baseball Week 4 Preview: Top 10 sleeper hitters include Michael Conforto, Jacob Wilson",
            "IPL 2025 | Dhoni is not a soothsayer, he hasn't got a magic wand: CSK head coach Fleming",
            "Sibley puts Surrey on course for win against Hants",
            "Marcus Rashford's future takes fresh twist as new club 'monitoring' Manchester United star",
            "Rory McIlroy winning the Masters had to be this tortuous; it was never going to happen any other way",
            "USADA’s stunning anti-doping swoop on Lesnar",
            "Tiger Woods congratulates Rory McIlroy for making rare golf history with Masters win: 'Welcome to the club'",
            "France rugby star Chabal doesn't remember 'single second' of career due to concussion",
            "Rory McIlroy reveals the secret 'ironic' note he received from controversial jailed Masters champion Angel Cabrera ahead of Augusta victory",
            "The Most Disappointing N.H.L. Players of the Season",
            "Young volleyball star gone too soon",
            "How Liverpool can win the Premier League THIS week",
            "Rory McIlroy's prize money from Masters boosts huge net worth – but he loses massive chunk",
            "Howe remains in hospital but Tindall sure Newcastle win has ‘lifted his spirits’",
            "‘Closer to our dreams’: Van Dijk proud as Liverpool move 13 points clear",
            "Masters LIVE: Rory McIlroy blanks Bryson DeChambeau as Tiger Woods shows true colours",
            "Chicago Sky and Minnesota Lynx make last-minute trade before WNBA draft",
            "Who's in Rory McIlroy's inner circle? Caddie Harry Diamond, wife Erica Stoll, 'the Mac Pack'",
            "Diego Maradona's psychiatrist, on trial over his death, jokingly claimed she had sex with football legend before he died as a 'therapy technique' as her WhatsApp messages are leaked",
            "An Augusta National masterpiece: History, epic moments, all-time champion make 2025 Masters one to remember",
            "The brutal comment Princess Anne made about Mike Tindall's nose before he married Zara Phillips - and how the rugby pro got his own back years later",
            "The ballad of Rory McIlroy: Masters champion and Grand Slam winner",
            "Titans v Sea Eagles: Five things we learned",
            "Manchester United injury update: Joshua Zirkzee, Matthijs de Ligt and Amad Diallo latest news and return dates",
            "Hardik says MI bowlers 'didn't have anywhere to hide' on a 'tough track'",
            "'A fascinating contrast between team-mates and title contenders'",
            "Finding the next football star",
            "McIlroy makes Grand Slam history with dramatic Masters play-off win",
            "Rory McIlroy beats Justin Rose in Masters playoff to win green jacket, complete Grand Slam",
            "2025 WNBA Draft: Biggest needs, possible fits for all 13 teams; Valkyries looking for a bit of everything",
            "Soccer-loving 'grannies' go for the GOOOOAAAALLLL in their version of the World Cup",
            "Samson backs himself to lead Royals youngsters to IPL glory",
            "Alan Shearer tells Man Utd to replace two players after dismal Newcastle defeat",
            "LIVE: Manchester trains STOPPED as 'trespassers' cause major disruption - latest updates",
            "McIlroy 'proud' as Masters play-off win seals career Grand Slam at last",
            "Rory McIlroy's staggering investments including billion pound brand and STD test providers",
            "Korea Box Office: ‘The Match’ Dominates Again as ‘The Amateur’ Debuts at No. 2",
            "‘Everyone wants to be Suarez’",
            "Rory McIlroy wins Masters and completes career Grand Slam after epic Justin Rose battle",
            "Willie Rioli's 'hatred' of Hawthorn outlined in deleted social media post",
            "Today's NYT Connections: Sports Edition Hints and Answers for April 14, 203",
            "Sky-Lynx trade grades: Chicago acquires No. 11 pick in WNBA draft, Minnesota gets future first-rounder",
            "Liverpool attempted to trademark 'Allez Allez Allez' after famous fan chant",
            "Toronto brings 3-game win streak into matchup with Buffalo",
            "Amid an unhinged Masters madness, Rory McIlroy's heart of a champion beats loudest",
            "Rory McIlroy relieved to finally lift decade-long ‘burden’ with dramatic Masters win",
            "Rory McIlroy chokes back tears in Butler Cabin after winning Masters and career slam",
            "Rory McIlroy calls out Tiger Woods and three golf legends for their comments about him",
            "Tottenham injury update: Heung-min Son, Wilson Odobert and Kevin Danso latest news and return dates",
            "McIlroy: I've made my dreams come true after 'heavy burden'",
            "Delta puts Nine back in ratings",
            "Justin Rose breaks silence in touching message to Rory McIlroy after heartbreaking Masters play-off defeat",
            "38 photos and key moments of the Canadiens’ last 4 wins",
            "From Swigs to Swings: Ex-Marketing Exec Who Put a Bud Light in Dylan Mulvaney's Hand Tees Up at LIV Golf",
            "Randeep has NOT yet been approached for ‘Kick 2’",
            "Cambridge sweep Oxford aside to maintain Boat Race dominance with double",
            "Rangers’ Hagi delays Celtic’s Premiership title party with late leveller at Aberdeen",
            "The Best-Case Scenario for Shedeur Sanders in the N.F.L. Draft",
            "McIlroy wins Masters play-off to complete career Grand Slam",
            "NCIS' Michael Weatherly divides fans with Tony & Ziva update",
            "Here’s how the Canadiens can make the playoffs",
            "Rory McIlroy secures career grand slam with dramatic Masters playoff win over Justin Rose",
            "Future stars bring home trophy",
            "One of sport's greatest final-day battles ends with McIlroy's name in lights",
            "Whittaker vs Cameron 2: Everything you need to know",
            "Rory McIlroy wins the Masters Northern Irishman edges Justin Rose in sudden death play-off - after blowing four-shot lead and missing putt to win it - to end 11-year major drought and complete career Grand Slam",
            "Fleming: 'We were sloppy in the field, we lacked accuracy under pressure'",
            "Rematch packs five-a-side football with sweaty thrills",
            "Copa City boss talks moving from career in football to building his dream game",
            "With a little boldness and a lot of luck, McIlroy banishes ghosts of 2011 | Andy Bull",
            "Man City injury update: Ederson, Phil Foden and Erling Haaland latest news and return dates",
            "The Masters 2025: Rory McIlroy seals career grand slam after dramatic play-off – as it happened",
            "Archery World Cup Stage 1: Dhiraj Bommadevara bags individual bronze, men's team wins silver",
            "Deep-voiced Scotty McCreery wins &amp;8220;American Idol&amp;8221;",
            "Mumbai knock KKR out of IPL, set up qualifier-II against RCB",
            "Liverpool injury update: Trent Alexander-Arnold and Joe Gomez latest news and return dates",
            "Scarborough venue sacks bouncers at centre of alleged assault of patron",
            "Clippers beat Warriors on final day of regular season to sink Golden State to play-in",
            "Justin Rose reveals what he told Rory McIlroy after dramatic Masters play-off",
            "Gary Neville names biggest worry for Man Utd amid ‘desperate situation’",
            "Delly’s amazing road to NBA glory",
            "Roma fight back to earn draw with Lazio in fierce derby",
            "Bess' maiden century leads Yorkshire to record win",
            "Premier League: 10 talking points from the weekend’s action",
            "Manchester United reach Women’s FA Cup final after Bizet and Clinton sink City",
            "Inspired Wales top group as England falter",
            "Papers: Crystal Palace plot sensational swoop for Man Utd star Rashford",
            "Irish World Cup hopes ended by loss to Bangladesh",
            "Gary Neville tears into Man Utd flops and tells Ruben Amorim his biggest problem",
            "Demidov fever: New Montreal Canadiens sniper bringing fanfare frenzy",
            "Danny Dyer Developing Play About His Friendship With “Mentor” Harold Pinter",
            "Man Utd keeper HOWLER, Barnes double Newcastle run riot and move fourth",
            "Winning numbers drawn in Saturday’s Powerball",
            "Gal lines up SBW bout - and McGuire too",
            "Raptors sign centre Colin Castleton",
            "West Ham: Mohamed Salah examination a 'great education' for Ollie Scarles, says Graham Potter",
            "Paige Bueckers' new Unrivaled contract is a sobering reminder of WNBA salaries",
            "Rioli wins place among greats",
            "GdS: Milan&8217;s new Sporting Director between two &8211; who Furlani will interview first",
            "Raptors dominate Hornets despite resting starters",
            "Bryson Dechambeau reveals ruthless Rory McIlroy snub during Masters climax",
            "Hatred on an Alberta golf course",
            "Jordan Nobbs Column: England Have Impressed So Far But Must Be Wary of Tough Japan Challenge",
            "Rory McIlroy wins Masters in dramatic fashion, becomes 6th golfer to complete career Slam",
            "Kashvee gets maiden call-up, regulars return for ODI tri-series in Sri Lanka",
            "‘Thrown under the bus’: Jones unleashes",
            "Mogbo has first triple-double of his career",
            "RCB extend winning run away from home as Kohli and Salt sink Royals",
            "Play Connections: Sports Edition. Tackle Today’s Puzzle.",
            "Trump commends Rory McIlroy's 'tremendous courage' fighting for Masters win on Sunday: 'It was amazing'",
            "Gary Neville reveals Manchester United's 'biggest problem' as he tears into his former side after their woeful 4-1 defeat by Newcastle",
            "Roy Keane makes Arsenal claim after Mohamed Salah signs new Liverpool deal",
            "New Bears guard Jonah Jackson sees Chicago as a place where he can win a ring",
            "Galvin to depart Tigers after knocking back record contract extension",
            "Wild in action against the Ducks after overtime win",
            "WATCH: NFL commissioner says players ‘should stand for the national anthem’",
            "'They are not a very good team' - Neville's verdict on 'desperate situation' at Man Utd",
            "Rory McIlroy calls out Tiger Woods and three other golf icons for 'tough' comments about him",
            "Masters champion Rory McIlroy says he overcomes performance anxiety by visualizing the worst-case scenario",
            "How Rory topped Tiger's 2019 Masters win on 'one of greatest days in golf'"
        ]
    },
    "Topic 2": {
        "keywords": [
            "ai",
            "apple",
            "switch",
            "ps5",
            "new",
            "2025",
            "video",
            "marathon",
            "intelligence",
            "nintendo"
        ],
        "titles": [
            "Action RPG Rise of Rebellion Launches April 21 for PC",
            "AICTE sets up panel to embed AI across disciplines, eyes 4 crore students",
            "These 7 video games have amazing ASMR",
            "V Rising's first big post 1.0 update brings a bevy of additions, combat reworks, and Steam Deck support later this month",
            "Map Your Hikes This Spring With This iOS Feature on iPhone",
            "Marathon Launches September 23 for PS5, Xbox Series X|S, and PC",
            "The role of small language models in enterprise AI",
            "New Elder Scrolls Online expansion unveiled",
            "GTA 6 release window narrows as Mafia: The Old Country date leaks",
            "Monster Energy Supercross 25 Review – Muddy and Mediocre",
            "The Great Chatbot Debate: Do They Really Understand?",
            "Meta Unveils Llama 4 AI Series Featuring New Expert-Based Architecture",
            "We based our decisions on that selling 100,000 copies over 2 years, it did 200,000 copies in the first month: Indie publisher says planning small is key to its success",
            "Microsoft Edge Recently Got a Speed Boost",
            "How one creator visualized AI by using very little AI",
            "Atomfall Tops 2 Million Players",
            "DaVinci Resolve offers a free pro-grade video editing platform",
            "Top 10 AI Tools That Will Transform Your Content Creation in 2025",
            "Infosys co-founder Nandan Nilekani’s 5-point take on AI: hype, trust, enterprise, improving lives, and India",
            "Top 10 AI Content Generator & Writer Tools in 2022",
            "Star, Zee join hands for TV distribution venture",
            "iPhone 20th-Anniversary Edition Could Bring Major Design Overhaul",
            "Top 10 AI Tools in 2023 That Will Make Your Life Easier",
            "The delayed Siri Apple Intelligence features are now coming ‘in the fall’",
            "Apple Maps web app is now available on all devices, including Android",
            "Cedars-Sinai CAIO: AI is transforming relationship between caregivers and IT",
            "The Legend of Zelda: Breath of the Wild's divisive weapon durability is getting a workaround, but it's locked to the Nintendo Switch 2 Edition app",
            "Apple Rolls Out iOS 18.4 With New Languages, Emojis & Apple Intelligence in the EU",
            "Did an AI chatbot help draft the US tariff policy?",
            "EA reminds Battlefield players, things taking place in Labs may or may not make their way to the final game",
            "Nintendo Switch 2 launches straight into Trump's trade war",
            "Between drones and AI, Masters tries to balance past with future",
            "How EA F1 25's My Team 2.0 brings the best of 'Drive To Survive' to the video game",
            "Neelima Chowdary Mulpuri: Engineering the future of agile through the lens of artificial intelligence",
            "Best PC computer deals: Top picks from desktops to all-in-ones",
            "Highest-Grossing Video Game Movies Of All Time",
            "Digital jukebox network AMI Entertainment signs with 7digital, a Songtradr company, as a client",
            "Bungie's Marathon Releases In September On Same Day As Another Big Game",
            "Apple aiming to launch delayed Apple Intelligence features this fall: report",
            "Nvidia unveils new products from supercharged graphics chip to AI that trains robots",
            "Why the climate promises of AI sound a lot like carbon offsets",
            "Motorola Edge 60 Stylus launches tomorrow in India. Details",
            "Vibe coding is changing the way investors think about founders",
            "China’s DeepSeek impresses. But is a ‘fast follow’ good enough in AI?",
            "Think You Can't Game on a Work Laptop? Think Again",
            "The 10 best UNO editions, ranked",
            "EU AI Rules Delay Tech Rollouts, But Civil Societies Say Safety Comes First",
            "Microsoft rolls out AI screenshot tool dubbed 'privacy nightmare'",
            "Apple submits plan for 300 new parking spaces in Cork City hub",
            "PS5 Price to Increase in Europe, Australia, and New Zealand",
            "Sony wins distribution rights to Wheel of Fortune, Jeopardy",
            "Physical Media Won't Cannibalize Streaming Subscriptions, Apple",
            "Artificial Intelligence Explained: What is AI, how it works, where it is used, can it replace human beings?",
            "YouTube launches new AI tool that generates background music for creators",
            "Sipssassin Will Begin Its Mission on Steam Next Month",
            "You’ll be paying extra for ad-free Prime Video come January",
            "Laser-cooled chips: Maybe coming soon-ish to a datacenter near you",
            "Sony Is Increasing the Price of PS5 in Europe, Australia, and New Zealand",
            "The Download: how the military is using AI, and AI’s climate promises",
            "From AI Barbie to 'Ghiblification' - how ChatGPT's image generator put 'insane' pressure on OpenAI",
            "Games Inbox: How much will GTA 6 cost?",
            "Microsoft research shows AI coding tools fall short in key debugging tasks",
            "Action Pixel RPG HYKE: Northern Light(s) Launches This Summer for PS5, Switch, and PC",
            "OnePlus releases Watch 3 with inflated 500 price tag, won’t say why",
            "AI humanoid robot learns to mimic human emotions and behavior",
            "Canva’s latest launch brings AI creativity to every Aussie business",
            "Generative AI is learning to spy for the US military",
            "HubSpot introduces AI-powered workspaces for sales, support teams",
            "Shure MV7i review: An all-in-one mic for podcasts and music",
            "Best Mobile VPN of 2025: Stream on the Go and Avoid Mobile Traffic-Shaping",
            "Acer Swift AI 16 vs. Microsoft Surface Laptop 7: it’s close, but the same laptop remains at the top",
            "Info Edge announces 1:5 stock split, May 7 set as record date",
            "Trump Wants Tariffs to Bring Back U.S. Jobs. They Might Speed Up AI Automation Instead",
            "After months of user complaints, Anthropic debuts new 200/month AI plan",
            "Streaming in Canada on Apple TV+, Crave, Netflix and Prime Video [April 14-20]",
            "The best wireless headphones for 2025: Bluetooth options for every budget",
            "How Dairy Robots Are Changing Work for Cows (and Farmers)",
            "AI is making hyperscalers' sustainability pledges look more and more like a Hail Mary",
            "LimeWire AI Studio Review 2023: Details, Pricing & Features",
            "Remember Payphones? – The TouchArcade Show 608",
            "Nintendo are repeating some very old mistakes with the Switch 2 – Reader’s Feature",
            "7digital and Pex partner to create opportunities for rightsholders and UGC platforms",
            "Everyone's jumping on the AI doll trend - but what are the concerns?",
            "Intel Core i9-12900K claimed to be the World's Best Gaming Processor",
            "7digital announces support of Stationhead live commerce feature",
            "Testing lossless audio on AirPods Max in 2025",
            "Sony announces price rises for PS5 consoles in Europe, UK, Australia, and New Zealand",
            "Rising costs are turning video games into something only for the rich – Reader’s Feature",
            "Bureau of Contacts Has Released Its Full Version on Steam",
            "Apple Maps on the web expands access to more devices and browsers",
            "Don’t get left in the productivity dust—get the latest from MSO Office (and save 20)",
            "How People Are Really Using Gen AI in 2025",
            "The state of AI in 2025: the road ahead",
            "Quantum hardware may be a good match for AI",
            "Samsung QLED takes on OLED",
            "Best Phone to Buy for 2025",
            "NVIDIA Studio Update supercharges DaVinci Resolve with RTX AI Acceleration",
            "Bungie shares first looks at gameplay from its new shooter, Marathon, alongside a release date",
            "Ex-Nintendo fan sells PS5 Pro to buy Switch 2 – Reader’s Feature",
            "Tesla’s 2025 Spring Software Update to add B-Pillar camera access",
            "PS5 price hiked by Sony: Check new costs for affected markets",
            "Video game M&A activity rises to 6.6 billion in Q1 2025, driven by mobile acquisitions",
            "Researchers concerned to find AI models misrepresenting their “reasoning” processes",
            "This Robot Copies Life—By Decomposing",
            "HP OmniBook AI PCs are now up for pre-order, starting at Rs 78,999",
            "I’m very excited for the incredibly thin Samsung Galaxy S25 Edge",
            "How Much Does Does F45 Cost? Here's the Membership Breakdown",
            "Is this robot after our hospitality, retail and healthcare jobs?",
            "Sony raises PS5 price yet again in UK and mainland Europe",
            "GPT-4.5 is the first AI model to pass an authentic Turing test, scientists say",
            "Bungie thinks Marathon can coexist with games like Escape from Tarkov and help players get to the survival storytelling a little bit faster",
            "Hell is other people who won’t wear headphones | Letters",
            "Motorola Edge 60 Fusion Review | A phone that ticks nearly all the boxes",
            "Wealthsimple’s acquihire, Shopify’s AI policy, and Nintendo’s Switch 2 confusion",
            "Marathon Closed Alpha Begins In April, Here's How To Sign Up",
            "How AI is interacting with our creative human processes",
            "Top home projectors to elevate your F1 racing experience",
            "Nintendo Switch 2 games are not too expensive – Reader’s Feature",
            "Marathon is real, looks ridiculously stylish, has a release date, and is getting a closed alpha test this month",
            "Google's genAI powers pharmacy, nurse handoff automation at Manipal Hospitals",
            "iPads will soon feel and function like Macs with Apple’s upcoming iPadOS overhaul: Report",
            "'I've played the new Nintendo Switch 2 – here's why you should pre-order it'",
            "iPad software will reportedly get more Mac-like with the iPadOS 19 redesign",
            "One thing you can do to get over Nintendo Switch 2 prices",
            "How Elder Scrolls Online is shaking up a ten-year-old game in 2025",
            "For the First Time, Artificial Intelligence Is Being Used at a Nuclear Power Plant",
            "My Favorite Amazon Deal of the Day: Samsung's 'The Frame' TV",
            "Take 920 off on Samsung’s 49-inch OLED ultrawide gaming monitor",
            "Poco M7 Pro 5G review: Reliving the 2010’s Android",
            "Protecting Robots in Harsh Environments with Advanced Sealing Systems"
        ]
    },
    "Topic 3": {
        "keywords": [
            "cancer",
            "health",
            "cuts",
            "brain",
            "trump",
            "jr",
            "doctor",
            "diagnosed",
            "rfk",
            "house"
        ],
        "titles": [
            "Measles Is Spreading, and RFK Jr. Is Praising Quacks",
            "RFK Jr. calls FDA a 'sock puppet' for industries in private speech to agency staff",
            "RSV hospitalization rate for seniors is 10 times higher than usual for this point in the season",
            "Trump administration cuts 4m to Princeton’s climate research funding",
            "Mirror tracks your wrinkles",
            "Menstrual Cycle Affects Atopic Dermatitis Exacerbations",
            "Invasive Strep Infections Are Rising in the U.S.",
            "We're finally uncovering fibre's remarkable benefits for body and mind",
            "Teen addicted to vaping diagnosed with popcorn lung: Know what it is and what are the risks",
            "Maximise your weight loss workouts with the expert-recommended ‘3-3-3 rule'",
            "Nizam’s Institute of Medical Sciences, Hyderabad leading the way in Parkinson’s treatment with deep brain stimulation",
            "Can Eating Certain Foods Really Help You Get Pregnant?",
            "Rare virus that killed Gene Hackman's wife linked to 3 deaths in California town",
            "New Ozempic? Scientists develop 'expanding' weight loss pill that slashes more fat than blockbuster drug but DOESN'T make you feel sick",
            "Feeling Extra 'Meh' Lately? You Could Have This Condition",
            "Paul was diagnosed with bowel cancer at 39... the only sign was a problem millions suffer from every day",
            "Cancer pill gave me 'four years of extra time'",
            "Teddi Mellencamp Reveals Multiple Brain Tumors: Here’s Everything the ‘RHOBH’ Star Has Shared About Her Diagnosis",
            "Three million child deaths linked to drug resistance, study shows",
            "Ex-FDA Official Is Worried About the FDA’s New “Anti-Vaccine Tone”",
            "10 daily habits that supercharge memory and boost brain power",
            "White House Releases Results of Trump’s Annual Physical Exam",
            "Get fitter in just 53 days",
            "KFF Health News' 'What the Health?': The Dismantling of HHS",
            "I was so fat I got stuck in football turnstiles - now I've lost 17 stone",
            "Sleep’s Surprising Role in Strengthening Long-Term Memory",
            "What do climate protests actually achieve? More than you think.",
            "White House physician says Trump is in 'excellent health'",
            "Noaa fires hundreds of climate workers after court clears way for dismissals",
            "Eric Dane, ‘Grey’s Anatomy’ star, says he’s been diagnosed with ALS",
            "The Three States That Are Especially Stuck if Congress Cuts Medicaid",
            "GP lists five bowel cancer symptoms that are 'mistaken for other conditions'",
            "The Wellness Industry Has a Pill Problem",
            "Grey's Anatomy star Eric Dane reveals he's been diagnosed with ALS",
            "Alec Baldwin recalls undertaking strict diet before filming Blue Jasmine",
            "Kale and fish among foods that could boost brain health and reduce risk of dementia",
            "Rural populations near federal lands worry job cuts will hurt their communities",
            "HIV, Trans Health, and Covid Research Targeted by Trump Cuts to NIH",
            "US gets D+ grade for rising preterm birth rates, new report finds",
            "Five easy lifestyle changes to get fitter - even if you're too busy for the gym",
            "Eddie Kadi: ‘People think I’m always ready to crack jokes. If you’re a doctor, I don’t ask you to operate on me’",
            "Experimental therapy gantenerumab fails to slow or improve Alzheimer's memory loss in clinical trials",
            "Poor hearing increases early death risk due to 'significant' link to heart failure",
            "5 simple ancient Indian techniques that help remove laziness and increase daily productivity",
            "Young people in the UK: tell us about your gym habits",
            "Title X Freeze Widely Threatens Health Care Access",
            "RFK Jr. wants to target chronic disease in US tribes. A key program to do that was gutted",
            "Some Rural Hospitals Ditch Medicare Advantage",
            "One of the country's leading Alzheimer's projects is in jeopardy",
            "Genetics can spike Indians' cholesterol, but relief may be at hand",
            "What goes on inside toddlers' brains?",
            "Journalists Delve Into Effects of Deep Federal Cuts on Public Health",
            "States sue over Trump administration's sudden halt of pandemic relief aid for schools",
            "Experts Doubt Kennedy’s Timetable for Finding the Cause of Autism",
            "Estimated GFR Equation Matters When Dosing Chemotherapy in Cancer Patients",
            "WTF: Transforming India's fitness landscape through tech, empowerment, and community",
            "I’m stronger than ever at 71 - here's my weekly routine",
            "Trump said cuts wouldn’t affect public safety. Then he fired hundreds of workers who help fight wildfires.",
            "A distinct priming phase regulates CD8 T cell immunity by orchestrating paracrine IL-2 signals | Science",
            "Map: Track the spread of measles in the U.S.",
            "Mercedes steering health drive",
            "Nepal fights wildfires and pollution amidst drier winter",
            "National Park bosses warn that funding cuts threaten conservation",
            "Pridopidine Shows Promise in Subgroup of Huntington's Patients",
            "The Evolution of Ab Training",
            "Women credit 'gorgeous' protein shakes for their 'better mood and energy levels'",
            "Trump:'Fully Fit' to serve as Commander in Chief, Doctor Says",
            "North Carolina flu-related deaths at all-time high",
            "Flimsy Antiabortion Studies Cited in Case to Ban Mifepristone Are Retracted",
            "New ASCO Guidelines for Fertility Preservation in Cancer",
            "An unusual potassium conductance protects Caenorhabditis elegans pharyngeal muscle rhythms against environmental noise",
            "Why Am I Always Tired? Here Are 7 Common Reasons Why You Might Be Feeling Fatigue",
            "Could the Dubai chocolate give you CANCER? Experts warn cheap versions of the viral sweet treat contain carcinogenic chemicals, palm oil and toxins from MOULD",
            "Trump is ‘fully fit’ and manages high cholesterol, says White House physician",
            "Here's how to retrain your brain to crave movement more than screen time",
            "The Many Ways Kennedy Is Already Undermining Vaccines",
            "Saliva test may turn tide on prostate cancer, claim scientists",
            "Desperate for heart surgery for their baby, a family feels the effects of pediatric hospital shortages",
            "A neuroimmune circuit mediates cancer cachexia-associated apathy | Science",
            "‘Fully Fit’: White House Physician Releases Details On President Trump’s ‘Excellent Health’",
            "Sunscreen leaves kids ‘screaming in pain’",
            "9 ways to prevent diabetes",
            "Move over Paleo diet, it's Dinosaur Time, a TikTok trend all about devouring veggies",
            "How to come off Ozempic without gaining weight — the expert's guide",
            "Nourish your liver, enrich your life: Simple ways to keep your liver in good shape",
            "Man links middle-class upbringing to rising health issues in India",
            "I'm a colon cancer surgeon - I banned two bathroom cabinet staples to protect my family from the disease",
            "Covid-19 boosters could keep thousands of kids out of hospitals, but uptake remains low",
            "Doctor explains why your cough won't go away - and how to treat it",
            "The Pandemic Is Not the Only Reason U.S. Students Are Losing Ground",
            "More Psych Hospital Beds Are Needed for Kids, but Neighbors Say Not Here",
            "Dried Fruit and Nuts: When Is the Best Time to Eat Them?",
            "Teddi Mellencamp posts before-and-after pics of last 4 months of cancer journey",
            "Trump HHS Eliminates Office That Sets Poverty Levels Tied to Benefits for at Least 80 Million People",
            "What goes on inside toddlers' brains? A pioneering project is trying to find out",
            "Melanoma patients in England get fast-track access to cancer vaccine",
            "White House doctor says Trump is 'fully fit' in medical report",
            "When adults reject vaccines, children pay the price",
            "Investigational Drug Slows Decline in Early Huntington",
            "The lesser-known symptoms on the face that could be a sign of high cholesterol",
            "Phone a trainer",
            "Sols 4507-4508: “Just Keep Driving”",
            "The Trump Show Comes to the Kennedy Center",
            "How Your Gut Bacteria Affect Weight Loss (and What to Do About It)",
            "RFK Jr. Accuses FDA of Drug Industry Influence That Barred Alternative Remedies",
            "10 simple hacks to eat the right amount of protein everyday",
            "Save your hair. Have soy",
            "Measles exploded in Texas after stagnant vaccine funding. New cuts threaten the same across the US",
            "We tried a new Ozempic trick after piling on the pounds... and are stunned by our transformation",
            "PM wants Australia to co-host 2026 UN climate conference"
        ]
    },
    "Topic 4": {
        "keywords": [
            "snl",
            "season",
            "lou",
            "wood",
            "aimee",
            "mean",
            "lotus",
            "unfunny",
            "dies",
            "white"
        ],
        "titles": [
            "The 24 Sexiest Movie Scenes of All Time",
            "The Baldwins Almost Succeeded",
            "Australian woman unknowingly gives birth to a stranger's baby after IVF clinic error",
            "Who Wants Normal? The Disabled Girls’ Guide to Life by Frances Ryan review – countering the stereotypes",
            "David Cronenberg: Diane Kruger 'didn't need directing' on The Shrouds",
            "Dazed and Confused actor Nicky Katt dies aged 54",
            "Comment on Unexpected Delivery: Pregnant Woman Gives Birth On Bangkok Street Amid Strong Quake – WATCH VIDEO by jokerbet giriş",
            "Michelle Keegan shares tribute to newborn daughter during blissful first weeks of motherhood",
            "Who is Eugene? The Last of Us season 2 premiere's off-screen casualty is actually a character you may have missed in the games",
            "Review: SUSU Theatre Group’s ‘Macbeth’ @ The Annex",
            "Aimee Lou Wood calls SNL parody 'mean and unfunny'",
            "The Axe Files with David Axelrod",
            "The kindness of strangers: I was ready to leave the theatre in disgrace when a gentle usher made me an offer",
            "The Last of Us fans 'work out' Joel Miller's tragic fate and predict season 2's 'crazy' ending",
            "'The Last of Us' Season 2, Episode 1 Recap",
            "Twin baby dies in home birth tragedy",
            "The Last Of Us Brings Pedro Pascal and Bella Ramsey Back for 7 Episodes of Post-Apocalyptic Drama",
            "White Lotus' Aimee Lou Wood calls SNL parody 'mean and unfunny'",
            "265 - Mr. Lasagna",
            "The moisturising SPF behind The White Lotus star Meghann Fahy's glowing skin",
            "Ashton Kutcher and twin Michael talk health, guilt and rift between them",
            "Kate Garraway in hospital dash as son Billy suffers nasty injury",
            "Veteran Kannada comedy actor Bank Janardhan passes away",
            "IT: Welcome to Derry – everything you need to know about the new Max horror series",
            "Why The Last of Us Put Joel In Therapy (and the Video Game Didn't)",
            "White Lotus star Aimee Lou Wood condemns SNL’s ‘mean and unfunny’ sketch",
            "Interview: Cecilia Bengolea on her dancehall film for VF: Reverb",
            "Aimee Lou Wood Hits Out At 'Mean And Unfunny' Saturday Night Live Sketch",
            "Five Ways of Seeing Five Minutes of 'Real People' at the Oscars",
            "Molly-Mae Hague leaves fans 'shocked' with cheeky snap after making major move with Tommy Fury",
            "Tasha Ghouri: I Lost Friends and Family Due To Instant Fame",
            "‘I’m like the TV Lorraine - just more sweary’: at home with the queen of the small screen",
            "Daryl Hannah shows husband Neil Young's softer side in new tour film",
            "The Director of The Last of Us Knows Season 2 Is Daunting As Hell",
            "Aimee Lou Wood: The White Lotus star condemns ‘mean’ Saturday Night Live sketch mocking her teeth",
            "The Last of Us season 2 episode 1 is a purposefully paced, slightly dreary return for Pedro Pascal and Bella Ramsey's highly acclaimed HBO TV show",
            "Es Devlin: Screenshare",
            "Warwick Davis’s family facing ‘difficult next chapter’ as wife’s inquest begins",
            "Escaping Harvey Weinstein was a ‘cat-and-mouse game,’ says Katherine Kendall",
            "50 Scenes That Do Not Appear in the Fox ‘X-Files’ Revival",
            "Hilarious TV vox pop gaffe",
            "Chelsea Handler, Leslie Jones and John Leguizamo among guest hosts to step in for Trevor Noah on 'The Daily Show'",
            "Streaming: The Last Showgirl and the best Las Vegas films",
            "Disney Teases Its Adventurous New Lion King and Up Rides",
            "Please, The Last of Us, don’t ruin Jackson",
            "Bowen Yang sums up the reality of working at ‘SNL’ in 9 words",
            "Only Fools And Horses and Miami Vice star dies aged 78 after suffering from a 'long and painful illness'",
            "The Last of Us season two premiere: 'Future Days' highlights the fracture between Ellie and Joel",
            "Aimee Lou Wood Calls Out 'SNL' for Mean and Unfunny Parody of 'SNL'",
            "David Bowie's daughter Lexi Jones insists she's 'not a copy' of her famous father in defiant message as she releases debut album",
            "Happy ‘Halloween’: The Best Horror-Movie Monsters",
            "How To Date Billy Walsh Charithra Chandran and Sebastian Croft on Rom-Com Diversity",
            "‘The Last of Us’ Season 2 Schedule: When Do New Episodes Come Out?",
            "Jon Hamm Was in His Happy Place on 'SNL,' While Lizzo Performed Successful Image Rehab",
            "The Balcony Movie review – funny/sad film that offers a view into strangers’ lives",
            "SNL 'apologise' to Aimee Lou Wood for 'mean' sketch that mocked her teeth as The White Lotus star continues to slam 'misogynistic' show",
            "Why Helen Hardt’s ‘The Blood Bond Saga’ Should Have a TV Adaptation",
            "Michelle Keegan makes baby Palma name link in sweet tribute after husband Mark Wright explains real meaning",
            "Eva Mendes Made A Rare Comment About Ryan Gosling, And This Is Why We Need More Them In Our Lives",
            "Man fatally stabbed in Rein Bazaar days before wedding; personal enmity suspected to be the motive",
            "Cilic Expecting First Child In 2020",
            "Mr. Douglass in the Room",
            "Jon Hamm has some 'crazy ideas' in spot-on 'The White Lotus' 'SNL' sketch",
            "Put your baby down to nap near a washing machine, expert says",
            "‘Parents left picking popcorn out of their hair’: the meme-soaked magic of A Minecraft Movie",
            "Upstairs Downstairs actress Jean Marsh dies aged 90",
            "Kate's Cancer Diagnosis: Why Are Women Always Pressured to Show Up?",
            "Bridgerton's Hannah Dodd: Francesca Doesn't Chase Validation Like Her Siblings",
            "Viola Davis's Urgent Call to 'Exhume the Ordinary'",
            "The 20 Best Halloween TV Episodes of All Time",
            "Hilarious Channel 7 gaffe goes viral",
            "Marvel Rivals Season 2",
            "The Last of Us fans convinced they have 'worked out' Joel Miller's fate after premiere",
            "Poll shows Kate Ellis heading for shock defeat",
            "5 movies about revolution to watch while you wait for Andor season 2",
            "The Last of Us season 2 premiere leaves 'devastated' fans 'crying their hearts out'",
            "Who is Eugene in The Last of Us season two? Character explained as fans left confused",
            "BBC Breakfast's Sally Nugent swipes 'never in a million' after co-host's direct question",
            "Jon Hamm is that one employee that always overshares in 'Icebreaker' 'SNL' sketch",
            "Motorcyclist dead in horror truck smash",
            "Karl Soderlund, Sally Jessy Raphael’s Husband, Dead at 90",
            "The Last of Us’ Stalkers may be even smarter than in the video game",
            "Missing Carberry man found deceased",
            "‘The Citizen Kane of rock movies’: glam rockers Slade and their bid for cinema greatness",
            "Corinne Found the Perfect Way to Rebel Against The Bachelor",
            "The Love on the Spectrum Siblings Open Up About Life With Connor, Abbey, and Tanner",
            "Pedro Pascal's emotional tribute to Bella Ramsey after major MTV Movie and TV Awards win",
            "Mick Jagger engaged to Melanie Hamrick, who says marriage is a ‘maybe’",
            "The Stolen Girl cast: All you need to know about the stars Disney+'s harrowing new drama",
            "Full list of BBC stars who have died in 2025 in tragic year for broadcaster",
            "Princess Kate's 'mothering' instinct and real family dynamic revealed",
            "Kirstie Alley, 'Cheers' and 'Veronica's Closet' star, dead at 71",
            "Comment on Unexpected Delivery: Pregnant Woman Gives Birth On Bangkok Street Amid Strong Quake – WATCH VIDEO by jokerbet güncel",
            "'I was born without a uterus - now I'm pregnant with my second child after life-changing op'",
            "Can Reality TV Redeem Jake and Logan Paul?",
            "Aimee Lou Wood reacts to ‘SNL’ impression of her ‘White Lotus’ character: ‘mean and unfunny’",
            "Only Fools and Horses and Miami Vice star Mario Ernesto Sánchez dies aged 78",
            "Great British Bake Off star 'in shock' as she announces pregnancy after 'lonely road'",
            "Mario Vargas Llosa: Giant of Latin American literature, dies aged 89",
            "How Georgina Chapman Found Love Again With Adrien Brody",
            "‘I’ve pulled myself out of a very dark abyss’: Garbage’s Shirley Manson on depression, sexism, dodgy hips and happiness",
            "Former LSU Wide Receiver Kyren Lacy Suspected to Have Died From Self-Inflicted Gunshot Wound",
            "Post your questions for Bonnie Raitt",
            "Ted Kotcheff, director of First Blood, Weekend at Bernie’s and Wake in Fright, dies aged 94",
            "Your Friends and Neighbors Release Schedule: When Do New Episodes Come Out?",
            "She was tracking post-Roe abortions. The government just pulled her funding",
            "Ironman legend Barry Rodgers dead at 74",
            "Aimee Lou Wood Says The SNL Parody Of The White Lotus Was Mean And Unfunny",
            "The Last of Us Season-Premiere Recap: Welcome to Wyoming"
        ]
    },
    "Topic 5": {
        "keywords": [
            "tariffs",
            "trump",
            "tariff",
            "trumps",
            "china",
            "trade",
            "housing",
            "war",
            "smartphones",
            "electronics"
        ],
        "titles": [
            "Trump's 'buy' tip on social media before tariffs pause made money for investors",
            "Is this the worst most boring election campaign ever? Will voting make any difference? | First Dog on the Moon",
            "Trump’s Trade War Unleashes Global Uncertainty",
            "Tariff turmoil to continue as Trump warns nobody ‘off the hook’ amid smartphone exemption – US politics live",
            "Republicans race to heap praise on Trump's tariffs as economy spirals",
            "Judge in Fox News-Dominion defamation trial: 'The parties have resolved their case'",
            "Major parties have no solution to the housing crisis",
            "Swiss voters reject corporate tax overhaul",
            "Will the next iPhone charge wirelessly?",
            "Goldman Sachs cuts Europe's STOXX 600 forecast for second time this month",
            "The Kids Are Leaning Right: How the Manosphere Is Shaping Voters",
            "Banks an early drag on stocks",
            "Markets got a tariff pause. But damage to global confidence in US could last.",
            "The latest on the unfolding trade war with China",
            "FTSE 100 surges and global markets rise after Trump’s tech tariff reprieve",
            "Apple gets a tariff exemption on iPhones and, well, everything else",
            "Trump says there will be NO tariff exemptions in dramatic reversal that'll hit Americans hard",
            "Boosting R&D Could Lift Australia’s GDP by 3, Report Finds",
            "Tesla stops taking orders in China for two models imported from US",
            "Why ‘Bidenomics’ Isn’t Working For Biden",
            "Trump mulls semiconductor levies after lifting reciprocal tariffs on electronics",
            "ASX lifts as miners and banks rally",
            "As it happened: Albanese, Dutton signature policies revealed; economists warn of house price surge",
            "Turnbull dinner cost 30k",
            "Some on-air claims about Dominion Voting Systems were false, Fox News acknowledges in statement after deal is announced",
            "BP dropped its green pledges and turned back to oil. Now the price of crude has collapsed",
            "Rival housing policies to dominate debate between Chalmers and Taylor",
            "Xi Jinping celebrates China’s rising power — and his own",
            "Elizabeth Warren: Congress Has to Take Tariff Authority Away from Trump",
            "Trump vows nobody getting 'off the hook' for 'unfair' trade balances, says there was no tariff 'exception'",
            "Trump’s Tariff War Has Added Risk to U.S. Bonds, Long the Surest Bet in Global Finance",
            "Two more agencies admit underquoting",
            "Oil rise fails to lift stocks",
            "Former PMs turn out, senator has MAGA moment and housing debate heats up",
            "Stocks hit record again. Is Trump the reason?",
            "China urges US to 'completely cancel' tariffs",
            "Trump to impose new chip tariffs, including on electronics exempted days ago",
            "How Should You Invest in 529 College Savings Plans During Market Swings?",
            "Rethinking reserve strategies: Will Central Banks dump the dollar?",
            "Stock markets rise on signs of Trump tariff retreat; British Steel races to keep furnaces burning – business live",
            "Trump Adds Tariff Exemptions for Smartphones, Computers and Other Electronics",
            "Grim warning every homebuyer needs to hear as Peter Dutton proposes radical new housing plan that's never been tried before in Australia: 'Worst decision'",
            "Albanese launches campaign in Perth promising housing boost and tax deductions – video",
            "China ends floats logjam",
            "Apple, Nvidia, and Microsoft can 'breathe a huge sigh of relief' after Trump's China tariff exemptions",
            "Tariffs on imported semiconductor chips coming soon, Trump says",
            "America has already lost the robot war to China",
            "Singapore downgrades GDP forecast for 2025 amid US-China trade war; PM Wong’s message to young Singaporeans and first-time voters: Singapore live news",
            "Leaders brush off warnings from economists that duelling housing policies will drive up prices in Australia",
            "Ad review: HDFC Mutual Fund’s new campaign finds value in everyday choices",
            "Gordon Brown accuses Trump of ‘weaponising’ global trade system",
            "Hundreds of flights cancelled in China as strong winds hit capital",
            "Faisal Islam: Trump's iPhone olive branch is a significant trade war retreat",
            "How Rare Earths Are Playing a Pivotal Role in the U.S.-China Trade War",
            "Gretchen Whitmer Fell Into Trump’s Tariff Trap",
            "Trump administration officials say tariff reprieve on electronics is temporary",
            "Tariffs are an industry nightmare, but digital games seem safe – for now | Opinion",
            "Housing is the right problem but our leaders have the wrong policies",
            "Meet the woman steering Biden's bipartisan winning streak on Capitol Hill",
            "Can Philadelphia’s ballot counters outrun election lies?",
            "EXCLUSIVE: Jon Husted Is Ready To Get To Work — In The Senate And On The Campaign Trail",
            "Tesla's moment of truth, Trump Media stock spikes, and Warren Buffett wins again: Markets news roundup",
            "Trump’s Preoccupation With Tariffs",
            "Dominion still has pending lawsuits against election deniers such as Rudy Giuliani and Sidney Powell",
            "Trump administration backs off Nvidia's 'H20' chip crackdown after Mar-a-Lago dinner",
            "What the World Learned from Donald Trump’s Tariff Week",
            "Explained | The BRICS common currency push",
            "PCs will be exempt from Trump's tariffs, but consoles will not",
            "The Treasury Secretary Is Wrong About How Most Retirees See the Stock Market",
            "What Are Stablecoins?",
            "Turnbull and Shorten speak of mistakes",
            "Trump exempts smartphones and computers from new tariffs",
            "SCOOP: Arizona to begin removing as many as 50K noncitizens from voter rolls following lawsuit",
            "'Difficult to say with a straight face': Tapper reacts to Fox News' statement on settlement",
            "BEIJING SECRETLY CHOKING OFF US EXPORTS...",
            "Not Known for Squishy Takes, Stephen Miller Says Tariffs Will Save US From 'Complete Economic Domination'",
            "Agent payouts to shift stock",
            "Understanding the Global Macroeconomic Impacts of Trump’s Tariffs",
            "State Department wants staff to report instances of alleged anti-Christian bias during Biden's term",
            "Tariff pause for India offers relief, yet China’s export spillover remains a risk: Jigar Mistry",
            "Trump warns tariffs on smartphones will be back in ‘a month or two’",
            "Posthaste: Stressed-out bond markets forced Trump into tariff U-turn. Could it happen again?",
            "Trump warns exemptions on smartphones, electronics will be short-lived, promises future tariffs",
            "Dutton says he wants house prices to 'steadily increase' in Australia",
            "Netflix, Goldman Sachs, Citigroup, and more stocks to watch this week",
            "Trump’s Tariffs: Will They Affect Your Tech Prices?",
            "Tips to make your small house look bigger",
            "Apple shares lead tech higher after tariff exemptions",
            "A devastating trade spat with China shows few signs of abating",
            "Electronics exempted from reciprocal tariffs will soon be subject to new semiconductor tariffs instead",
            "Why Biden Is Losing Support Among Voters Of Color",
            "David Pocock says major parties lack the ‘courage’ to tackle housing crisis – as it happened",
            "Smartphones and computers are now spared from Trump's reciprocal tariffs",
            "Why Beijing is not backing down on tariffs",
            "Supply chain strategy must go beyond transportation, says Supply Chain Canada president",
            "How Contracts Can Help Firms Navigate the Uncertainty of Global Tariffs",
            "Trump reduces tariffs on PCs, components, smartphones",
            "Trump news at a glance: Deep confusion as Trump signals new tariffs on smartphones and computers",
            "How Kyrsten Sinema's decision makes Democrats' 2024 Senate map tighter",
            "Why you’re getting poorer right now",
            "Electoral reform: Hashtag fresh thinking",
            "Democrats Widely Blast Trump’s Tariffs, but Not Tariffs Overall",
            "Step-by-Step Guide to Buying Your First Property in Malta as a Foreigner",
            "China Halts Critical Rare Earth Exports as Trade War Intensifies",
            "Will iPhones cost more because of Trump's tariffs on China?",
            "Your Questions Answered: I want to invest in equity mutual funds. Please elaborate on Nifty Top 10 Equal Weight Index",
            "Trump tariffs: Donald Trump downplays tariffs walk-back, says no country ‘off the hook’",
            "A Devastating Trade Spat With China Shows Few Signs of Abating",
            "We're treated like peasants, say tenants in fight over mouldy homes"
        ]
    },
    "Topic 6": {
        "keywords": [
            "khan",
            "ambedkar",
            "kapoor",
            "modi",
            "mp",
            "riots",
            "twotier",
            "arjun",
            "policing",
            "mps"
        ],
        "titles": [
            "26/11 Mumbai Terror Attacks: Tahawwur Rana Singing Before NIA, Pakistan Exposed? - News18",
            "REVEALED for the FIRST time in 38 years: Arjun Kapoor opens up on Mr India's DELETED massage parlour scene: Mr India ends up massaging somebody. You can see the skin moving, cucumber flying",
            "Data | Nearly 40 Indians paid bribes to use public services, highest among most Asian nations",
            "Pawan Kalyan's wife Anna Lezhneva shaves her head at Tirupati temple due to this reason, watch",
            "Message on Mumbai police helpline threatens actor Salman Khan; case lodged",
            "MPs reject two-tier policing claims in 2024 riots",
            "UK MP refused entry to Hong Kong accuses China of ‘hidden blacklist’",
            "Claims of two-tier policing during 2024 summer riots ‘baseless’, report finds",
            "MP: Modi Revived Cooperative Moment By Creating Separate Ministry",
            "Kareena Kapoor Khan and Prithviraj Sukumaran headline Meghna Gulzar’s Daayra",
            "Dhanush and Rashmika Shooting For Kubera To Wrap Up Work",
            "‘STR 49’: Sai Abhyankkar to compose music for Silambarasan and Ramkumar Balakrishnan’s film",
            "Where Are Missing Saroops of Guru Granth Sahib: Analysing SGPC’s Reactions, Response & Actions",
            "BofA Seeks to Rebuild India Investment Banking Team Post Probe, Resignations",
            "How Election Commission came into being after Ambedkar brought amendment in Constituent Assembly",
            "Kareena Kapoor Khan, Prithviraj Sukumaran to star in Meghna Gulzar’s crime-drama ‘Daayra’",
            "India's Modi clinches defence, energy deals in Sri Lanka",
            "Pawan Kalyan Returns With Son After Singapore School Fire; Imran Khan Breaks Silence On Divorce From Ex-Wif - News18",
            "THIS superstar cheated on his 15 year younger wife who gave bold scenes in Rishi Kapoor's film, ended her career because..., reunited after 27 years due to...",
            "'His wallet is full': PNB scam whistleblower on Mehul Choksi's India extradition after arrest in Belgium - Times of India",
            "No evidence of 'two-tier policing' in handling of Southport riots, MPs say",
            "Why Akal Takht Sahib Acting Jathedar Suddenly Announced to Honour 11 Sikh Personalities",
            "BCCI slaps heavy fine on Delhi Capitals skipper Axar Patel for breaching this IPL code of conduct against Mumbai Indians",
            "Salman Khan gets fresh death threat: 'Will blow up his car with bomb'",
            "SHOCKING: Arjun Kapoor reveals Rahul Bhat snubbed him when Arjun messaged him to praise his Black Warrant performance: He didn't pick up my call. I messaged him, 'Can I call you'. He replied, 'For what?'",
            "When Kareena got real about the catfight with Priyanka",
            "Prosecutors ‘hampered’ police by blocking facts about Southport killer say MPs",
            "KTR says Congress failed to implement SC declaration, demands apology",
            "Bollywood posters copied from Hollywood",
            "Amitabh Bachchan feels stuck at 49M, fans offer hilarious tips to grow followers: 'Rekha Ji k saath...'",
            "No evidence of ‘two-tier policing’ in summer riots response – MPs",
            "17 companies of CAPF deployed in Murshidabad, situation under control says West Bengal DGP - The Hindu",
            "Police seize car in Oxfordshire after owner drove 'anti-socially'",
            "Modi govt only pays lip service to Ambedkar, BJP-RSS his enemies: Congress chief Kharge",
            "Issue of Sri Guru Granth Sahib Ji’s Saroop – Who Are The Real Culprits?",
            "Ambedkar: A revolutionary's vision for equality continues to inspire and challenge today's India",
            "An Ambedkar statue, a nameplate, and a midnight slugfest between Congress and BJP in Rajasthan",
            "MP barred from Hong Kong says it was to 'shut me up'",
            "Former Himachal Pradesh Minister Virendra Kanwar gets ransom call, death threat; case registered",
            "IPL reschedule due to assembly elections",
            "'Woh jo chhoti Alia Bhatt thi...': Randeep Hooda clarifies his stance against Kangana Ranaut",
            "Indian pot belly: From status symbol to silent killer",
            "Country dedicated to social justice due to Ambedkar’s inspiration: PM Modi",
            "When Mammootty spoke about playing Dr. Babasaheb Ambedkar, This was an entirely imaginary interpretation of the great man",
            "Andhra Pradesh CM, YSRC Chief Pay Tributes To BR Ambedkar",
            "Kaisi Teri Khudgarzi to Darr Khuda Say; Top 7 Pakistani dramas with more toxic husbands than Indian serials",
            "Report: Baylor officials did nothing after being notified of assaults",
            "'I want to slap this boy': Huma Qureshi allegedly snaps at Irrfan Khan's son Babil Khan; know exactly what happened",
            "Tulip Siddiq hits out at 'politically motivated' claims as Bangladesh issues arrest warrant for Labour MP",
            "MP refused entry to Hong Kong says it should be 'wake-up call' to all parliamentarians",
            "Khalsa Jee Ke Bol Baaley : Guru Khalsa Panth – Dr. Gurpreet Singh During Discussion by Samvad",
            "Jaat box office collection day 4: Sunny Deol's film swiftly enters Rs...; Salman Khan's Sikandar slumps down to...",
            "Arjun Kapoor on cloud nine as Transformers director Michael Bay starts following him on Instagram; draws parallels between Ed Harris in The Rock and John Abraham in Pathaan",
            "Modi govt only pays lip service to Ambedkar, BJP-RSS his enemies: Kharge",
            "‘Good Bad Ugly’ day 4 box office collection: Ajith Kumar-starrer earns 150 crore worldwide",
            "Punjab LoP Bajwa booked after being quizzed by police over '50 bombs' claim",
            "Prabhas and Sandeep Reddy Vanga's 'Spirit': Ready to Roll",
            "How Gurbani Strengthened Me in Prison Cells: Exclusive Talk with Bhai Lal Singh Akalgarh",
            "MEET the world’s richest actor, never gave a blockbuster film, has a net worth of, lived on streets, beats Tom Cruise, Shah Rukh Khan, Ryan Reynolds, he is...",
            "Telangana to launch Bhu Bharati portal today"
        ]
    },
    "Topic 7": {
        "keywords": [
            "ukraine",
            "russian",
            "trump",
            "visit",
            "sumy",
            "deportation",
            "attack",
            "zelenskyy",
            "missile",
            "ukrainian"
        ],
        "titles": [
            "Explained: The legal fight to stop Mahmoud Khalil’s deportation",
            "Far-right groups gain ground in Sweden and Germany amid migrant influx",
            "Trump condemns 'terrible' Russian missile attack on Sumy as Zelensky invites US President to Ukraine",
            "Volodymyr Zelenskyy's full 2025 60 Minutes interview in Ukrainian",
            "Fifteen foreigners nabbed for illegal stay in India, sent for deportation",
            "Donald Trump calls Sumy missile strike 'mistake' as death toll rises to 34",
            "As Rohingya refugees continue to flee from persecution, here’s how you can help",
            "Republican Congressman on Suspected Islamic Radicals: Kill Them All",
            "Trump officials renew opposition to ruling on Maryland man wrongly deported to El Salvador",
            "Homeless drug dealer caught in his car faces deportation",
            "More than 200 civilians killed as Sudan’s RSF attacks Darfur displacement camps",
            "Zelensky urges Trump to visit Ukraine ahead of deal with Russia",
            "Iranian foreign minister will consult on Iran-U.S. talks during visit to Russia",
            "Troops arrive at the border to help with enforcement despite fewer migrant crossings",
            "Zelenskyy Urges Trump To Visit Ukraine After Dozens Killed By Russian Missile Attack",
            "Ukrainian military officers attempt to dispel what they call myths of Russia's war",
            "State Department suggests deported Salvadoran man is beyond U.S. reach",
            "News Wrap: Sessions insists he didn’t lie about Russian contacts to Senate",
            "How Trump and His Allies Have Run With Russian Propaganda",
            "Donald Trump calls Russia's strike on Sumy 'mistake', Zelenskyy says come see 'what Putin did,' urges US President to visit Ukraine",
            "Rubio Says 10 More People Have Been Expelled to El Salvador",
            "In 3 Months, 3 Immigrants Have Died at a Private Detention Center in California",
            "EU foreign ministers meet in wake of deadly Russian attack on Sumy as Zelenskyy issues plea for Trump to visit Ukraine – Europe live",
            "To speed deportations, Trump revives rarely used laws",
            "At least 31 killed, 80 injured in Russian attack on Ukrainian city",
            "Trump Scores Massive Win as Judge Rules He Can Deport Mahmoud Khalil",
            "Ukraine could be carved up 'like Germany after World War Two' as part of US-backed peace deal in bid to end war - as Trump envoy meets with Putin at the same time Russian drones bring terror to Kyiv",
            "Why one deportation case has legal scholars afraid for even U.S. citizens",
            "Germany ready to send Taurus missiles to Ukraine"
        ]
    },
    "Topic 8": {
        "keywords": [
            "le",
            "la",
            "les",
            "et",
            "une",
            "pour",
            "voici",
            "des",
            "qui",
            "sur"
        ],
        "titles": [
            "Mondiaux féminins: le Canada plie devant son ennemi juré",
            "Fraudés jusqu'à la mort: une dame sauvée par son entourage qui ne l'a jamais lâchée",
            "Un ado de 17 ans aurait tué ses parents et planifié d’assassiner Donald Trump",
            "«Dans quelle job apprends-tu devant tout le monde, à part premier ministre du Canada?»: Rosalie Vaillancourt se confie sur sa co-animation de l'émission «Sortez-moi d'ici»",
            "Hitster: des chansons choisies par et pour le Québec",
            "Voici pourquoi une bonne nuit de sommeil prévient l'obésité et favorise la perte de poids",
            "«C’était vraiment une surprise»: Demidov s’entraîne au Complexe CN de Brossard",
            "Testés: voici les meilleurs biscuits à l’érable sur les tablettes de votre épicerie",
            "«Elle avait une ardente volonté de réussir»: la vie tumultueuse de la chanteuse Sylvie Vartan, racontée dans une biographie non autorisée",
            "Le pouvoir terrifiant d’un seul homme à semer le chaos",
            "«Je suis fasciné par le magma humain», confie l'acteur français Daniel Auteuil, qui réalise le film «Le fil»",
            "Les Oilers vont encore piger en Europe",
            "Voici les meilleurs aliments à consommer pour éviter les crampes musculaires",
            "Six éléments à surveiller au Tournoi des Maîtres en ce dimanche: la lutte sans merci entre Rory McIlroy et Bryson DeChambeau",
            "Contre Trump: faire comme l’Europe avec la Chine",
            "Voici pourquoi il faut manger des champignons pour vivre plus longtemps",
            "Ivan Demidov pourra compter sur le vétéran Samuel Montembeault",
            "Elle quitte les réseaux sociaux pour réfléchir... et perd 47 livres",
            "«Ta fille est dans Hitster»: le jeu musical qui fait fureur auprès des Québécois et de nos artistes"
        ]
    }
}